init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-29 Sun 12:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Configuration File</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pierce Wang" />
<link rel="stylesheet" href="https://sandyuraz.com/styles/org.min.css">
</head>
<body>
<div id="content">
<h1 class="title">Emacs Configuration File</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga49afc1">1. Credits</a></li>
<li><a href="#org010d3d3">2. Installing</a>
<ul>
<li><a href="#org5e1cfed">2.1. Dependencies</a></li>
<li><a href="#orge070fd7">2.2. Meta</a></li>
<li><a href="#org601cc53">2.3. Headers</a></li>
</ul>
</li>
<li><a href="#org26a3165">3. Startup</a>
<ul>
<li><a href="#orgbba4451">3.1. Garbage Collection</a></li>
<li><a href="#org67c25e8">3.2. Package Setup</a></li>
<li><a href="#org6eff967">3.3. Use package</a></li>
</ul>
</li>
<li><a href="#org35379d3">4. Configurations</a>
<ul>
<li><a href="#org4045348">4.1. Emacs Stuff</a>
<ul>
<li><a href="#orgaa21a50">4.1.1. Startup Time Test</a></li>
<li><a href="#orgc0dd1bd">4.1.2. Custom Set Variables</a></li>
<li><a href="#org5e26efc">4.1.3. Confirm Kill Emacs</a></li>
</ul>
</li>
<li><a href="#orgba170a7">4.2. Custom Functions</a>
<ul>
<li><a href="#orga2db8c1">4.2.1. append-to-list</a></li>
<li><a href="#orgb61bded">4.2.2. Increment/Decrement Numbers</a></li>
<li><a href="#org688a47d">4.2.3. Insert Directory (obsolete?)</a></li>
<li><a href="#org0b373be">4.2.4. Ignore Error Wrapping Function</a></li>
<li><a href="#orgb090fb5">4.2.5. Insert Org-mode Image</a></li>
<li><a href="#orge354841">4.2.6. Keyboard Coding System</a></li>
<li><a href="#orgfa0c84f">4.2.7. Dired Open File</a></li>
<li><a href="#org66fa246">4.2.8. Copy MLA org-file</a></li>
<li><a href="#org2aa0a23">4.2.9. Lookup in Dictionary (Apple)</a></li>
<li><a href="#orgb592889">4.2.10. Test network (internet-up-p)</a></li>
<li><a href="#orgf4ce004">4.2.11. Get org link&#xa0;&#xa0;&#xa0;<span class="tag"><span class="keybinds">keybinds</span></span></a></li>
<li><a href="#orgcdcf3c0">4.2.12. Make-shell</a></li>
</ul>
</li>
<li><a href="#org3d17f4d">4.3. Modifier Keys</a></li>
<li><a href="#org697ff9c">4.4. OS Integration</a></li>
<li><a href="#org80c3e14">4.5. Visuals</a>
<ul>
<li><a href="#org95f69ba">4.5.1. All the Icons</a></li>
<li><a href="#orgf7447bd">4.5.2. Doom Theme</a></li>
<li><a href="#orge4d91e0">4.5.3. <span class="done DISABLED">DISABLED</span> Light Theme</a></li>
<li><a href="#orgcb0c9db">4.5.4. Frame Resize Pixelwise</a></li>
</ul>
</li>
<li><a href="#org0ece99e">4.6. Windows and Frames</a>
<ul>
<li><a href="#orgfc52e1c">4.6.1. Movement Between Windows</a></li>
<li><a href="#org8caa96d">4.6.2. Window Management</a></li>
</ul>
</li>
<li><a href="#org8285897">4.7. Treemacs</a></li>
<li><a href="#orgea93ddd">4.8. ztree (Tool for diffing and merging directories)</a></li>
<li><a href="#org8f9cb1a">4.9. Fonts</a>
<ul>
<li><a href="#orgc6cdf8b">4.9.1. <span class="done DISABLED">DISABLED</span> Chinese Font with English Font&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ARCHIVE">ARCHIVE</span></span></a></li>
<li><a href="#org152b6c9">4.9.2. Set default font and configure font resizing</a></li>
<li><a href="#org136b05e">4.9.3. Variable Pitch Default Font</a></li>
<li><a href="#orge994f7e">4.9.4. Mixed Pitch</a></li>
</ul>
</li>
<li><a href="#org5c4f7dc">4.10. GPG</a></li>
<li><a href="#orgfbfc9e6">4.11. Passwords</a></li>
<li><a href="#org8a287ec">4.12. Mode Line</a>
<ul>
<li><a href="#orge01f0a4">4.12.1. <span class="done DISABLED">DISABLED</span> Smart Mode Line</a></li>
<li><a href="#org3c2a223">4.12.2. Powerline</a></li>
<li><a href="#orga02edcb">4.12.3. Other Configuration</a></li>
<li><a href="#orgf950949">4.12.4. <span class="done DISABLED">DISABLED</span> Time display</a></li>
<li><a href="#orgb8baa44">4.12.5. <span class="done DISABLED">DISABLED</span> Battery display</a></li>
</ul>
</li>
<li><a href="#org3d23e85">4.13. Narrowing Frameworks</a>
<ul>
<li><a href="#org7a65331">4.13.1. <span class="done DISABLED">DISABLED</span> Helm</a></li>
<li><a href="#orge0bf378">4.13.2. Ivy</a></li>
</ul>
</li>
<li><a href="#org00a4fc0">4.14. Diary</a>
<ul>
<li><a href="#org3841d2c">4.14.1. Diary file</a></li>
<li><a href="#org0b0b469">4.14.2. Appointments Setup</a></li>
</ul>
</li>
<li><a href="#orga52a2ac">4.15. Org-mode</a>
<ul>
<li><a href="#org655c10f">4.15.1. Setting orgmode directories:</a></li>
<li><a href="#orge8d4607">4.15.2. Startup Settings</a></li>
<li><a href="#orgcf5996b">4.15.3. Todo keywords</a></li>
<li><a href="#org410252a">4.15.4. Keybinds</a></li>
<li><a href="#orgefa447a">4.15.5. Tags</a></li>
<li><a href="#orgf22e2d7">4.15.6. Log when tasks are marked as done:</a></li>
<li><a href="#org5814b77">4.15.7. Org Refile:</a></li>
<li><a href="#orgb071083">4.15.8. Agenda</a></li>
<li><a href="#org43508bc">4.15.9. <span class="done DISABLED">DISABLED</span> org-super-agenda</a></li>
<li><a href="#orgad1e099">4.15.10. Quick Capture</a></li>
<li><a href="#orgd27f930">4.15.11. MobileOrg</a></li>
<li><a href="#orge35b245">4.15.12. Crypt</a></li>
<li><a href="#org2b61900">4.15.13. Babel</a></li>
<li><a href="#orga4b6541">4.15.14. Org-drill</a></li>
<li><a href="#org33d016d">4.15.15. Latex</a></li>
<li><a href="#org54f7395">4.15.16. Org Superstar (Bullets revamped)</a></li>
<li><a href="#org616eb63">4.15.17. Export</a></li>
<li><a href="#org4ed0c4c">4.15.18. org-noter: PDF Annotation</a></li>
<li><a href="#orgff4f453">4.15.19. <span class="todo TODO">TODO</span> Diary</a></li>
<li><a href="#orga9c274b">4.15.20. org-gcal: Calendar Integration</a></li>
<li><a href="#orgdcce7bc">4.15.21. org-reveal</a></li>
</ul>
</li>
<li><a href="#org39b78c5">4.16. LaTeX</a>
<ul>
<li><a href="#org206727b">4.16.1. AUCTEX</a></li>
<li><a href="#orgd20dc12">4.16.2. Classes - Adding Academic XeTeX Times New Roman Class</a></li>
</ul>
</li>
<li><a href="#org47aaa48">4.17. Evil</a>
<ul>
<li><a href="#orgeadceb2">4.17.1. Normal Mode Keybinds</a></li>
</ul>
</li>
<li><a href="#orgfffb144">4.18. Programming Environments</a>
<ul>
<li><a href="#org33e2861">4.18.1. Python</a></li>
<li><a href="#org8e1a39f">4.18.2. Octave</a></li>
<li><a href="#orgd8ed50a">4.18.3. Java</a></li>
</ul>
</li>
<li><a href="#org0c0d45a">4.19. Macros</a>
<ul>
<li><a href="#orgb466fb5">4.19.1. Macro Query</a></li>
</ul>
</li>
<li><a href="#org4bbb8c8">4.20. Magit</a></li>
<li><a href="#org681e7d6">4.21. yasnippet - Yet Another Snippet Extension</a></li>
<li><a href="#orgd05070a">4.22. Backups</a></li>
<li><a href="#orgab6df70">4.23. Daemon</a></li>
<li><a href="#org3dc346e">4.24. Revert Mode</a></li>
<li><a href="#org3bd7c22">4.25. Calendar</a>
<ul>
<li><a href="#org313d633">4.25.1. Date Style</a></li>
</ul>
</li>
<li><a href="#org8a1af37">4.26. Artist Mode</a></li>
<li><a href="#orgdf8b073">4.27. Image Mode</a></li>
<li><a href="#orgc55a8b1">4.28. Flyspell mode</a></li>
<li><a href="#org1855379">4.29. Games</a>
<ul>
<li><a href="#orgb24807e">4.29.1. Tetris</a></li>
<li><a href="#orgcfab0ce">4.29.2. Retris</a></li>
</ul>
</li>
<li><a href="#orge437a3e">4.30. Desktop Save</a></li>
<li><a href="#org090629c">4.31. ERC</a></li>
<li><a href="#org0d43189">4.32. Keybinds</a>
<ul>
<li><a href="#orgef56199">4.32.1. which-key</a></li>
<li><a href="#org58fd50a">4.32.2. Scrolling</a></li>
</ul>
</li>
<li><a href="#org49cde2b">4.33. Hydra for Resizing Windows</a></li>
<li><a href="#orgcb0993c">4.34. User Configuration</a></li>
<li><a href="#org26e770d">4.35. Buffer Mangement</a>
<ul>
<li><a href="#org036e0a8">4.35.1. <span class="done DISABLED">DISABLED</span> IBuffer</a></li>
<li><a href="#org078583f">4.35.2. Bufler - Alphapapa</a></li>
</ul>
</li>
<li><a href="#orgadbbf70">4.36. Dired</a>
<ul>
<li><a href="#org9377561">4.36.1. dired-quick-sort.el</a></li>
<li><a href="#org760911d">4.36.2. Human readable format for ls switches (<code>-h</code>)</a></li>
</ul>
</li>
<li><a href="#orgb8dc275">4.37. Disabled Functions</a></li>
<li><a href="#orgd1cc7a5">4.38. browse-url-firefox-program</a></li>
<li><a href="#org0daf975">4.39. mu4e</a>
<ul>
<li><a href="#org229abe1">4.39.1. mu4e-alert</a></li>
<li><a href="#orgade4b2d">4.39.2. mu4e keybinds&#xa0;&#xa0;&#xa0;<span class="tag"><span class="keybinds">keybinds</span></span></a></li>
</ul>
</li>
<li><a href="#org413ec7d">4.40. OHS</a>
<ul>
<li><a href="#orgc7427f2">4.40.1. <span class="done DISABLED">DISABLED</span> Schoolyear Calculation for sexp Diary Entries&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ARCHIVE">ARCHIVE</span></span></a></li>
<li><a href="#orgca26908">4.40.2. Generate OHS Class Calendar</a></li>
<li><a href="#org140546a">4.40.3. Sync gcal Bash Script</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga49afc1" class="outline-2">
<h2 id="orga49afc1"><span class="section-number-2">1</span> Credits</h2>
<div class="outline-text-2" id="text-1">
<p>
Inspired by <a href="https://github.com/freetonik/emacs-dotfiles">freetonik</a>'s setup. Check out his podcast!
</p>
</div>
</div>
<div id="outline-container-org010d3d3" class="outline-2">
<h2 id="org010d3d3"><span class="section-number-2">2</span> Installing</h2>
<div class="outline-text-2" id="text-2">
<p>
This config works best with <a href="https://github.com/d12frosted/homebrew-emacs-plus">emacs-plus</a> (27.1)
</p>
<div class="org-src-container">
<pre class="src src-sh">brew tap d12frosted/emacs-plus
brew install emacs-plus
ln -s /usr/local/opt/emacs-plus/Emacs.app /Applications/Emacs.app
</pre>
</div>
</div>

<div id="outline-container-org5e1cfed" class="outline-3">
<h3 id="org5e1cfed"><span class="section-number-3">2.1</span> Dependencies</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-sh">brew install ispell
brew cask install mactex
</pre>
</div>
</div>
</div>

<div id="outline-container-orge070fd7" class="outline-3">
<h3 id="orge070fd7"><span class="section-number-3">2.2</span> Meta</h3>
<div class="outline-text-3" id="text-2-2">
<p>
When this configuration is loaded for the first time, the <code>init.el</code> is the file that is loaded. It looks like this:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">This file replaces itself with the actual configuration at first run.</span>

<span style="color: #546A90;">;; </span><span style="color: #546A90;">We can't tangle without org!</span>
(<span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">org</span>)
<span style="color: #546A90;">;; </span><span style="color: #546A90;">Open the configuration</span>
(find-file (concat user-emacs-directory <span style="color: #7984D1;">"init.org"</span>))
<span style="color: #546A90;">;; </span><span style="color: #546A90;">tangle it</span>
(org-babel-tangle)
<span style="color: #546A90;">;; </span><span style="color: #546A90;">load it</span>
(load-file (concat user-emacs-directory <span style="color: #7984D1;">"init.el"</span>))
<span style="color: #546A90;">;; </span><span style="color: #546A90;">finally byte-compile it</span>
(byte-compile-file (concat user-emacs-directory <span style="color: #7984D1;">"init.el"</span>))
</pre>
</div>
</div>
</div>
