init.org
** Headers
Lexical scoping for the init-file is needed, it can be specified in the header. This is the first line of the actual configuration:

#+BEGIN_SRC emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+END_SRC

Tangle and compile this file on save automatically:

#+BEGIN_SRC emacs-lisp
  (defun tangle-init ()
    "If the current buffer is 'init.org' the code-blocks are
  tangled, and the tangled file is compiled."
    (when (equal (buffer-file-name)
                 (expand-file-name (concat user-emacs-directory "init.org")))
      ;; Avoid running hooks when tangling.
      (let ((prog-mode-hook nil))
        (org-babel-tangle)
        (byte-compile-file (concat user-emacs-directory "init.el")))))

  (add-hook 'after-save-hook 'tangle-init)
#+END_SRC

This helps get rid of =functions might not be defined at runtime= warnings. See https://github.com/jwiegley/use-package/issues/590

#+BEGIN_SRC emacs-lisp
  (eval-when-compile
    (defvar use-package-expand-minimally byte-compile-current-file))
#+END_SRC

* Startup
** Garbage Collection
For faster startup times, according to [[https://github.com/hlissner/doom-emacs/blob/develop/docs/faq.org#how-does-doom-start-up-so-quickly][hlissner]],

#+begin_quote
The GC eats up quite a bit of time, easily doubling startup time. The trick is to turn up the memory threshold as early as possible.
#+end_quote

#+begin_src emacs-lisp
  (setq gc-cons-threshold most-positive-fixnum ; 2^61 bytes
        gc-cons-percentage 0.6)

  (defvar better-gc-cons-threshold 16777216 ; 16mb
    "The default value to use for `gc-cons-threshold'.
  If you experience freezing, decrease this. If you experience stuttering, increase this.")


  (add-hook 'emacs-startup-hook
    (lambda ()
      (setq gc-cons-threshold better-gc-cons-threshold
            gc-cons-percentage 0.1))) ; Default value for `gc-cons-percentage'
#+end_src

gc and minibuffer (also from doom)
#+begin_src emacs-lisp
  (defun pgw/defer-garbage-collection-h ()
    (setq gc-cons-threshold most-positive-fixnum))

  (defun pgw/restore-garbage-collection-h ()
    "Defer it so that commands launched immediately after will enjoy the benefits."
    (run-at-time
     1 nil (lambda () (setq gc-cons-threshold better-gc-cons-threshold))))

  (add-hook 'minibuffer-setup-hook #'pgw/defer-garbage-collection-h)
  (add-hook 'minibuffer-exit-hook #'pgw/restore-garbage-collection-h)
#+end_src

** Package Setup
Initialize package and add Melpa, GNU, and Org sources.
#+begin_src emacs-lisp
  (require 'package)
  (setq package-archives
      '(("melpa" . "https://melpa.org/packages/")
        ("gnu" . "https://elpa.gnu.org/packages/")
        ("org" . "https://orgmode.org/elpa/")
        ))
  (package-initialize)
#+end_src

** Use package
Add custom load path:

#+begin_src emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/custom_load/")
#+end_src

Install use-package.

#+BEGIN_SRC emacs-lisp
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (eval-when-compile (require 'use-package))

  (setq use-package-always-ensure t)
#+END_SRC

use-package.el no longer needed at runtime
#+begin_src emacs-lisp
  (eval-when-compile
    (require 'use-package))
  (require 'bind-key)                ;; if you use any :bind variant
#+end_src

No need for "Package cl deprecated" warning on startup.
#+begin_src emacs-lisp
  (setq byte-compile-warnings '(cl-functions))
  (require 'cl-lib)
  (eval-when-compile (require 'cl))
#+end_src

** OS Integration
#+begin_src emacs-lisp :tangle no
  (use-package exec-path-from-shell)

  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize))

  ;;; Change shell process (from bash to zsh)
  ;; (setq shell-file-name "/bin/zsh")
#+end_src
* Configurations

** Emacs Stuff
*** Startup Time Test

#+begin_src emacs-lisp
  (add-hook 'emacs-startup-hook
	    (lambda ()
	      (message "Emacs ready in %s with %d garbage collections."
		       (format "%.2f seconds"
			       (float-time
				(time-subtract after-init-time before-init-time)))
		       gcs-done)))
#+end_src

*** Custom Set Variables
Store custom-file separately, don't freek out when it's not found.
#+begin_src emacs-lisp
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (load custom-file 'noerror)
#+end_src

*** Confirm Kill Emacs
Make Emacs confirm when quitting:
#+begin_src emacs-lisp
  (setq confirm-kill-emacs 'yes-or-no-p)
#+end_src
** =tab-bar-mode=

#+begin_src emacs-lisp
  (tab-bar-mode 1)
#+end_src
*** Tab Switching Keybinds                                       :keybinds:
#+begin_src emacs-lisp
  (global-set-key (kbd "s-{") (lambda () (interactive) (tab-next -1)))
  (global-set-key (kbd "s-}") (lambda () (interactive) (tab-next 1)))
#+end_src


** Custom Functions
