init.html

<div id="outline-container-org601cc53" class="outline-3">
<h3 id="org601cc53"><span class="section-number-3">2.3</span> Headers</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Lexical scoping for the init-file is needed, it can be specified in the header. This is the first line of the actual configuration:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;;; </span><span style="color: #546A90;">-*- lexical-binding: t -*-</span>
</pre>
</div>

<p>
Tangle and compile this file on save automatically:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">tangle-init</span> ()
  <span style="color: #A875FF;">"If the current buffer is 'init.org' the code-blocks are</span>
<span style="color: #A875FF;">tangled, and the tangled file is compiled."</span>
  (<span style="color: #ff2afc; font-weight: bold;">when</span> (equal (buffer-file-name)
               (expand-file-name (concat user-emacs-directory <span style="color: #7984D1;">"init.org"</span>)))
    <span style="color: #546A90;">;; </span><span style="color: #546A90;">Avoid running hooks when tangling.</span>
    (<span style="color: #ff2afc; font-weight: bold;">let</span> ((prog-mode-hook nil))
      (org-babel-tangle)
      (byte-compile-file (concat user-emacs-directory <span style="color: #7984D1;">"init.el"</span>)))))

(add-hook 'after-save-hook 'tangle-init)
</pre>
</div>

<p>
This helps get rid of <code>functions might not be defined at runtime</code> warnings. See <a href="https://github.com/jwiegley/use-package/issues/590">https://github.com/jwiegley/use-package/issues/590</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">eval-when-compile</span>
  (<span style="color: #ff2afc; font-weight: bold;">defvar</span> <span style="color: #df85ff;">use-package-expand-minimally</span> byte-compile-current-file))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org26a3165" class="outline-2">
<h2 id="org26a3165"><span class="section-number-2">3</span> Startup</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgbba4451" class="outline-3">
<h3 id="orgbba4451"><span class="section-number-3">3.1</span> Garbage Collection</h3>
<div class="outline-text-3" id="text-3-1">
<p>
For faster startup times, according to <a href="https://github.com/hlissner/doom-emacs/blob/develop/docs/faq.org#how-does-doom-start-up-so-quickly">hlissner</a>,
</p>

<blockquote>
<p>
The GC eats up quite a bit of time, easily doubling startup time. The trick is to turn up the memory threshold as early as possible.
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> gc-cons-threshold most-positive-fixnum <span style="color: #546A90;">; </span><span style="color: #546A90;">2^61 bytes</span>
      gc-cons-percentage 0.6)

(<span style="color: #ff2afc; font-weight: bold;">defvar</span> <span style="color: #df85ff;">better-gc-cons-threshold</span> 16777216 <span style="color: #546A90;">; </span><span style="color: #546A90;">16mb</span>
  <span style="color: #A875FF;">"The default value to use for `</span><span style="color: #df85ff; font-weight: bold;">gc-cons-threshold</span><span style="color: #A875FF;">'.</span>
<span style="color: #A875FF;">If you experience freezing, decrease this. If you experience stuttering, increase this."</span>)


(add-hook 'emacs-startup-hook
  (<span style="color: #ff2afc; font-weight: bold;">lambda</span> ()
    (<span style="color: #ff2afc; font-weight: bold;">setq</span> gc-cons-threshold better-gc-cons-threshold
          gc-cons-percentage 0.1))) <span style="color: #546A90;">; </span><span style="color: #546A90;">Default value for `</span><span style="color: #df85ff; font-weight: bold;">gc-cons-percentage</span><span style="color: #546A90;">'</span>
</pre>
</div>

<p>
gc and minibuffer (also from doom)
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">pgw/defer-garbage-collection-h</span> ()
  (<span style="color: #ff2afc; font-weight: bold;">setq</span> gc-cons-threshold most-positive-fixnum))

(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">pgw/restore-garbage-collection-h</span> ()
  <span style="color: #A875FF;">"Defer it so that commands launched immediately after will enjoy the benefits."</span>
  (run-at-time
   1 nil (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (<span style="color: #ff2afc; font-weight: bold;">setq</span> gc-cons-threshold better-gc-cons-threshold))))

(add-hook 'minibuffer-setup-hook #'pgw/defer-garbage-collection-h)
(add-hook 'minibuffer-exit-hook #'pgw/restore-garbage-collection-h)
</pre>
</div>
</div>
</div>

<div id="outline-container-org67c25e8" class="outline-3">
<h3 id="org67c25e8"><span class="section-number-3">3.2</span> Package Setup</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Initialize package and add Melpa, GNU, and Org sources.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">package</span>)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> package-archives
    '((<span style="color: #7984D1;">"melpa"</span> . <span style="color: #7984D1;">"https://melpa.org/packages/"</span>)
      (<span style="color: #7984D1;">"gnu"</span> . <span style="color: #7984D1;">"https://elpa.gnu.org/packages/"</span>)
      (<span style="color: #7984D1;">"org"</span> . <span style="color: #7984D1;">"https://orgmode.org/elpa/"</span>)
      ))
(package-initialize)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6eff967" class="outline-3">
<h3 id="org6eff967"><span class="section-number-3">3.3</span> Use package</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Add custom load path:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'load-path <span style="color: #7984D1;">"~/.emacs.d/custom_load/"</span>)
</pre>
</div>

<p>
Install use-package.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">unless</span> (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(<span style="color: #ff2afc; font-weight: bold;">eval-when-compile</span> (<span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">use-package</span>))

(<span style="color: #ff2afc; font-weight: bold;">setq</span> use-package-always-ensure t)
</pre>
</div>

<p>
use-package.el no longer needed at runtime
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">eval-when-compile</span>
  (<span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">use-package</span>))
(<span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">bind-key</span>)                <span style="color: #546A90;">;; </span><span style="color: #546A90;">if you use any :bind variant</span>
</pre>
</div>

<p>
No need for "Package cl deprecated" warning on startup.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> byte-compile-warnings '(cl-functions))
(<span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">cl-lib</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org35379d3" class="outline-2">
<h2 id="org35379d3"><span class="section-number-2">4</span> Configurations</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org4045348" class="outline-3">
<h3 id="org4045348"><span class="section-number-3">4.1</span> Emacs Stuff</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orgaa21a50" class="outline-4">
<h4 id="orgaa21a50"><span class="section-number-4">4.1.1</span> Startup Time Test</h4>
<div class="outline-text-4" id="text-4-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'emacs-startup-hook
          (<span style="color: #ff2afc; font-weight: bold;">lambda</span> ()
            (message <span style="color: #7984D1;">"Emacs ready in %s with %d garbage collections."</span>
                     (format <span style="color: #7984D1;">"%.2f seconds"</span>
                             (float-time
                              (time-subtract after-init-time before-init-time)))
                     gcs-done)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc0dd1bd" class="outline-4">
<h4 id="orgc0dd1bd"><span class="section-number-4">4.1.2</span> Custom Set Variables</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
Store custom-file separately, don't freek out when it's not found.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> custom-file (expand-file-name <span style="color: #7984D1;">"custom.el"</span> user-emacs-directory))
(load custom-file 'noerror)
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e26efc" class="outline-4">
<h4 id="org5e26efc"><span class="section-number-4">4.1.3</span> Confirm Kill Emacs</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
Make Emacs confirm when quitting:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> confirm-kill-emacs 'yes-or-no-p)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgba170a7" class="outline-3">
<h3 id="orgba170a7"><span class="section-number-3">4.2</span> Custom Functions</h3>
<div class="outline-text-3" id="text-4-2">
</div>
