init.org
*** Test network (internet-up-p)
Test if network is up and running
#+begin_src emacs-lisp
  (defun internet-up-p (&optional host)
    (= 0 (call-process "ping" nil nil nil "-c" "1" "-W" "1"
                       (if host host "1.1.1.1"))))
#+end_src

*** Get org link                                                 :keybinds:
#+begin_src emacs-lisp
  (defun pgw/org-get-link-at-point ()
    "Get the link from an org heading"
    (interactive)
    (let* ((context (org-element-context))
           (link (if (eq (car context) 'link)
                     (org-element-property :path context)
                   nil)))
      (if link (kill-new (concat (org-element-property :type context) ":" link)))))

  (global-set-key (kbd "C-c s-l") 'pgw/org-get-link-at-point)
#+end_src

*** Make-shell

Make a shell instance with name
https://stackoverflow.com/questions/2540997/create-more-than-one-eshell-instance-in-emacs/2541530#2541530

#+begin_src emacs-lisp
  (defun make-shell (name)
    "Create a shell buffer named NAME."
    (interactive "sName: ")
    (setq name (concat "$" name))
    (eshell 4)
    (rename-buffer name))
#+end_src

** Modifier Keys
#+begin_src emacs-lisp
  (when (eq system-type 'darwin)
    (with-no-warnings
      (setq mac-option-modifier 'meta)
      (setq mac-control-modifier 'control)
      (setq ns-function-modifier 'hyper)))

  (when (eq system-type 'gnu/linux)
    (with-no-warnings (setq x-super-keysym 'hyper)))
#+end_src

** Visuals

#+begin_src emacs-lisp
  ;(load-theme 'tango-dark t)
  ;;; Frame
  (add-to-list 'default-frame-alist '(height . 46))
  (add-to-list 'default-frame-alist '(width . 146))

  ;;; Visual line mode (for text wrapping)
  (global-set-key (kbd "C-x v v") 'visual-line-mode)

  ;(global-visual-line-mode t)
  (global-linum-mode 0)
  (global-display-line-numbers-mode 1)
  (setq-default display-line-numbers 'visual)
  (setq display-line-numbers-type 'visual)
  (set-default 'truncate-lines t)

  ;; (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
  (add-to-list 'default-frame-alist '(ns-appearance . dark)) ;; assuming you are using a dark theme
  ;; (setq ns-use-proxy-icon nil)
  ;; (setq frame-title-format nil)
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)

  (setq visual-line-fringe-indicators '(left-curly-arrow hollow-square)) ;; '(left-curly-arrow right-curly-arrow) for both left and right
  ;; Testing freetonik's fringe indicator alist
  (setq-default fringe-indicator-alist '((truncation left-arrow right-arrow)
   (continuation nil right-arrow)
   (overlay-arrow . right-triangle)
   (up . up-arrow)
   (down . down-arrow)
   (top top-left-angle top-right-angle)
   (bottom bottom-left-angle bottom-right-angle top-right-angle top-left-angle)
   (top-bottom left-bracket right-bracket top-right-angle top-left-angle)
   (empty-line . empty-line)
   (unknown . question-mark)))

#+end_src

*** All the Icons
#+begin_src emacs-lisp
  (use-package all-the-icons)
#+end_src

*** Doom Theme
Favorite themes:

1. outrun-electric
2. challenger-deep
3. molokai
4. solarized-dark

Light themes:
- solarized-light
- doom-acario-light

#+begin_src emacs-lisp
  (use-package doom-themes
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled

    ;; Load the theme (doom-one, doom-molokai, etc); keep in mind that each theme
    ;; may have their own settings.
    (load-theme 'doom-outrun-electric t)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)

    ;; Enable custom neotree theme (all-the-icons must be installed!)
    ;; (doom-themes-neotree-config)
    ;; or for treemacs users
    (setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
    (doom-themes-treemacs-config)

    ;; Doom themes fontifies #hashtags and @at-tags by default.
    ;; To disable this:
    (setq doom-org-special-tags nil)

    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config)
    )
#+end_src

