init.html

<div id="outline-container-orgb592889" class="outline-4">
<h4 id="orgb592889"><span class="section-number-4">4.2.10</span> Test network (internet-up-p)</h4>
<div class="outline-text-4" id="text-4-2-10">
<p>
Test if network is up and running
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">internet-up-p</span> (<span style="color: #ffd400;">&amp;optional</span> host)
  (= 0 (call-process <span style="color: #7984D1;">"ping"</span> nil nil nil <span style="color: #7984D1;">"-c"</span> <span style="color: #7984D1;">"1"</span> <span style="color: #7984D1;">"-W"</span> <span style="color: #7984D1;">"1"</span>
                     (<span style="color: #ff2afc; font-weight: bold;">if</span> host host <span style="color: #7984D1;">"1.1.1.1"</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf4ce004" class="outline-4">
<h4 id="orgf4ce004"><span class="section-number-4">4.2.11</span> Get org link&#xa0;&#xa0;&#xa0;<span class="tag"><span class="keybinds">keybinds</span></span></h4>
<div class="outline-text-4" id="text-4-2-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">pgw/org-get-link-at-point</span> ()
  <span style="color: #A875FF;">"Get the link from an org heading"</span>
  (<span style="color: #ff2afc; font-weight: bold;">interactive</span>)
  (<span style="color: #ff2afc; font-weight: bold;">let*</span> ((context (org-element-context))
         (link (<span style="color: #ff2afc; font-weight: bold;">if</span> (eq (car context) 'link)
                   (org-element-property <span style="color: #1ea8fc;">:path</span> context)
                 nil)))
    (<span style="color: #ff2afc; font-weight: bold;">if</span> link (kill-new (concat (org-element-property <span style="color: #1ea8fc;">:type</span> context) <span style="color: #7984D1;">":"</span> link)))))

(global-set-key (kbd <span style="color: #7984D1;">"C-c s-l"</span>) 'pgw/org-get-link-at-point)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcdcf3c0" class="outline-4">
<h4 id="orgcdcf3c0"><span class="section-number-4">4.2.12</span> Make-shell</h4>
<div class="outline-text-4" id="text-4-2-12">
<p>
Make a shell instance with name
<a href="https://stackoverflow.com/questions/2540997/create-more-than-one-eshell-instance-in-emacs/2541530#2541530">https://stackoverflow.com/questions/2540997/create-more-than-one-eshell-instance-in-emacs/2541530#2541530</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">make-shell</span> (name)
  <span style="color: #A875FF;">"Create a shell buffer named NAME."</span>
  (<span style="color: #ff2afc; font-weight: bold;">interactive</span> <span style="color: #7984D1;">"sName: "</span>)
  (<span style="color: #ff2afc; font-weight: bold;">setq</span> name (concat <span style="color: #7984D1;">"$"</span> name))
  (eshell 4)
  (rename-buffer name))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3d17f4d" class="outline-3">
<h3 id="org3d17f4d"><span class="section-number-3">4.3</span> Modifier Keys</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">when</span> (eq system-type 'darwin)
  (with-no-warnings
    (<span style="color: #ff2afc; font-weight: bold;">setq</span> mac-option-modifier 'meta)
    (<span style="color: #ff2afc; font-weight: bold;">setq</span> mac-control-modifier 'control)
    (<span style="color: #ff2afc; font-weight: bold;">setq</span> ns-function-modifier 'hyper)))

(<span style="color: #ff2afc; font-weight: bold;">when</span> (eq system-type 'gnu/linux)
  (with-no-warnings (<span style="color: #ff2afc; font-weight: bold;">setq</span> x-super-keysym 'hyper)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org697ff9c" class="outline-3">
<h3 id="org697ff9c"><span class="section-number-3">4.4</span> OS Integration</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">exec-path-from-shell</span>)

(<span style="color: #ff2afc; font-weight: bold;">when</span> (memq window-system '(mac ns x))
  (exec-path-from-shell-initialize))

<span style="color: #546A90;">;;; </span><span style="color: #546A90;">Change shell process (from bash to zsh)</span>
(<span style="color: #ff2afc; font-weight: bold;">setq</span> shell-file-name <span style="color: #7984D1;">"/bin/zsh"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org80c3e14" class="outline-3">
<h3 id="org80c3e14"><span class="section-number-3">4.5</span> Visuals</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;</span><span style="color: #546A90;">(load-theme 'tango-dark t)</span>
<span style="color: #546A90;">;;; </span><span style="color: #546A90;">Frame</span>
(add-to-list 'default-frame-alist '(height . 46))
(add-to-list 'default-frame-alist '(width . 146))

<span style="color: #546A90;">;;; </span><span style="color: #546A90;">Visual line mode (for text wrapping)</span>
(global-set-key (kbd <span style="color: #7984D1;">"C-x v v"</span>) 'visual-line-mode)

<span style="color: #546A90;">;</span><span style="color: #546A90;">(global-visual-line-mode t)</span>
(global-linum-mode 0)
(global-display-line-numbers-mode 1)
(<span style="color: #ff2afc; font-weight: bold;">setq-default</span> display-line-numbers 'visual)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> display-line-numbers-type 'visual)
(set-default 'truncate-lines t)

<span style="color: #546A90;">;; </span><span style="color: #546A90;">(add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))</span>
(add-to-list 'default-frame-alist '(ns-appearance . dark)) <span style="color: #546A90;">;; </span><span style="color: #546A90;">assuming you are using a dark theme</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">(setq ns-use-proxy-icon nil)</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">(setq frame-title-format nil)</span>
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)

(<span style="color: #ff2afc; font-weight: bold;">setq</span> visual-line-fringe-indicators '(left-curly-arrow hollow-square)) <span style="color: #546A90;">;; </span><span style="color: #546A90;">'(left-curly-arrow right-curly-arrow) for both left and right</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">Testing freetonik's fringe indicator alist</span>
(<span style="color: #ff2afc; font-weight: bold;">setq-default</span> fringe-indicator-alist '((truncation left-arrow right-arrow)
 (continuation nil right-arrow)
 (overlay-arrow . right-triangle)
 (up . up-arrow)
 (down . down-arrow)
 (top top-left-angle top-right-angle)
 (bottom bottom-left-angle bottom-right-angle top-right-angle top-left-angle)
 (top-bottom left-bracket right-bracket top-right-angle top-left-angle)
 (empty-line . empty-line)
 (unknown . question-mark)))

</pre>
</div>
</div>

<div id="outline-container-org95f69ba" class="outline-4">
<h4 id="org95f69ba"><span class="section-number-4">4.5.1</span> All the Icons</h4>
<div class="outline-text-4" id="text-4-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">all-the-icons</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf7447bd" class="outline-4">
<h4 id="orgf7447bd"><span class="section-number-4">4.5.2</span> Doom Theme</h4>
<div class="outline-text-4" id="text-4-5-2">
<p>
Favorite themes:
</p>

<ol class="org-ol">
<li>outrun-electric</li>
<li>challenger-deep</li>
<li>molokai</li>
<li>solarized-dark</li>
</ol>

<p>
Light themes:
</p>
<ul class="org-ul">
<li>solarized-light</li>
<li>doom-acario-light</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">doom-themes</span>
  <span style="color: #1ea8fc;">:config</span>
  <span style="color: #546A90;">;; </span><span style="color: #546A90;">Global settings (defaults)</span>
  (<span style="color: #ff2afc; font-weight: bold;">setq</span> doom-themes-enable-bold t    <span style="color: #546A90;">; </span><span style="color: #546A90;">if nil, bold is universally disabled</span>
      doom-themes-enable-italic t) <span style="color: #546A90;">; </span><span style="color: #546A90;">if nil, italics is universally disabled</span>

  <span style="color: #546A90;">;; </span><span style="color: #546A90;">Load the theme (doom-one, doom-molokai, etc); keep in mind that each theme</span>
  <span style="color: #546A90;">;; </span><span style="color: #546A90;">may have their own settings.</span>
  (load-theme 'doom-outrun-electric t)

  <span style="color: #546A90;">;; </span><span style="color: #546A90;">Enable flashing mode-line on errors</span>
  (doom-themes-visual-bell-config)

  <span style="color: #546A90;">;; </span><span style="color: #546A90;">Enable custom neotree theme (all-the-icons must be installed!)</span>
  <span style="color: #546A90;">;; </span><span style="color: #546A90;">(doom-themes-neotree-config)</span>
  <span style="color: #546A90;">;; </span><span style="color: #546A90;">or for treemacs users</span>
  (<span style="color: #ff2afc; font-weight: bold;">setq</span> doom-themes-treemacs-theme <span style="color: #7984D1;">"doom-colors"</span>) <span style="color: #546A90;">; </span><span style="color: #546A90;">use the colorful treemacs theme</span>
  (doom-themes-treemacs-config)

  <span style="color: #546A90;">;; </span><span style="color: #546A90;">Doom themes fontifies #hashtags and @at-tags by default.</span>
  <span style="color: #546A90;">;; </span><span style="color: #546A90;">To disable this:</span>
  (<span style="color: #ff2afc; font-weight: bold;">setq</span> doom-org-special-tags nil)

  <span style="color: #546A90;">;; </span><span style="color: #546A90;">Corrects (and improves) org-mode's native fontification.</span>
  (doom-themes-org-config)
  )
</pre>
</div>
</div>

<ol class="org-ol">
