init.org
**** Set Orgmode Agenda Stuff
#+begin_src emacs-lisp :tangle no
  ;; this must be used after loading the theme with (load-theme THEME-NAME t)
  (custom-set-faces
   `(org-time-grid ((t (:foreground ,(doom-blend 'yellow 'fg 0.6)))))
   `(org-time-grid ((t (:foreground ,(doom-blend 'yellow 'fg 0.6)))))
   `(org-habit-ready-face ((t (:foreground ,(doom-blend 'blue 'fg 0.1)))))
   `(org-habit-alert-face ((t (:foreground ,(doom-blend 'yellow 'fg 0.1)))))
   `(org-habit-overdue-face ((t (:foreground ,(doom-blend 'red 'fg 0.1)))))
   )
#+end_src

*** DISABLED Light Theme
CLOSED: [2020-11-29 Sun 11:28]

#+begin_src emacs-lisp :tangle no
  (load-theme 'modus-operandi)
#+end_src

*** Frame Resize Pixelwise
Make Emacs play nice with my window manager and resizing around other windows.
#+begin_src emacs-lisp
  (setq frame-resize-pixelwise t)
#+end_src

** Windows and Frames
*** Movement Between Windows
Windows and Frames are different than one would now intuitively think. Windows exist inside subdivided frames which we call windows now. The following code makes windows and frames easier to navigate:

#+begin_src emacs-lisp
  (when (fboundp 'windmove-default-keybindings)
    (global-set-key (kbd "H-h") (ignore-error-wrapper 'windmove-left))
    (global-set-key (kbd "H-l") (ignore-error-wrapper 'windmove-right))
    (global-set-key (kbd "H-k") (ignore-error-wrapper 'windmove-up))
    (global-set-key (kbd "H-j") (ignore-error-wrapper 'windmove-down))
    )

  ;; Disabled, Doesn't really work for me - going to use s-left and s-right instead
  ;; (use-package framemove
  ;;   :load-path "custom_load"
  ;;   :config
  ;;   (require 'framemove)
  ;;   (global-set-key (kbd "C-e-<down>")  'fm-down-frame)
  ;;   (global-set-key (kbd "C-s-<up>")    'fm-up-frame)
  ;;   (global-set-key (kbd "C-s-<left>")  'fm-left-frame)
  ;;   (global-set-key (kbd "C-s-<right>") 'fm-right-frame)
  ;;   (setq framemove-hook-into-windmove t)
  ;;   )
#+end_src

*** Window Management
#+begin_src emacs-lisp
  (use-package rotate)
#+end_src

** Treemacs
#+begin_src emacs-lisp
  (use-package treemacs)
  (use-package treemacs-evil)
  (use-package treemacs-magit)
#+end_src

** ztree (Tool for diffing and merging directories)
#+begin_src emacs-lisp
  (use-package ztree)
#+end_src

** Fonts
*** DISABLED Chinese Font with English Font             :ARCHIVE:
CLOSED: [2020-11-29 Sun 11:28]
Special Fonts config for ease of zooming chinese and english fonts at same rate.

#+begin_src emacs-lisp :tangle no
  (when (display-graphic-p)
    (if (eq system-type 'darwin)
        (set-face-attribute 'default nil :font "Menlo"))

    (defvar emacs-english-font "Menlo" "The font name for English.")
    (defvar emacs-cjk-font "WenQuanYi Micro Hei Mono" "The font name for CJK.")
    (find-font (font-spec :name "WenQuanYi Micro Hei Mono"))
    (font-family-list)
    (if (eq system-type 'windows-nt)
       (setq emacs-cjk-font "WenQuanYi Micro Hey Mono"
              emacs-english-font "Menlo")
      (setq emacs-cjk-font "WenQuanYi Micro Hei Mono"))

    (defvar emacs-font-size-pair '(12 . 14) ; Old '(12 . 14)
      "Default font size pair for (english . chinese)")

    (defvar emacs-font-size-pair-list
      '((5 .  6) (9 . 10) (10 . 12) (12 . 14)
        (13 . 16) (15 . 18) (17 . 20) (19 . 22)
        (20 . 24) (21 . 26) (24 . 28) (26 . 32)
        (28 . 34) (30 . 36) (34 . 40) (36 . 44))
      "This list is used to store matching (english . chinese) font-size.")

    (defun font-exist-p (fontname)
      "Test if this font is exist or not."
      (if (or (not fontname) (string= fontname ""))
          nil
        (if (not (x-list-fonts fontname)) nil t)))

    (defun set-font (english chinese size-pair)
      "Setup emacs English and Chinese font on x window-system."

      (if (font-exist-p english)
          (set-frame-font (format "%s:pixelsize=%d" english (car size-pair)) t))

      (if (font-exist-p chinese)
          (dolist (charset '(kana han symbol cjk-misc bopomofo))
            (set-fontset-font (frame-parameter nil 'font) charset
                              (font-spec :family chinese :size (cdr size-pair))))))
    ;; Setup font size based on emacs-font-size-pair
    (set-font emacs-english-font emacs-cjk-font emacs-font-size-pair)

    (defun emacs-step-font-size (step)
      "Increase/Decrease emacs's font size."
      (let ((scale-steps emacs-font-size-pair-list))
        (if (< step 0) (setq scale-steps (reverse scale-steps)))
        (setq emacs-font-size-pair
              (or (cadr (member emacs-font-size-pair scale-steps))
                  emacs-font-size-pair))
        (when emacs-font-size-pair
          (message "emacs font size set to %.1f" (car emacs-font-size-pair))
          (set-font emacs-english-font emacs-cjk-font emacs-font-size-pair))))

          (defun increase-emacs-font-size ()
      "Decrease emacs's font-size acording emacs-font-size-pair-list."
      (interactive) (emacs-step-font-size 1))

    (defun decrease-emacs-font-size ()
      "Increase emacs's font-size acording emacs-font-size-pair-list."
      (interactive) (emacs-step-font-size -1))

    (global-set-key (kbd "C-=") 'increase-emacs-font-size)
    (global-set-key (kbd "C--") 'decrease-emacs-font-size)
    )

  (set-face-attribute 'default nil :font emacs-english-font :height 120)
  (dolist (charset '(kana han symbol cjk-misc bopomofo))
      (set-face-attribute charset (font-spec :family emacs-cjk-font :size (cdr emacs-font-size-pair))))

  (set-font emacs-english-font emacs-cjk-font emacs-font-size-pair)
#+end_src

