init.html
<li><a id="orgc2054f4"></a>Set Orgmode Agenda Stuff<br />
<div class="outline-text-5" id="text-4-5-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">this must be used after loading the theme with (load-theme THEME-NAME t)</span>
(custom-set-faces
 `(org-time-grid ((t (<span style="color: #1ea8fc;">:foreground</span> ,(doom-blend 'yellow 'fg 0.6)))))
 `(org-time-grid ((t (<span style="color: #1ea8fc;">:foreground</span> ,(doom-blend 'yellow 'fg 0.6)))))
 `(org-habit-ready-face ((t (<span style="color: #1ea8fc;">:foreground</span> ,(doom-blend 'blue 'fg 0.1)))))
 `(org-habit-alert-face ((t (<span style="color: #1ea8fc;">:foreground</span> ,(doom-blend 'yellow 'fg 0.1)))))
 `(org-habit-overdue-face ((t (<span style="color: #1ea8fc;">:foreground</span> ,(doom-blend 'red 'fg 0.1)))))
 )
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orge4d91e0" class="outline-4">
<h4 id="orge4d91e0"><span class="section-number-4">4.5.3</span> <span class="done DISABLED">DISABLED</span> Light Theme</h4>
<div class="outline-text-4" id="text-4-5-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(load-theme 'modus-operandi)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcb0c9db" class="outline-4">
<h4 id="orgcb0c9db"><span class="section-number-4">4.5.4</span> Frame Resize Pixelwise</h4>
<div class="outline-text-4" id="text-4-5-4">
<p>
Make Emacs play nice with my window manager and resizing around other windows.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> frame-resize-pixelwise t)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0ece99e" class="outline-3">
<h3 id="org0ece99e"><span class="section-number-3">4.6</span> Windows and Frames</h3>
<div class="outline-text-3" id="text-4-6">
</div>
<div id="outline-container-orgfc52e1c" class="outline-4">
<h4 id="orgfc52e1c"><span class="section-number-4">4.6.1</span> Movement Between Windows</h4>
<div class="outline-text-4" id="text-4-6-1">
<p>
Windows and Frames are different than one would now intuitively think. Windows exist inside subdivided frames which we call windows now. The following code makes windows and frames easier to navigate:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">when</span> (fboundp 'windmove-default-keybindings)
  (global-set-key (kbd <span style="color: #7984D1;">"H-h"</span>) (ignore-error-wrapper 'windmove-left))
  (global-set-key (kbd <span style="color: #7984D1;">"H-l"</span>) (ignore-error-wrapper 'windmove-right))
  (global-set-key (kbd <span style="color: #7984D1;">"H-k"</span>) (ignore-error-wrapper 'windmove-up))
  (global-set-key (kbd <span style="color: #7984D1;">"H-j"</span>) (ignore-error-wrapper 'windmove-down))
  )

<span style="color: #546A90;">;; </span><span style="color: #546A90;">Disabled, Doesn't really work for me - going to use s-left and s-right instead</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">(use-package framemove</span>
<span style="color: #546A90;">;;   </span><span style="color: #546A90;">:load-path "custom_load"</span>
<span style="color: #546A90;">;;   </span><span style="color: #546A90;">:config</span>
<span style="color: #546A90;">;;   </span><span style="color: #546A90;">(require 'framemove)</span>
<span style="color: #546A90;">;;   </span><span style="color: #546A90;">(global-set-key (kbd "C-e-&lt;down&gt;")  'fm-down-frame)</span>
<span style="color: #546A90;">;;   </span><span style="color: #546A90;">(global-set-key (kbd "C-s-&lt;up&gt;")    'fm-up-frame)</span>
<span style="color: #546A90;">;;   </span><span style="color: #546A90;">(global-set-key (kbd "C-s-&lt;left&gt;")  'fm-left-frame)</span>
<span style="color: #546A90;">;;   </span><span style="color: #546A90;">(global-set-key (kbd "C-s-&lt;right&gt;") 'fm-right-frame)</span>
<span style="color: #546A90;">;;   </span><span style="color: #546A90;">(setq framemove-hook-into-windmove t)</span>
<span style="color: #546A90;">;;   </span><span style="color: #546A90;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8caa96d" class="outline-4">
<h4 id="org8caa96d"><span class="section-number-4">4.6.2</span> Window Management</h4>
<div class="outline-text-4" id="text-4-6-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">rotate</span>
  <span style="color: #1ea8fc;">:load-path</span> <span style="color: #7984D1;">"site-lisp/emacs-rotate"</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8285897" class="outline-3">
<h3 id="org8285897"><span class="section-number-3">4.7</span> Treemacs</h3>
<div class="outline-text-3" id="text-4-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">treemacs</span>)
(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">treemacs-evil</span>)
(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">treemacs-magit</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgea93ddd" class="outline-3">
<h3 id="orgea93ddd"><span class="section-number-3">4.8</span> ztree (Tool for diffing and merging directories)</h3>
<div class="outline-text-3" id="text-4-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">ztree</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8f9cb1a" class="outline-3">
<h3 id="org8f9cb1a"><span class="section-number-3">4.9</span> Fonts</h3>
<div class="outline-text-3" id="text-4-9">
</div>
<div id="outline-container-orgc6cdf8b" class="outline-4">
<h4 id="orgc6cdf8b"><span class="section-number-4">4.9.1</span> <span class="done DISABLED">DISABLED</span> Chinese Font with English Font&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ARCHIVE">ARCHIVE</span></span></h4>
</div>
