init.org
*** Set default font and configure font resizing

Credit to Harry R. Schwartz [[https://github.com/hrs/dotfiles/blob/master/emacs/.emacs.d/configuration.org#set-default-font-and-configure-font-resizing][github]]

The standard =text-scale-= functions just resize the text in the current buffer; I’d generally like to resize the text in every buffer, and I usually want to change the size of the modeline, too (this is especially helpful when presenting). These functions and bindings let me resize everything all together!

Note that this overrides the default font-related keybindings from sensible-defaults.

#+begin_src emacs-lisp
  (cond ((memq system-type '(gnu/linux gnu))
         (setq pgw/default-font "Monoid"))
        ((memq system-type '(darwin))
         (setq pgw/default-font "Menlo")))
  (setq pgw/default-font-size 12)
  (setq pgw/current-font-size pgw/default-font-size)

  (setq pgw/font-change-increment 1.1)

  (defun pgw/font-code ()
    "Return a string representing the current font (like \"Inconsolata-14\")."
    (concat pgw/default-font "-" (number-to-string pgw/current-font-size)))

  (defun pgw/set-font-size ()
    "Set the font to `pgw/default-font' at `pgw/current-font-size'.
  Set that for the current frame, and also make it the default for
  other, future frames."
    (interactive)
    (let ((font-code (pgw/font-code)))
      (if (assoc 'font default-frame-alist)
          (setcdr (assoc 'font default-frame-alist) font-code)
        (add-to-list 'default-frame-alist (cons 'font font-code)))
      (set-frame-font font-code)))

  (defun pgw/reset-font-size ()
    "Change font size back to `pgw/default-font-size'."
    (interactive)
    (setq pgw/current-font-size pgw/default-font-size)
    (pgw/set-font-size))

  (defun pgw/increase-font-size ()
    "Increase current font size by a factor of `pgw/font-change-increment'."
    (interactive)
    (setq pgw/current-font-size
          (ceiling (* pgw/current-font-size pgw/font-change-increment)))
    (pgw/set-font-size))

  (defun pgw/decrease-font-size ()
    "Decrease current font size by a factor of `pgw/font-change-increment', down to a minimum size of 1."
    (interactive)
    (setq pgw/current-font-size
          (max 1
               (floor (/ pgw/current-font-size pgw/font-change-increment))))
    (pgw/set-font-size))

  (define-key global-map (kbd "C-)") 'pgw/reset-font-size)
  (define-key global-map (kbd "C-H-0") 'pgw/set-font-size)
  (define-key global-map (kbd "C-+") 'pgw/increase-font-size)
  (define-key global-map (kbd "C-=") 'pgw/increase-font-size)
  (define-key global-map (kbd "C-_") 'pgw/decrease-font-size)
  (define-key global-map (kbd "C--") 'pgw/decrease-font-size)

  (add-hook 'emacs-startup-hook
            (lambda () (interactive) (pgw/reset-font-size)))
#+end_src

*** Variable Pitch Default Font
#+begin_src emacs-lisp
  (set-face-attribute 'variable-pitch nil :family "Avenir Next")
#+end_src

*** Mixed Pitch
Mixed pitch package for mixing variable and monospace fonts where appropriate (replacing buffer-face-mode).

I copied mixed-pitch.el from [[https://gitlab.com/jabranham/mixed-pitch/][this]] repository because of [[https://gitlab.com/jabranham/mixed-pitch/issues/6][this]] issue. I will hopefully be changing it back at some point (or coming up with a better fix because the fonts don't seem to work great together) but for now this will be the fix.

#+begin_src emacs-lisp
  (use-package mixed-pitch
    :load-path "custom_load"
    :config
    ;; (set-face-attribute 'variable-pitch :height 160)
    (dolist (face '(line-number line-number-current-line org-list-dt org-link)) (add-to-list 'mixed-pitch-fixed-pitch-faces face))
    ;; (add-hook 'text-mode-hook 'mixed-pitch-mode)
    (global-set-key (kbd "C-x v f") 'mixed-pitch-mode)
    )
#+end_src

** GPG

#+begin_src emacs-lisp
  ;; (require 'epa-file)
  (epa-file-enable)
  (setf epa-pinentry-mode 'loopback)
#+end_src

** Passwords
#+begin_src emacs-lisp
  (load-file "~/.passwords.el")
#+end_src

** Mode Line

Still figuring this out, just switched to powerline!

*** DISABLED Smart Mode Line
CLOSED: [2020-11-29 Sun 11:30]
#+begin_src emacs-lisp :tangle no
  (use-package smart-mode-line
    :config
    (setq rm-blacklist '(" hl-p" " WK" " yas" " Undo-Tree" " hs")
          ;; sml/theme 'light
          sml/name-width 30
          )
    (add-to-list 'sml/replacer-regexp-list '("^~/Google Drive/OHS/\\([0-9]\\{2\\}\\)th Grade/Classes/Semester [0-9]/\\([0-9A-Z]*\\)/" ":\\2:"))
    (add-hook 'after-init-hook 'sml/setup)
    )
#+end_src

*** Powerline

#+begin_src emacs-lisp
  (use-package powerline
    :ensure t
    :config (powerline-default-theme))
#+end_src

*** Other Configuration
#+begin_src emacs-lisp
  (size-indication-mode 1)
  (line-number-mode -1)
#+end_src

