init.html

<div id="outline-container-org152b6c9" class="outline-4">
<h4 id="org152b6c9"><span class="section-number-4">4.9.2</span> Set default font and configure font resizing</h4>
<div class="outline-text-4" id="text-4-9-2">
<p>
Credit to Harry R. Schwartz <a href="https://github.com/hrs/dotfiles/blob/master/emacs/.emacs.d/configuration.org#set-default-font-and-configure-font-resizing">github</a>
</p>

<p>
The standard <code>text-scale-</code> functions just resize the text in the current buffer; Id generally like to resize the text in every buffer, and I usually want to change the size of the modeline, too (this is especially helpful when presenting). These functions and bindings let me resize everything all together!
</p>

<p>
Note that this overrides the default font-related keybindings from sensible-defaults.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> pgw/default-font <span style="color: #7984D1;">"Menlo"</span>)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> pgw/default-font-size 12)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> pgw/current-font-size pgw/default-font-size)

(<span style="color: #ff2afc; font-weight: bold;">setq</span> pgw/font-change-increment 1.1)

(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">pgw/font-code</span> ()
  <span style="color: #A875FF;">"Return a string representing the current font (like \"Inconsolata-14\")."</span>
  (concat pgw/default-font <span style="color: #7984D1;">"-"</span> (number-to-string pgw/current-font-size)))

(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">pgw/set-font-size</span> ()
  <span style="color: #A875FF;">"Set the font to `</span><span style="color: #df85ff; font-weight: bold;">pgw/default-font</span><span style="color: #A875FF;">' at `</span><span style="color: #df85ff; font-weight: bold;">pgw/current-font-size</span><span style="color: #A875FF;">'.</span>
<span style="color: #A875FF;">Set that for the current frame, and also make it the default for</span>
<span style="color: #A875FF;">other, future frames."</span>
  (<span style="color: #ff2afc; font-weight: bold;">interactive</span>)
  (<span style="color: #ff2afc; font-weight: bold;">let</span> ((font-code (pgw/font-code)))
    (<span style="color: #ff2afc; font-weight: bold;">if</span> (assoc 'font default-frame-alist)
        (setcdr (assoc 'font default-frame-alist) font-code)
      (add-to-list 'default-frame-alist (cons 'font font-code)))
    (set-frame-font font-code)))

(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">pgw/reset-font-size</span> ()
  <span style="color: #A875FF;">"Change font size back to `</span><span style="color: #df85ff; font-weight: bold;">pgw/default-font-size</span><span style="color: #A875FF;">'."</span>
  (<span style="color: #ff2afc; font-weight: bold;">interactive</span>)
  (<span style="color: #ff2afc; font-weight: bold;">setq</span> pgw/current-font-size pgw/default-font-size)
  (pgw/set-font-size))

(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">pgw/increase-font-size</span> ()
  <span style="color: #A875FF;">"Increase current font size by a factor of `</span><span style="color: #df85ff; font-weight: bold;">pgw/font-change-increment</span><span style="color: #A875FF;">'."</span>
  (<span style="color: #ff2afc; font-weight: bold;">interactive</span>)
  (<span style="color: #ff2afc; font-weight: bold;">setq</span> pgw/current-font-size
        (ceiling (* pgw/current-font-size pgw/font-change-increment)))
  (pgw/set-font-size))

(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">pgw/decrease-font-size</span> ()
  <span style="color: #A875FF;">"Decrease current font size by a factor of `</span><span style="color: #df85ff; font-weight: bold;">pgw/font-change-increment</span><span style="color: #A875FF;">', down to a minimum size of 1."</span>
  (<span style="color: #ff2afc; font-weight: bold;">interactive</span>)
  (<span style="color: #ff2afc; font-weight: bold;">setq</span> pgw/current-font-size
        (max 1
             (floor (/ pgw/current-font-size pgw/font-change-increment))))
  (pgw/set-font-size))

(define-key global-map (kbd <span style="color: #7984D1;">"C-)"</span>) 'pgw/reset-font-size)
(define-key global-map (kbd <span style="color: #7984D1;">"C-H-0"</span>) 'pgw/set-font-size)
(define-key global-map (kbd <span style="color: #7984D1;">"C-+"</span>) 'pgw/increase-font-size)
(define-key global-map (kbd <span style="color: #7984D1;">"C-="</span>) 'pgw/increase-font-size)
(define-key global-map (kbd <span style="color: #7984D1;">"C-_"</span>) 'pgw/decrease-font-size)
(define-key global-map (kbd <span style="color: #7984D1;">"C--"</span>) 'pgw/decrease-font-size)

(add-hook 'emacs-startup-hook
          (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (<span style="color: #ff2afc; font-weight: bold;">interactive</span>) (pgw/reset-font-size)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org136b05e" class="outline-4">
<h4 id="org136b05e"><span class="section-number-4">4.9.3</span> Variable Pitch Default Font</h4>
<div class="outline-text-4" id="text-4-9-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(set-face-attribute 'variable-pitch nil <span style="color: #1ea8fc;">:family</span> <span style="color: #7984D1;">"Avenir Next"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge994f7e" class="outline-4">
<h4 id="orge994f7e"><span class="section-number-4">4.9.4</span> Mixed Pitch</h4>
<div class="outline-text-4" id="text-4-9-4">
<p>
Mixed pitch package for mixing variable and monospace fonts where appropriate (replacing buffer-face-mode).
</p>

<p>
I copied mixed-pitch.el from <a href="https://gitlab.com/jabranham/mixed-pitch/">this</a> repository because of <a href="https://gitlab.com/jabranham/mixed-pitch/issues/6">this</a> issue. I will hopefully be changing it back at some point (or coming up with a better fix because the fonts don't seem to work great together) but for now this will be the fix.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">mixed-pitch</span>
  <span style="color: #1ea8fc;">:load-path</span> <span style="color: #7984D1;">"custom_load"</span>
  <span style="color: #1ea8fc;">:config</span>
  <span style="color: #546A90;">;; </span><span style="color: #546A90;">(set-face-attribute 'variable-pitch :height 160)</span>
  (<span style="color: #ff2afc; font-weight: bold;">dolist</span> (face '(line-number line-number-current-line org-list-dt org-link)) (add-to-list 'mixed-pitch-fixed-pitch-faces face))
  <span style="color: #546A90;">;; </span><span style="color: #546A90;">(add-hook 'text-mode-hook 'mixed-pitch-mode)</span>
  (global-set-key (kbd <span style="color: #7984D1;">"C-x v f"</span>) 'mixed-pitch-mode)
  )
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5c4f7dc" class="outline-3">
<h3 id="org5c4f7dc"><span class="section-number-3">4.10</span> GPG</h3>
<div class="outline-text-3" id="text-4-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">(require 'epa-file)</span>
(epa-file-enable)
(<span style="color: #ff2afc; font-weight: bold;">setf</span> epa-pinentry-mode 'loopback)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfbfc9e6" class="outline-3">
<h3 id="orgfbfc9e6"><span class="section-number-3">4.11</span> Passwords</h3>
<div class="outline-text-3" id="text-4-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(load-file <span style="color: #7984D1;">"~/.passwords.el"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8a287ec" class="outline-3">
<h3 id="org8a287ec"><span class="section-number-3">4.12</span> Mode Line</h3>
<div class="outline-text-3" id="text-4-12">
<p>
Still figuring this out, just switched to powerline!
</p>
</div>

<div id="outline-container-orge01f0a4" class="outline-4">
<h4 id="orge01f0a4"><span class="section-number-4">4.12.1</span> <span class="done DISABLED">DISABLED</span> Smart Mode Line</h4>
<div class="outline-text-4" id="text-4-12-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">smart-mode-line</span>
  <span style="color: #1ea8fc;">:config</span>
  (<span style="color: #ff2afc; font-weight: bold;">setq</span> rm-blacklist '(<span style="color: #7984D1;">" hl-p"</span> <span style="color: #7984D1;">" WK"</span> <span style="color: #7984D1;">" yas"</span> <span style="color: #7984D1;">" Undo-Tree"</span> <span style="color: #7984D1;">" hs"</span>)
        <span style="color: #546A90;">;; </span><span style="color: #546A90;">sml/theme 'light</span>
        sml/name-width 30
        )
  (add-to-list 'sml/replacer-regexp-list '(<span style="color: #7984D1;">"^~/Google Drive/OHS/</span><span style="color: #ff2afc; font-weight: bold;">\\</span><span style="color: #ff2afc; font-weight: bold;">(</span><span style="color: #7984D1;">[0-9]\\{2\\}</span><span style="color: #ff2afc; font-weight: bold;">\\</span><span style="color: #ff2afc; font-weight: bold;">)</span><span style="color: #7984D1;">th Grade/Classes/Semester [0-9]/</span><span style="color: #ff2afc; font-weight: bold;">\\</span><span style="color: #ff2afc; font-weight: bold;">(</span><span style="color: #7984D1;">[0-9A-Z]*</span><span style="color: #ff2afc; font-weight: bold;">\\</span><span style="color: #ff2afc; font-weight: bold;">)</span><span style="color: #7984D1;">/"</span> <span style="color: #7984D1;">":\\2:"</span>))
  (add-hook 'after-init-hook 'sml/setup)
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-org3c2a223" class="outline-4">
<h4 id="org3c2a223"><span class="section-number-4">4.12.2</span> Powerline</h4>
<div class="outline-text-4" id="text-4-12-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">powerline</span>
  <span style="color: #1ea8fc;">:ensure</span> t
  <span style="color: #1ea8fc;">:config</span> (powerline-default-theme))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga02edcb" class="outline-4">
<h4 id="orga02edcb"><span class="section-number-4">4.12.3</span> Other Configuration</h4>
<div class="outline-text-4" id="text-4-12-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(size-indication-mode 1)
(line-number-mode -1)
</pre>
</div>
</div>
</div>
