init.html

<div id="outline-container-orgf950949" class="outline-4">
<h4 id="orgf950949"><span class="section-number-4">4.12.4</span> <span class="done DISABLED">DISABLED</span> Time display</h4>
<div class="outline-text-4" id="text-4-12-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> display-time-format <span style="color: #7984D1;">"%a %m/%d %H:%M"</span>)
(display-time-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb8baa44" class="outline-4">
<h4 id="orgb8baa44"><span class="section-number-4">4.12.5</span> <span class="done DISABLED">DISABLED</span> Battery display</h4>
<div class="outline-text-4" id="text-4-12-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> battery-mode-line-format <span style="color: #7984D1;">" [%b%p%%]"</span>)
(display-battery-mode)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3d23e85" class="outline-3">
<h3 id="org3d23e85"><span class="section-number-3">4.13</span> Narrowing Frameworks</h3>
<div class="outline-text-3" id="text-4-13">
</div>
<div id="outline-container-org7a65331" class="outline-4">
<h4 id="org7a65331"><span class="section-number-4">4.13.1</span> <span class="done DISABLED">DISABLED</span> Helm</h4>
<div class="outline-text-4" id="text-4-13-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">helm</span>
  <span style="color: #1ea8fc;">:config</span>
  (<span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">helm-config</span>)
  (helm-mode 1)
  (define-key global-map [remap find-file] 'helm-find-files)
  (define-key global-map [remap occur] 'helm-occur)
  (define-key global-map [remap list-buffers] 'helm-buffers-list)
  (define-key global-map [remap dabbrev-expand] 'helm-dabbrev)
  (define-key global-map [remap execute-extended-command] 'helm-M-x)
  (<span style="color: #ff2afc; font-weight: bold;">unless</span> (boundp 'completion-in-region-function)
    (define-key lisp-interaction-mode-map [remap completion-at-point] 'helm-lisp-completion-at-point)
    (define-key emacs-lisp-mode-map       [remap completion-at-point] 'helm-lisp-completion-at-point))
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-orge0bf378" class="outline-4">
<h4 id="orge0bf378"><span class="section-number-4">4.13.2</span> Ivy</h4>
<div class="outline-text-4" id="text-4-13-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">ivy</span>
  <span style="color: #1ea8fc;">:config</span>
  (ivy-mode 1)
  (<span style="color: #ff2afc; font-weight: bold;">setq</span> ivy-use-virtual-buffers t)
  (<span style="color: #ff2afc; font-weight: bold;">setq</span> enable-recursive-minibuffers t)
  <span style="color: #546A90;">;; </span><span style="color: #546A90;">enable this if you want `</span><span style="color: #df85ff; font-weight: bold;">swiper</span><span style="color: #546A90;">' to use it</span>
  <span style="color: #546A90;">;; </span><span style="color: #546A90;">(setq search-default-mode #'char-fold-to-regexp)</span>
  (global-set-key <span style="color: #7984D1;">"\C-s"</span> 'swiper)
  (global-set-key (kbd <span style="color: #7984D1;">"C-c C-r"</span>) 'ivy-resume)
  (global-set-key (kbd <span style="color: #7984D1;">"&lt;f6&gt;"</span>) 'ivy-resume)
  (global-set-key (kbd <span style="color: #7984D1;">"M-x"</span>) 'counsel-M-x)
  (global-set-key (kbd <span style="color: #7984D1;">"C-x C-f"</span>) 'counsel-find-file)
  (global-set-key (kbd <span style="color: #7984D1;">"&lt;f1&gt; f"</span>) 'counsel-describe-function)
  (global-set-key (kbd <span style="color: #7984D1;">"&lt;f1&gt; v"</span>) 'counsel-describe-variable)
  (global-set-key (kbd <span style="color: #7984D1;">"&lt;f1&gt; o"</span>) 'counsel-describe-symbol)
  (global-set-key (kbd <span style="color: #7984D1;">"&lt;f1&gt; l"</span>) 'counsel-find-library)
  (global-set-key (kbd <span style="color: #7984D1;">"&lt;f2&gt; i"</span>) 'counsel-info-lookup-symbol)
  (global-set-key (kbd <span style="color: #7984D1;">"&lt;f2&gt; u"</span>) 'counsel-unicode-char)
  (global-set-key (kbd <span style="color: #7984D1;">"C-c g"</span>) 'counsel-git)
  (global-set-key (kbd <span style="color: #7984D1;">"C-c j"</span>) 'counsel-git-grep)
  (global-set-key (kbd <span style="color: #7984D1;">"C-c k"</span>) 'counsel-ag)
  (global-set-key (kbd <span style="color: #7984D1;">"C-x l"</span>) 'counsel-locate)
  (global-set-key (kbd <span style="color: #7984D1;">"C-S-o"</span>) 'counsel-rhythmbox)
  (define-key minibuffer-local-map (kbd <span style="color: #7984D1;">"C-r"</span>) 'counsel-minibuffer-history))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org00a4fc0" class="outline-3">
<h3 id="org00a4fc0"><span class="section-number-3">4.14</span> Diary</h3>
<div class="outline-text-3" id="text-4-14">
</div>
<div id="outline-container-org3841d2c" class="outline-4">
<h4 id="org3841d2c"><span class="section-number-4">4.14.1</span> Diary file</h4>
<div class="outline-text-4" id="text-4-14-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;</span><span style="color: #546A90;">(setq org-agenda-include-diary t)</span>
(<span style="color: #ff2afc; font-weight: bold;">setq</span> diary-file <span style="color: #7984D1;">"~/Dropbox/org/diary"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org0b0b469" class="outline-4">
<h4 id="org0b0b469"><span class="section-number-4">4.14.2</span> Appointments Setup</h4>
<div class="outline-text-4" id="text-4-14-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(appt-activate -1)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> appt-message-warning-time 15)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> diary-comment-start <span style="color: #7984D1;">"##"</span>)

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga52a2ac" class="outline-3">
<h3 id="orga52a2ac"><span class="section-number-3">4.15</span> Org-mode</h3>
<div class="outline-text-3" id="text-4-15">
</div>
<div id="outline-container-org655c10f" class="outline-4">
<h4 id="org655c10f"><span class="section-number-4">4.15.1</span> Setting orgmode directories:</h4>
<div class="outline-text-4" id="text-4-15-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-directory <span style="color: #7984D1;">"~/Dropbox/org"</span>)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-default-notes-file (concat org-directory <span style="color: #7984D1;">"/inbox.org"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge8d4607" class="outline-4">
<h4 id="orge8d4607"><span class="section-number-4">4.15.2</span> Startup Settings</h4>
<div class="outline-text-4" id="text-4-15-2">
<p>
Make org-mode files automatically indent.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-startup-indented t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcf5996b" class="outline-4">
<h4 id="orgcf5996b"><span class="section-number-4">4.15.3</span> Todo keywords</h4>
<div class="outline-text-4" id="text-4-15-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-todo-keywords
      '((sequence <span style="color: #7984D1;">"NEXT(n)"</span> <span style="color: #7984D1;">"TODO(t)"</span> <span style="color: #7984D1;">"IN-PROGRESS(i)"</span> <span style="color: #7984D1;">"WAITING(w)"</span> <span style="color: #7984D1;">"|"</span> <span style="color: #7984D1;">"DONE(d)"</span> <span style="color: #7984D1;">"CANCELLED(c)"</span> <span style="color: #7984D1;">"DELEGATED(g)"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org410252a" class="outline-4">
<h4 id="org410252a"><span class="section-number-4">4.15.4</span> Keybinds</h4>
<div class="outline-text-4" id="text-4-15-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(define-key global-map <span style="color: #7984D1;">"\C-cc"</span> 'org-capture)
  (global-set-key (kbd <span style="color: #7984D1;">"H-c o"</span>) 
                  (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (<span style="color: #ff2afc; font-weight: bold;">interactive</span>) (find-file (concat org-directory <span style="color: #7984D1;">"/school.org"</span>))))
  (global-set-key (kbd <span style="color: #7984D1;">"H-c p"</span>) 
                  (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (<span style="color: #ff2afc; font-weight: bold;">interactive</span>) (dired <span style="color: #7984D1;">"~/Google Drive/OHS/11th Grade/Semester 2/"</span>)))
  (global-set-key (kbd <span style="color: #7984D1;">"H-c i"</span>) 
                  (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (<span style="color: #ff2afc; font-weight: bold;">interactive</span>) (find-file (concat org-directory <span style="color: #7984D1;">"/projects.org"</span>))))
  (global-set-key (kbd <span style="color: #7984D1;">"H-c v"</span>) 
                  (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (<span style="color: #ff2afc; font-weight: bold;">interactive</span>) (find-file (concat org-directory <span style="color: #7984D1;">"/violin.org"</span>))))
  (global-set-key (kbd <span style="color: #7984D1;">"H-c n"</span>) 
                  (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (<span style="color: #ff2afc; font-weight: bold;">interactive</span>) (find-file (concat org-directory <span style="color: #7984D1;">"/notes.org"</span>))))
  (global-set-key (kbd <span style="color: #7984D1;">"H-c m"</span>) 
                  (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (<span style="color: #ff2afc; font-weight: bold;">interactive</span>) (find-file (concat org-directory <span style="color: #7984D1;">"/music.org"</span>))))
  (global-set-key (kbd <span style="color: #7984D1;">"H-c k"</span>) 
                  (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (<span style="color: #ff2afc; font-weight: bold;">interactive</span>) (find-file (concat org-directory <span style="color: #7984D1;">"/links.org"</span>))))

  <span style="color: #546A90;">;;; </span><span style="color: #546A90;">Agenda key (C-c a) and other settings</span>
  (global-set-key <span style="color: #7984D1;">"\C-cl"</span> 'org-store-link)
  (global-set-key <span style="color: #7984D1;">"\C-ca"</span> 'org-agenda)
  (global-set-key <span style="color: #7984D1;">"\C-cc"</span> 'org-capture)
  (global-set-key <span style="color: #7984D1;">"\C-cb"</span> 'org-switchb)

  (<span style="color: #ff2afc; font-weight: bold;">evil-define-key</span> 'normal org-mode-map <span style="color: #7984D1;">"&lt;&lt;"</span> 'org-promote-subtree)
  (<span style="color: #ff2afc; font-weight: bold;">evil-define-key</span> 'normal org-mode-map <span style="color: #7984D1;">"&gt;&gt;"</span> 'org-demote-subtree)
</pre>
</div>
</div>
</div>
