init.org
*** Tags
#+begin_src emacs-lisp
  (setq org-tag-persistent-alist '(("email" . ?e)
                                   ("noexport" . ?N)))
#+end_src

*** Log when tasks are marked as done:
#+begin_src emacs-lisp
  (setq org-log-done 'time) ; Log when task marked as done
#+end_src

*** Org Refile:
#+begin_src emacs-lisp
  (setq pgw/refile-targets (file-expand-wildcards "~/Dropbox/org/*.org"))
  (setq org-refile-targets '((nil :maxlevel . 9)
                             (org-agenda-files :maxlevel . 9)
                             (pgw/refile-targets :maxlevel . 9)))
  (setq org-refile-use-outline-path 'file)
  (setq org-outline-path-complete-in-steps nil)
  (setq org-refile-allow-creating-parent-nodes 'confirm)
#+end_src

*** Agenda

#+begin_src emacs-lisp
  ;; org-agenda-auto-exclude-function
  (defun pgw/org-my-auto-exclude-function (tag)
    (if
        (string= tag "officehours")
        (concat "-" tag)))
  (setq org-agenda-auto-exclude-function 'pgw/org-my-auto-exclude-function)

  ;(setq org-agenda-overriding-columns-format "%28ITEM %TODO %SCHEDULED %DEADLINE %TAGS")

  ;; Re-align tags when window shape changes
  (add-hook 'org-agenda-mode-hook
            (lambda () (add-hook 'window-configuration-change-hook 'org-agenda-align-tags nil t)))

  ;(add-hook 'org-agenda-finalize-hook
  ;	  'org-agenda-align-tags)

  (setq org-deadline-warning-days 7)

  (add-hook 'org-agenda-finalize-hook
            (lambda ()
              (display-line-numbers-mode -1)
              ))

  ;; Org entries
  (setq org-agenda-max-entries nil)
#+end_src

**** DISABLED Hydra for Filtering                                :ARCHIVE:
CLOSED: [2020-11-29 Sun 11:31]
A hydra to quickly use different filter presets.
Presents:
- School-related items
- Class
- Violin

#+begin_src emacs-lisp :tangle no
   (defhydra pgw/org-agenda-filter-presets ()
     "A hydra to make filter presets for the org-agenda"
     ("S" (progn (org-agenda-filter-remove-all) (org-agenda-filter-apply '("+OHS") 'tag)) "OHS")
     ("o" (progn (org-agenda-filter-remove-all) (org-agenda-filter-apply '("-OHS") 'tag)) "Everything but OHS")
     ("n" (org-agenda-filter-remove-all) "Remove all")
     ("q" nil "exit" :exit t)
     )

   (define-key org-agenda-mode-map (kbd "H-/") 'pgw/org-agenda-filter-presets/body)
#+end_src

**** Custom Commands
Custom commands, testing sorting strategy variable

#+begin_src emacs-lisp
  (setq org-agenda-custom-commands
        '(("o" . "OHS")
          ("of" . "OHS Friend Schedules")
          ("ofa" "Audrey's Schedule" agenda ""
           ((org-agenda-span 7)
            (org-agenda-files
             (file-expand-wildcards "~/Dropbox/org/notes/OHS/202021/audrey_classes.org"))))
          ("ofj" "Josie's Schedule" agenda ""
           ((org-agenda-span 7)
            (org-agenda-files
             (file-expand-wildcards "~/Dropbox/org/notes/OHS/202021/josie_classes.org"))))
          ("ofA" "Ariana Schedule" agenda ""
           ((org-agenda-span 7)
            (org-agenda-files
             (file-expand-wildcards "~/Dropbox/org/notes/OHS/202021/ariana_classes.org"))))
          ("l" "Logging View" agenda ""
           ((org-agenda-span 1)
            (org-agenda-files
             (file-expand-wildcards "~/Dropbox/org/*.org"))))
          ("A" "General Agenda" agenda ""
           ((org-agenda-span 1)
            (org-agenda-sorting-strategy
             '((agenda habit-down time-up deadline-up)))))
          ("D" "College Deadlines" tags-todo "+collegeapps")
          ("Q" . "Custom queries")
          ("Qa" "Query all (Archive included)" search ""
           ((org-agenda-files (append (file-expand-wildcards (concat org-directory "/*.org"))
                                      (file-expand-wildcards (concat org-directory "/*.org_archive"))))))
          ("Ql" "Query Links" search ""
           ((org-agenda-files (list (concat org-directory "/links.org")
                                    (concat org-directory "/links.org_archive")))))))
#+end_src

**** Files
#+begin_src emacs-lisp
  (setq org-agenda-files (append (file-expand-wildcards "~/Dropbox/org/*.org")
                                 (file-expand-wildcards "~/Dropbox/org/calendars/*.org")
                                 (file-expand-wildcards "~/Dropbox/org-roam/*.org")
                                 (file-expand-wildcards "~/Dropbox/org-roam/*.org.gpg")))

  ;; (define-key org-agenda-mode-map (kbd "s-r") 'pgw/org-agenda-reload-files)
  (defun pgw/org-agenda-reload-files ()
    (interactive)
    (setq org-agenda-files (append (file-expand-wildcards "~/Dropbox/org/*.org")
                                 (file-expand-wildcards "~/Dropbox/org/calendars/*.org")
                                 (file-expand-wildcards "~/Dropbox/org-roam/*.org")
                                 (file-expand-wildcards "~/Dropbox/org-roam/*.org.gpg"))))
#+end_src

**** Time Grid Variable

#+begin_src emacs-lisp
  (setq org-agenda-time-grid '((daily today require-timed)
                               (600 800 1000 1200 1400 1600 1800 2000 2200)
                               "......" "----------------"))
#+end_src

