init.html

<div id="outline-container-orgefa447a" class="outline-4">
<h4 id="orgefa447a"><span class="section-number-4">4.15.5</span> Tags</h4>
<div class="outline-text-4" id="text-4-15-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-tag-persistent-alist '((<span style="color: #7984D1;">"email"</span> . ?e)
                                 (<span style="color: #7984D1;">"noexport"</span> . ?N)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf22e2d7" class="outline-4">
<h4 id="orgf22e2d7"><span class="section-number-4">4.15.6</span> Log when tasks are marked as done:</h4>
<div class="outline-text-4" id="text-4-15-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-log-done 'time) <span style="color: #546A90;">; </span><span style="color: #546A90;">Log when task marked as done</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5814b77" class="outline-4">
<h4 id="org5814b77"><span class="section-number-4">4.15.7</span> Org Refile:</h4>
<div class="outline-text-4" id="text-4-15-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> pgw/refile-targets (file-expand-wildcards <span style="color: #7984D1;">"~/Dropbox/org/*.org"</span>))
(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-refile-targets '((nil <span style="color: #1ea8fc;">:maxlevel</span> . 9)
                           (org-agenda-files <span style="color: #1ea8fc;">:maxlevel</span> . 9)
                           (pgw/refile-targets <span style="color: #1ea8fc;">:maxlevel</span> . 9)))
(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-refile-use-outline-path 'file)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-outline-path-complete-in-steps nil)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-refile-allow-creating-parent-nodes 'confirm)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb071083" class="outline-4">
<h4 id="orgb071083"><span class="section-number-4">4.15.8</span> Agenda</h4>
<div class="outline-text-4" id="text-4-15-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">org-agenda-auto-exclude-function</span>
(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">pgw/org-my-auto-exclude-function</span> (tag)
  (<span style="color: #ff2afc; font-weight: bold;">if</span>
      (string= tag <span style="color: #7984D1;">"officehours"</span>)
      (concat <span style="color: #7984D1;">"-"</span> tag)))
(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-agenda-auto-exclude-function 'pgw/org-my-auto-exclude-function)

<span style="color: #546A90;">;</span><span style="color: #546A90;">(setq org-agenda-overriding-columns-format "%28ITEM %TODO %SCHEDULED %DEADLINE %TAGS")</span>

<span style="color: #546A90;">;; </span><span style="color: #546A90;">Re-align tags when window shape changes</span>
(add-hook 'org-agenda-mode-hook
          (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (add-hook 'window-configuration-change-hook 'org-agenda-align-tags nil t)))

<span style="color: #546A90;">;</span><span style="color: #546A90;">(add-hook 'org-agenda-finalize-hook</span>
<span style="color: #546A90;">;</span><span style="color: #546A90;">         'org-agenda-align-tags)</span>

(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-deadline-warning-days 7)

(add-hook 'org-agenda-finalize-hook
          (<span style="color: #ff2afc; font-weight: bold;">lambda</span> ()
            (display-line-numbers-mode -1)
            ))

<span style="color: #546A90;">;; </span><span style="color: #546A90;">Org entries</span>
(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-agenda-max-entries nil)
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org016ee90"></a><span class="done DISABLED">DISABLED</span> Hydra for Filtering&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ARCHIVE">ARCHIVE</span></span><br /></li>

<li><a id="org2568bf6"></a>Custom Commands<br />
<div class="outline-text-5" id="text-4-15-8-2">
<p>
Custom commands, testing sorting strategy variable
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-agenda-custom-commands
      '((<span style="color: #7984D1;">"o"</span> . <span style="color: #7984D1;">"OHS"</span>)
        (<span style="color: #7984D1;">"of"</span> . <span style="color: #7984D1;">"OHS Friend Schedules"</span>)
        (<span style="color: #7984D1;">"ofa"</span> <span style="color: #7984D1;">"Audrey's Schedule"</span> agenda <span style="color: #7984D1;">""</span>
         ((org-agenda-span 7)
          (org-agenda-files
           (file-expand-wildcards <span style="color: #7984D1;">"~/Dropbox/org/notes/OHS/202021/audrey_classes.org"</span>))))
        (<span style="color: #7984D1;">"ofj"</span> <span style="color: #7984D1;">"Josie's Schedule"</span> agenda <span style="color: #7984D1;">""</span>
         ((org-agenda-span 7)
          (org-agenda-files
           (file-expand-wildcards <span style="color: #7984D1;">"~/Dropbox/org/notes/OHS/202021/josie_classes.org"</span>))))
        (<span style="color: #7984D1;">"ofA"</span> <span style="color: #7984D1;">"Ariana Schedule"</span> agenda <span style="color: #7984D1;">""</span>
         ((org-agenda-span 7)
          (org-agenda-files
           (file-expand-wildcards <span style="color: #7984D1;">"~/Dropbox/org/notes/OHS/202021/ariana_classes.org"</span>))))
        (<span style="color: #7984D1;">"l"</span> <span style="color: #7984D1;">"Logging View"</span> agenda <span style="color: #7984D1;">""</span>
         ((org-agenda-span 1)
          (org-agenda-files
           (file-expand-wildcards <span style="color: #7984D1;">"~/Dropbox/org/*.org"</span>))))
        (<span style="color: #7984D1;">"A"</span> <span style="color: #7984D1;">"General Agenda"</span> agenda <span style="color: #7984D1;">""</span>
         ((org-agenda-span 1)
          (org-agenda-sorting-strategy
           '((agenda habit-down time-up deadline-up)))))
        (<span style="color: #7984D1;">"D"</span> <span style="color: #7984D1;">"College Deadlines"</span> tags-todo <span style="color: #7984D1;">"+collegeapps"</span>)
        (<span style="color: #7984D1;">"Q"</span> . <span style="color: #7984D1;">"Custom queries"</span>)
        (<span style="color: #7984D1;">"Qa"</span> <span style="color: #7984D1;">"Query all (Archive included)"</span> search <span style="color: #7984D1;">""</span>
         ((org-agenda-files (append (file-expand-wildcards (concat org-directory <span style="color: #7984D1;">"/*.org"</span>))
                                    (file-expand-wildcards (concat org-directory <span style="color: #7984D1;">"/*.org_archive"</span>))))))
        (<span style="color: #7984D1;">"Ql"</span> <span style="color: #7984D1;">"Query Links"</span> search <span style="color: #7984D1;">""</span>
         ((org-agenda-files (list (concat org-directory <span style="color: #7984D1;">"/links.org"</span>)
                                  (concat org-directory <span style="color: #7984D1;">"/links.org_archive"</span>)))))))
</pre>
</div>
</div>
</li>

<li><a id="org44b1c67"></a>Files<br />
<div class="outline-text-5" id="text-4-15-8-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-agenda-files (append (file-expand-wildcards <span style="color: #7984D1;">"~/Dropbox/org/*.org"</span>)
                               (file-expand-wildcards <span style="color: #7984D1;">"~/Dropbox/org/calendars/*.org"</span>)))
</pre>
</div>
</div>
</li>

<li><a id="orgb263b5b"></a>Time Grid Variable<br />
<div class="outline-text-5" id="text-4-15-8-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-agenda-time-grid '((daily today require-timed)
                             (600 800 1000 1200 1400 1600 1800 2000 2200)
                             <span style="color: #7984D1;">"......"</span> <span style="color: #7984D1;">"----------------"</span>))
</pre>
</div>
</div>
</li>
</ol>
</div>
