init.org
*** DISABLED org-super-agenda
CLOSED: [2019-10-08 Tue 19:00]
Testing out org-super-agenda. Code kept here in case I want to experiemnt in the future. However, for now, I've decided that tags and filtering is the best option for me.
#+begin_src emacs-lisp :tangle no
  (use-package org-super-agenda
    :config
    (org-super-agenda-mode)
    )
  (setq org-agenda-custom-commands
        '(("z" "Super zaen view"
           ((agenda "" ((org-agenda-span 'day)
                        (org-super-agenda-groups
                         '((:name "Text"
                                  :time-grid t
                                  :date today
                                  :todo "TODO"
                                  :scheduled today
                                  :deadline today
                                  :order 1)
                           (:name "School Stuff"
                                  :tag "OHS"
                                  :order 2)
                           ))))
            (alltodo "" ((org-agenda-overriding-header "")
                         (org-super-agenda-groups
                          '((:name "Due Today"
                                   :deadline today
                                   :order 2)
                            (:name "OHS"
                                   :tag "OHS"
                                   :order 10)
                            (:name "Due Soon"
                                   :deadline future
                                   :order 8)
                            (:name "Overdue"
                                   :deadline past
                                   :order 9)
                            (:name "Issues"
                                   :tag "Issue"
                                   :order 12)
                            (:name "Emacs"
                                   :tag "Emacs"
                                   :order 13)
                            (:name "Waiting"
                                   :todo "WAITING"
                                   :order 20)
                            (:name "trivial"
                                   :priority<= "C"
                                   :tag "someday"
                                   :order 90)
                            (:discard (:habit t)
                                      )))))))
          )
        )
#+end_src

