init.html

<div id="outline-container-org43508bc" class="outline-4">
<h4 id="org43508bc"><span class="section-number-4">4.15.9</span> <span class="done DISABLED">DISABLED</span> org-super-agenda</h4>
<div class="outline-text-4" id="text-4-15-9">
<p>
Testing out org-super-agenda. Code kept here in case I want to experiemnt in the future. However, for now, I've decided that tags and filtering is the best option for me.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">org-super-agenda</span>
  <span style="color: #1ea8fc;">:config</span>
  (org-super-agenda-mode)
  )
(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-agenda-custom-commands
      '((<span style="color: #7984D1;">"z"</span> <span style="color: #7984D1;">"Super zaen view"</span>
         ((agenda <span style="color: #7984D1;">""</span> ((org-agenda-span 'day)
                      (org-super-agenda-groups
                       '((<span style="color: #1ea8fc;">:name</span> <span style="color: #7984D1;">"Text"</span>
                                <span style="color: #1ea8fc;">:time-grid</span> t
                                <span style="color: #1ea8fc;">:date</span> today
                                <span style="color: #1ea8fc;">:todo</span> <span style="color: #7984D1;">"TODO"</span>
                                <span style="color: #1ea8fc;">:scheduled</span> today
                                <span style="color: #1ea8fc;">:deadline</span> today
                                <span style="color: #1ea8fc;">:order</span> 1)
                         (<span style="color: #1ea8fc;">:name</span> <span style="color: #7984D1;">"School Stuff"</span>
                                <span style="color: #1ea8fc;">:tag</span> <span style="color: #7984D1;">"OHS"</span>
                                <span style="color: #1ea8fc;">:order</span> 2)
                         ))))
          (alltodo <span style="color: #7984D1;">""</span> ((org-agenda-overriding-header <span style="color: #7984D1;">""</span>)
                       (org-super-agenda-groups
                        '((<span style="color: #1ea8fc;">:name</span> <span style="color: #7984D1;">"Due Today"</span>
                                 <span style="color: #1ea8fc;">:deadline</span> today
                                 <span style="color: #1ea8fc;">:order</span> 2)
                          (<span style="color: #1ea8fc;">:name</span> <span style="color: #7984D1;">"OHS"</span>
                                 <span style="color: #1ea8fc;">:tag</span> <span style="color: #7984D1;">"OHS"</span>
                                 <span style="color: #1ea8fc;">:order</span> 10)
                          (<span style="color: #1ea8fc;">:name</span> <span style="color: #7984D1;">"Due Soon"</span>
                                 <span style="color: #1ea8fc;">:deadline</span> future
                                 <span style="color: #1ea8fc;">:order</span> 8)
                          (<span style="color: #1ea8fc;">:name</span> <span style="color: #7984D1;">"Overdue"</span>
                                 <span style="color: #1ea8fc;">:deadline</span> past
                                 <span style="color: #1ea8fc;">:order</span> 9)
                          (<span style="color: #1ea8fc;">:name</span> <span style="color: #7984D1;">"Issues"</span>
                                 <span style="color: #1ea8fc;">:tag</span> <span style="color: #7984D1;">"Issue"</span>
                                 <span style="color: #1ea8fc;">:order</span> 12)
                          (<span style="color: #1ea8fc;">:name</span> <span style="color: #7984D1;">"Emacs"</span>
                                 <span style="color: #1ea8fc;">:tag</span> <span style="color: #7984D1;">"Emacs"</span>
                                 <span style="color: #1ea8fc;">:order</span> 13)
                          (<span style="color: #1ea8fc;">:name</span> <span style="color: #7984D1;">"Waiting"</span>
                                 <span style="color: #1ea8fc;">:todo</span> <span style="color: #7984D1;">"WAITING"</span>
                                 <span style="color: #1ea8fc;">:order</span> 20)
                          (<span style="color: #1ea8fc;">:name</span> <span style="color: #7984D1;">"trivial"</span>
                                 <span style="color: #1ea8fc;">:priority&lt;=</span> <span style="color: #7984D1;">"C"</span>
                                 <span style="color: #1ea8fc;">:tag</span> <span style="color: #7984D1;">"someday"</span>
                                 <span style="color: #1ea8fc;">:order</span> 90)
                          (<span style="color: #1ea8fc;">:discard</span> (<span style="color: #1ea8fc;">:habit</span> t)
                                    )))))))
        )
      )
</pre>
</div>
</div>
</div>
