init.org
*** Quick Capture

#+begin_src emacs-lisp
  (defun pgw/year-month ()
    "Custom function to return date in format: YYYY-MM"
    (format-time-string "%Y-%m"))

  (defun pgw/U ()
    "Custom function to return date in org inactive timestamp format"
    (format-time-string "[%Y-%m-%d %a]"))

  (defun pgw/add-12 ()
    "Custom function return active org timestamp with exactly 24 hour difference"
    (format-time-string "%Y-%m-%d %a %H:%M" (time-add (current-time) 85500)))

  (defun pgw/headline_date ()
    "Function to find the date as headline for Violin capture template"
    (goto-char (point-min))
    (let ((searchresults (search-forward (format-time-string "[%Y-%m-%d %a]") nil t)))
      (if searchresults
          'searchresults
        (error "Not found! Use Vc to create today's practice first.")
        )
      )
    )

  (setq org-capture-templates
        '(
  ("i" "Inbox")
  ("ii" "Inbox Entry" entry (file "~/Dropbox/org/inbox.org")
  "* NEXT %?
  ")
  ("il" "Inbox w/ Link" entry (file "~/Dropbox/org/inbox.org")
  "* NEXT %?
  %a
  ")
  ("in" "Quick Note" entry (file "~/Dropbox/org/inbox.org")
  "* %?
  %U")
  ("e" "Events")
  ("ef" "Emacs Event (Not synced)" entry (file "~/Dropbox/org/events.org")
   "* %?")
  ("ee" "Emacs Calendar (Limbo)" entry (file "~/Dropbox/org/events.org")
   "* %^{Title of event}
  SCHEDULED: %^{Scheduled time + duration}T
  :PROPERTIES:
  :calendar-id: ihfv2u5n9uf5ksj5484vbe7mj4@group.calendar.google.com
  :END:
  :org-gcal:%?
  :END:" :jump-to-captured t)
  ("ep" "Gmail Calendar (Limbo)" entry (file "~/Dropbox/org/events.org")
   "* %^{Title of event}
  SCHEDULED: %^{Scheduled time + duration}T
  :PROPERTIES:
  :calendar-id: pierce.g.wang@gmail.com
  :END:
  :org-gcal:%?
  :END:" :jump-to-captured t)
  ("es" "SFCM Calendar (Limbo)" entry (file "~/Dropbox/org/sfcm.org")
   "* %^{Title of event}
  SCHEDULED: %^{Scheduled time + duration}T
  :PROPERTIES:
  :calendar-id: taiu2dsr8o29c09m7nn1n21t9o@group.calendar.google.com
  :END:
  :org-gcal:%?
  :END:" :jump-to-captured t)
  ("L" "Link" entry (file+headline "~/Dropbox/org/links.org" "!Inbox")
  "* [[%?%:link][%:description]]
  :PROPERTIES:
  :CREATED:  %U
  :END:" :prepend t)
  ("g" "Manual" entry (file "~/Dropbox/org/notes.org")
  "* %?
  :PROPERTIES:
  :CREATED:  %U
  :END:" :empty-lines 1)
  ("b" "Book" entry (file+headline "~/Dropbox/org/notes.org" "Books")
   "* %^{RATING}p%^{Book Title}")
  ("j" "Journal" entry
  (file+olp+datetree "~/Dropbox/org/orgjournal.org.gpg")
  "* %?
  :PROPERTIES:
  :LOGGED: %^{Logged Time}U
  :END:
  " :kill-buffer t)
  ("m" "Mail")
  ("mt" "Mail task" entry
   (file "~/Dropbox/org/inbox.org")
   "* NEXT %? :email:
  :PROPERTIES:
  :EMAIL: %a
  :SENDER: %:from
  :END:\n")
  ("mn" "Mail note" entry
   (file "~/Dropbox/org/inbox.org")
   "* %? :email:
  :PROPERTIES:
  :EMAIL: %a
  :SENDER: %:from
  :END:\n")
  ("S" "School")
  ("St" "School Tasks")
  ("Stj" "OCS15 - T/Th" entry
   (file+headline "~/Dropbox/org/school.org" "_OCS15_")
   "* NEXT %?
  DEADLINE: %^{Deadline}T\n")
  ("Stm" "UM51A - T/Th" entry
   (file+headline "~/Dropbox/org/school.org" "_UM51A_")
   "**** NEXT %?
  DEADLINE: %^{Deadline}T\n")
  ("Sts" "OPS10 - M/W" entry
   (file+headline "~/Dropbox/org/school.org" "_OPS10_")
   "* NEXT %?
  DEADLINE: %^{Deadline}T\n")
  ("Stp" "OP051 - M/W" entry
   (file+headline "~/Dropbox/org/school.org" "_OP051_")
   "* NEXT %?
  DEADLINE: %^{Deadline}T\n")
  ("Stc" "OCRA1 - M/W" entry
   (file+headline "~/Dropbox/org/school.org" "_OCRA1_")
   "* NEXT %?
  DEADLINE: %^{Deadline}T\n")
  ("Sr" "School Readings")
  ("Srj" "OCS15 - T/Th" entry
   (file+headline "~/Dropbox/org/school.org" "_OCS15_")
   "* NEXT %?
  DEADLINE: <%<%Y-%m-%d %a 07:15>>\n")
  ("Srm" "UM51A - T/Th" entry
   (file+headline "~/Dropbox/org/school.org" "_UM51A_")
   "**** NEXT %?
  DEADLINE: <%<%Y-%m-%d %a 08:30>>\n")
  ("Srs" "OPS10 - M/W" entry
   (file+headline "~/Dropbox/org/school.org" "_OPS10_")
   "* NEXT %?
  DEADLINE: <%<%Y-%m-%d %a 11:00>>\n")
  ("Srp" "OP051 - M/W" entry
   (file+headline "~/Dropbox/org/school.org" "_OP051_")
   "* NEXT %?
  DEADLINE: <%<%Y-%m-%d %a 14:45>>\n")
  ("Src" "OCRA1 - M/W" entry
   (file+headline "~/Dropbox/org/school.org" "_OCRA1_")
   "* NEXT %?
  DEADLINE: <%<%Y-%m-%d %a 09:45>>\n")
  ("M" "Music")
  ("Mc" "Conducting Homework" entry
   (file+headline "~/Dropbox/org/music.org" "Homework")
   "* TODO Conducting Homework
  DEADLINE: %^t
  - %?")
  ("V" "Violin")
  ("Vc" "Create Practice Entry" entry
   (file+olp "~/Dropbox/org/violin.org" "Practice Log")
   "* [%<%Y-%m-%d %a>]
  %t%?")
  ("Vd" "Add practice details" item
   (file+function "~/Dropbox/org/violin.org" pgw/headline_date)
   "%?")
  ("f" "Fun")
  ("fc" "Cookie Clicker Save" entry
   (file+olp "~/Dropbox/org/notes.org" "Cookie Clicker Run [2020-09-14 Mon]")
   "* %U
  %?
  : %c
  ")
  ("q" "Quotes" entry
   (file+olp "~/Dropbox/org/notes.org" "Quotes")
   "* %?
  :PROPERTIES:
  :DATE:     %U
  :END:
  %^{FROM}p
  ")))
#+end_src

