init.html

<div id="outline-container-orgad1e099" class="outline-4">
<h4 id="orgad1e099"><span class="section-number-4">4.15.10</span> Quick Capture</h4>
<div class="outline-text-4" id="text-4-15-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">pgw/year-month</span> ()
  <span style="color: #A875FF;">"Custom function to return date in format: YYYY-MM"</span>
  (format-time-string <span style="color: #7984D1;">"%Y-%m"</span>))

(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">pgw/U</span> ()
  <span style="color: #A875FF;">"Custom function to return date in org inactive timestamp format"</span>
  (format-time-string <span style="color: #7984D1;">"[%Y-%m-%d %a]"</span>))

(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">pgw/add-12</span> ()
  <span style="color: #A875FF;">"Custom function return active org timestamp with exactly 24 hour difference"</span>
  (format-time-string <span style="color: #7984D1;">"%Y-%m-%d %a %H:%M"</span> (time-add (current-time) 85500)))

(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">pgw/headline_date</span> ()
  <span style="color: #A875FF;">"Function to find the date as headline for Violin capture template"</span>
  (goto-char (point-min))
  (<span style="color: #ff2afc; font-weight: bold;">let</span> ((searchresults (search-forward (format-time-string <span style="color: #7984D1;">"[%Y-%m-%d %a]"</span>) nil t)))
    (<span style="color: #ff2afc; font-weight: bold;">if</span> searchresults
        'searchresults
      (<span style="color: #ffd400;">error</span> <span style="color: #7984D1;">"Not found! Use Vc to create today's practice first."</span>)
      )
    )
  )

(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-capture-templates
      '(
(<span style="color: #7984D1;">"i"</span> <span style="color: #7984D1;">"Inbox"</span>)
(<span style="color: #7984D1;">"ii"</span> <span style="color: #7984D1;">"Inbox Entry"</span> entry (file <span style="color: #7984D1;">"~/Dropbox/org/inbox.org"</span>)
<span style="color: #7984D1;">"* NEXT %?</span>
<span style="color: #7984D1;">"</span>)
(<span style="color: #7984D1;">"il"</span> <span style="color: #7984D1;">"Inbox w/ Link"</span> entry (file <span style="color: #7984D1;">"~/Dropbox/org/inbox.org"</span>)
<span style="color: #7984D1;">"* NEXT %?</span>
<span style="color: #7984D1;">%a</span>
<span style="color: #7984D1;">"</span>)
(<span style="color: #7984D1;">"in"</span> <span style="color: #7984D1;">"Quick Note"</span> entry (file <span style="color: #7984D1;">"~/Dropbox/org/inbox.org"</span>)
<span style="color: #7984D1;">"* %?</span>
<span style="color: #7984D1;">%U"</span>)
(<span style="color: #7984D1;">"e"</span> <span style="color: #7984D1;">"Events"</span>)
(<span style="color: #7984D1;">"ef"</span> <span style="color: #7984D1;">"Emacs Event (Not synced)"</span> entry (file <span style="color: #7984D1;">"~/Dropbox/org/events.org"</span>)
 <span style="color: #7984D1;">"* %?"</span>)
(<span style="color: #7984D1;">"ee"</span> <span style="color: #7984D1;">"Emacs Calendar (Limbo)"</span> entry (file <span style="color: #7984D1;">"~/Dropbox/org/events.org"</span>)
 <span style="color: #7984D1;">"* %^{Title of event}</span>
<span style="color: #7984D1;">SCHEDULED: %^{Scheduled time + duration}T</span>
<span style="color: #7984D1;">:PROPERTIES:</span>
<span style="color: #7984D1;">:calendar-id: ihfv2u5n9uf5ksj5484vbe7mj4@group.calendar.google.com</span>
<span style="color: #7984D1;">:END:</span>
<span style="color: #7984D1;">:org-gcal:%?</span>
<span style="color: #7984D1;">:END:"</span> <span style="color: #1ea8fc;">:jump-to-captured</span> t)
(<span style="color: #7984D1;">"ep"</span> <span style="color: #7984D1;">"Gmail Calendar (Limbo)"</span> entry (file <span style="color: #7984D1;">"~/Dropbox/org/events.org"</span>)
 <span style="color: #7984D1;">"* %^{Title of event}</span>
<span style="color: #7984D1;">SCHEDULED: %^{Scheduled time + duration}T</span>
<span style="color: #7984D1;">:PROPERTIES:</span>
<span style="color: #7984D1;">:calendar-id: pierce.g.wang@gmail.com</span>
<span style="color: #7984D1;">:END:</span>
<span style="color: #7984D1;">:org-gcal:%?</span>
<span style="color: #7984D1;">:END:"</span> <span style="color: #1ea8fc;">:jump-to-captured</span> t)
(<span style="color: #7984D1;">"es"</span> <span style="color: #7984D1;">"SFCM Calendar (Limbo)"</span> entry (file <span style="color: #7984D1;">"~/Dropbox/org/sfcm.org"</span>)
 <span style="color: #7984D1;">"* %^{Title of event}</span>
<span style="color: #7984D1;">SCHEDULED: %^{Scheduled time + duration}T</span>
<span style="color: #7984D1;">:PROPERTIES:</span>
<span style="color: #7984D1;">:calendar-id: taiu2dsr8o29c09m7nn1n21t9o@group.calendar.google.com</span>
<span style="color: #7984D1;">:END:</span>
<span style="color: #7984D1;">:org-gcal:%?</span>
<span style="color: #7984D1;">:END:"</span> <span style="color: #1ea8fc;">:jump-to-captured</span> t)
(<span style="color: #7984D1;">"L"</span> <span style="color: #7984D1;">"Link"</span> entry (file+headline <span style="color: #7984D1;">"~/Dropbox/org/links.org"</span> <span style="color: #7984D1;">"!Inbox"</span>)
<span style="color: #7984D1;">"* [[%?%:link][%:description]]</span>
<span style="color: #7984D1;">:PROPERTIES:</span>
<span style="color: #7984D1;">:CREATED:  %U</span>
<span style="color: #7984D1;">:END:"</span> <span style="color: #1ea8fc;">:prepend</span> t)
(<span style="color: #7984D1;">"g"</span> <span style="color: #7984D1;">"Manual"</span> entry (file <span style="color: #7984D1;">"~/Dropbox/org/notes.org"</span>)
<span style="color: #7984D1;">"* %?</span>
<span style="color: #7984D1;">:PROPERTIES:</span>
<span style="color: #7984D1;">:CREATED:  %U</span>
<span style="color: #7984D1;">:END:"</span> <span style="color: #1ea8fc;">:empty-lines</span> 1)
(<span style="color: #7984D1;">"b"</span> <span style="color: #7984D1;">"Book"</span> entry (file+headline <span style="color: #7984D1;">"~/Dropbox/org/notes.org"</span> <span style="color: #7984D1;">"Books"</span>)
 <span style="color: #7984D1;">"* %^{RATING}p%^{Book Title}"</span>)
(<span style="color: #7984D1;">"j"</span> <span style="color: #7984D1;">"Journal"</span> entry
(file+olp+datetree <span style="color: #7984D1;">"~/Dropbox/org/orgjournal.org.gpg"</span>)
<span style="color: #7984D1;">"* %?</span>
<span style="color: #7984D1;">:PROPERTIES:</span>
<span style="color: #7984D1;">:LOGGED: %^{Logged Time}U</span>
<span style="color: #7984D1;">:END:</span>
<span style="color: #7984D1;">"</span> <span style="color: #1ea8fc;">:kill-buffer</span> t)
(<span style="color: #7984D1;">"m"</span> <span style="color: #7984D1;">"Mail"</span>)
(<span style="color: #7984D1;">"mt"</span> <span style="color: #7984D1;">"Mail task"</span> entry
 (file <span style="color: #7984D1;">"~/Dropbox/org/inbox.org"</span>)
 <span style="color: #7984D1;">"* NEXT %? :email:</span>
<span style="color: #7984D1;">:PROPERTIES:</span>
<span style="color: #7984D1;">:EMAIL: %a</span>
<span style="color: #7984D1;">:SENDER: %:from</span>
<span style="color: #7984D1;">:END:\n"</span>)
(<span style="color: #7984D1;">"mn"</span> <span style="color: #7984D1;">"Mail note"</span> entry
 (file <span style="color: #7984D1;">"~/Dropbox/org/inbox.org"</span>)
 <span style="color: #7984D1;">"* %? :email:</span>
<span style="color: #7984D1;">:PROPERTIES:</span>
<span style="color: #7984D1;">:EMAIL: %a</span>
<span style="color: #7984D1;">:SENDER: %:from</span>
<span style="color: #7984D1;">:END:\n"</span>)
(<span style="color: #7984D1;">"S"</span> <span style="color: #7984D1;">"School"</span>)
(<span style="color: #7984D1;">"St"</span> <span style="color: #7984D1;">"School Tasks"</span>)
(<span style="color: #7984D1;">"Stj"</span> <span style="color: #7984D1;">"OCS15 - T/Th"</span> entry
 (file+headline <span style="color: #7984D1;">"~/Dropbox/org/school.org"</span> <span style="color: #7984D1;">"_OCS15_"</span>)
 <span style="color: #7984D1;">"* NEXT %?</span>
<span style="color: #7984D1;">DEADLINE: %^{Deadline}T\n"</span>)
(<span style="color: #7984D1;">"Stm"</span> <span style="color: #7984D1;">"UM51A - T/Th"</span> entry
 (file+headline <span style="color: #7984D1;">"~/Dropbox/org/school.org"</span> <span style="color: #7984D1;">"_UM51A_"</span>)
 <span style="color: #7984D1;">"**** NEXT %?</span>
<span style="color: #7984D1;">DEADLINE: %^{Deadline}T\n"</span>)
(<span style="color: #7984D1;">"Sts"</span> <span style="color: #7984D1;">"OPS10 - M/W"</span> entry
 (file+headline <span style="color: #7984D1;">"~/Dropbox/org/school.org"</span> <span style="color: #7984D1;">"_OPS10_"</span>)
 <span style="color: #7984D1;">"* NEXT %?</span>
<span style="color: #7984D1;">DEADLINE: %^{Deadline}T\n"</span>)
(<span style="color: #7984D1;">"Stp"</span> <span style="color: #7984D1;">"OP051 - M/W"</span> entry
 (file+headline <span style="color: #7984D1;">"~/Dropbox/org/school.org"</span> <span style="color: #7984D1;">"_OP051_"</span>)
 <span style="color: #7984D1;">"* NEXT %?</span>
<span style="color: #7984D1;">DEADLINE: %^{Deadline}T\n"</span>)
(<span style="color: #7984D1;">"Stc"</span> <span style="color: #7984D1;">"OCRA1 - M/W"</span> entry
 (file+headline <span style="color: #7984D1;">"~/Dropbox/org/school.org"</span> <span style="color: #7984D1;">"_OCRA1_"</span>)
 <span style="color: #7984D1;">"* NEXT %?</span>
<span style="color: #7984D1;">DEADLINE: %^{Deadline}T\n"</span>)
(<span style="color: #7984D1;">"Sr"</span> <span style="color: #7984D1;">"School Readings"</span>)
(<span style="color: #7984D1;">"Srj"</span> <span style="color: #7984D1;">"OCS15 - T/Th"</span> entry
 (file+headline <span style="color: #7984D1;">"~/Dropbox/org/school.org"</span> <span style="color: #7984D1;">"_OCS15_"</span>)
 <span style="color: #7984D1;">"* NEXT %?</span>
<span style="color: #7984D1;">DEADLINE: &lt;%&lt;%Y-%m-%d %a 07:15&gt;&gt;\n"</span>)
(<span style="color: #7984D1;">"Srm"</span> <span style="color: #7984D1;">"UM51A - T/Th"</span> entry
 (file+headline <span style="color: #7984D1;">"~/Dropbox/org/school.org"</span> <span style="color: #7984D1;">"_UM51A_"</span>)
 <span style="color: #7984D1;">"**** NEXT %?</span>
<span style="color: #7984D1;">DEADLINE: &lt;%&lt;%Y-%m-%d %a 08:30&gt;&gt;\n"</span>)
(<span style="color: #7984D1;">"Srs"</span> <span style="color: #7984D1;">"OPS10 - M/W"</span> entry
 (file+headline <span style="color: #7984D1;">"~/Dropbox/org/school.org"</span> <span style="color: #7984D1;">"_OPS10_"</span>)
 <span style="color: #7984D1;">"* NEXT %?</span>
<span style="color: #7984D1;">DEADLINE: &lt;%&lt;%Y-%m-%d %a 11:00&gt;&gt;\n"</span>)
(<span style="color: #7984D1;">"Srp"</span> <span style="color: #7984D1;">"OP051 - M/W"</span> entry
 (file+headline <span style="color: #7984D1;">"~/Dropbox/org/school.org"</span> <span style="color: #7984D1;">"_OP051_"</span>)
 <span style="color: #7984D1;">"* NEXT %?</span>
<span style="color: #7984D1;">DEADLINE: &lt;%&lt;%Y-%m-%d %a 14:45&gt;&gt;\n"</span>)
(<span style="color: #7984D1;">"Src"</span> <span style="color: #7984D1;">"OCRA1 - M/W"</span> entry
 (file+headline <span style="color: #7984D1;">"~/Dropbox/org/school.org"</span> <span style="color: #7984D1;">"_OCRA1_"</span>)
 <span style="color: #7984D1;">"* NEXT %?</span>
<span style="color: #7984D1;">DEADLINE: &lt;%&lt;%Y-%m-%d %a 09:45&gt;&gt;\n"</span>)
(<span style="color: #7984D1;">"M"</span> <span style="color: #7984D1;">"Music"</span>)
(<span style="color: #7984D1;">"Mc"</span> <span style="color: #7984D1;">"Conducting Homework"</span> entry
 (file+headline <span style="color: #7984D1;">"~/Dropbox/org/music.org"</span> <span style="color: #7984D1;">"Homework"</span>)
 <span style="color: #7984D1;">"* TODO Conducting Homework</span>
<span style="color: #7984D1;">DEADLINE: %^t</span>
<span style="color: #7984D1;">- %?"</span>)
(<span style="color: #7984D1;">"V"</span> <span style="color: #7984D1;">"Violin"</span>)
(<span style="color: #7984D1;">"Vc"</span> <span style="color: #7984D1;">"Create Practice Entry"</span> entry
 (file+olp <span style="color: #7984D1;">"~/Dropbox/org/violin.org"</span> <span style="color: #7984D1;">"Practice Log"</span>)
 <span style="color: #7984D1;">"* [%&lt;%Y-%m-%d %a&gt;]</span>
<span style="color: #7984D1;">%t%?"</span>)
(<span style="color: #7984D1;">"Vd"</span> <span style="color: #7984D1;">"Add practice details"</span> item
 (file+function <span style="color: #7984D1;">"~/Dropbox/org/violin.org"</span> pgw/headline_date)
 <span style="color: #7984D1;">"%?"</span>)
(<span style="color: #7984D1;">"f"</span> <span style="color: #7984D1;">"Fun"</span>)
(<span style="color: #7984D1;">"fc"</span> <span style="color: #7984D1;">"Cookie Clicker Save"</span> entry
 (file+olp <span style="color: #7984D1;">"~/Dropbox/org/notes.org"</span> <span style="color: #7984D1;">"Cookie Clicker Run [2020-09-14 Mon]"</span>)
 <span style="color: #7984D1;">"* %U</span>
<span style="color: #7984D1;">%?</span>
<span style="color: #7984D1;">: %c</span>
<span style="color: #7984D1;">"</span>)
(<span style="color: #7984D1;">"q"</span> <span style="color: #7984D1;">"Quotes"</span> entry
 (file+olp <span style="color: #7984D1;">"~/Dropbox/org/notes.org"</span> <span style="color: #7984D1;">"Quotes"</span>)
 <span style="color: #7984D1;">"* %?</span>
<span style="color: #7984D1;">:PROPERTIES:</span>
<span style="color: #7984D1;">:DATE:     %U</span>
<span style="color: #7984D1;">:END:</span>
<span style="color: #7984D1;">%^{FROM}p</span>
<span style="color: #7984D1;">"</span>)))
</pre>
</div>
</div>
</div>
