init.org
*** MobileOrg

#+begin_src emacs-lisp
  ;; Set to the name of the file where new notes will be stored
  (setq org-mobile-inbox-for-pull "~/Dropbox/Apps/MobileOrg/index.org")
  ;; Set to <your Dropbox root directory>/MobileOrg.
  (setq org-mobile-directory "~/Dropbox/Apps/MobileOrg")
#+end_src

*** Crypt

#+begin_src emacs-lisp
  (use-package org-crypt
    :load-path "elpa/org-9.2.3"
    :config
    (org-crypt-use-before-save-magic)
    (setq org-tags-exclude-from-inheritance (quote ("crypt")))

    (setq org-crypt-key "3C44F187958295E4")
    ;; GPG key to use for encryption
    ;; Either the Key ID or set to nil to use symmetric encryption.

    (setq auto-save-default nil)
    ;; Auto-saving does not cooperate with org-crypt.el: so you need
    ;; to turn it off if you plan to use org-crypt.el quite often.
    ;; Otherwise, you'll get an (annoying) message each time you
    ;; start Org.

    ;; To turn it off only locally, you can insert this:
    ;;
    ;; # -*- buffer-auto-save-file-name: nil; -*-
    :bind (("C-c s-d e" . org-encrypt-entry)
           ("C-c s-d d" . org-decrypt-entry))
    )
#+end_src

*** Babel

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (org-babel-do-load-languages 'org-babel-load-languages
                                 '((python . t)
                                   )))
#+end_src

*** Org-drill

#+begin_src emacs-lisp
  ;;; org-drill
  (use-package org-drill
    :load-path "custom_load")
#+end_src

*** Latex
#+begin_src emacs-lisp
  (require 'ox-latex)
#+end_src

**** CDLatex
#+begin_src emacs-lisp
  (use-package cdlatex
    :after org
    :config
    (define-key org-cdlatex-mode-map (kbd "H-d") 'cdlatex-dollar)
    (define-key cdlatex-mode-map (kbd "H-d") 'cdlatex-dollar)
    (add-hook 'org-mode-hook #'org-cdlatex-mode)
    )
#+end_src

**** Fragments



#+begin_src emacs-lisp
  (setq org-format-latex-options
        ;; '(:foreground "#000000" :background default ;; light theme
        '(:foreground "#d6d6d4" :background default ;; dark theme
                      :scale 1.4
                      :html-foreground "Black" :html-background "Transparent"
                      :html-scale 1.0 
                      :matchers ("begin" "$1" "$" "$$" "\\(" "\\[")))
#+end_src

Fix color handling in org-preview-latex-fragment

#+begin_src emacs-lisp
  (let ((dvipng--plist (alist-get 'dvipng org-preview-latex-process-alist)))
    (plist-put dvipng--plist :use-xcolor t)
    (plist-put dvipng--plist :image-converter '("dvipng -D %D -T tight -o %O %f")))
#+end_src

#+begin_src emacs-lisp :tangle no
  (global-set-key (kbd "C-c C-x C-l") 'org-toggle-latex-fragment)
#+end_src

*** Org Superstar (Bullets revamped)
#+begin_src emacs-lisp
  (use-package org-superstar
    :config
    (setq org-superstar-prettify-item-bullets 'nil)
    :hook (org-mode . org-superstar-mode))

#+end_src

*** Export
**** Async Init File:
#+begin_src emacs-lisp
  (setq org-export-async-init-file "~/.emacs.d/orgasyncinit.el")
#+end_src

