init.html

<div id="outline-container-orgd27f930" class="outline-4">
<h4 id="orgd27f930"><span class="section-number-4">4.15.11</span> MobileOrg</h4>
<div class="outline-text-4" id="text-4-15-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Set to the name of the file where new notes will be stored</span>
(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-mobile-inbox-for-pull <span style="color: #7984D1;">"~/Dropbox/Apps/MobileOrg/index.org"</span>)
<span style="color: #546A90;">;; </span><span style="color: #546A90;">Set to &lt;your Dropbox root directory&gt;/MobileOrg.</span>
(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-mobile-directory <span style="color: #7984D1;">"~/Dropbox/Apps/MobileOrg"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge35b245" class="outline-4">
<h4 id="orge35b245"><span class="section-number-4">4.15.12</span> Crypt</h4>
<div class="outline-text-4" id="text-4-15-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">org-crypt</span>
  <span style="color: #1ea8fc;">:load-path</span> <span style="color: #7984D1;">"elpa/org-9.2.3"</span>
  <span style="color: #1ea8fc;">:config</span>
  (org-crypt-use-before-save-magic)
  (<span style="color: #ff2afc; font-weight: bold;">setq</span> org-tags-exclude-from-inheritance (<span style="color: #ff2afc; font-weight: bold;">quote</span> (<span style="color: #7984D1;">"crypt"</span>)))

  (<span style="color: #ff2afc; font-weight: bold;">setq</span> org-crypt-key <span style="color: #7984D1;">"3C44F187958295E4"</span>)
  <span style="color: #546A90;">;; </span><span style="color: #546A90;">GPG key to use for encryption</span>
  <span style="color: #546A90;">;; </span><span style="color: #546A90;">Either the Key ID or set to nil to use symmetric encryption.</span>

  (<span style="color: #ff2afc; font-weight: bold;">setq</span> auto-save-default nil)
  <span style="color: #546A90;">;; </span><span style="color: #546A90;">Auto-saving does not cooperate with org-crypt.el: so you need</span>
  <span style="color: #546A90;">;; </span><span style="color: #546A90;">to turn it off if you plan to use org-crypt.el quite often.</span>
  <span style="color: #546A90;">;; </span><span style="color: #546A90;">Otherwise, you'll get an (annoying) message each time you</span>
  <span style="color: #546A90;">;; </span><span style="color: #546A90;">start Org.</span>

  <span style="color: #546A90;">;; </span><span style="color: #546A90;">To turn it off only locally, you can insert this:</span>
  <span style="color: #546A90;">;;</span>
  <span style="color: #546A90;">;; </span><span style="color: #546A90;"># -*- buffer-auto-save-file-name: nil; -*-</span>
  <span style="color: #1ea8fc;">:bind</span> ((<span style="color: #7984D1;">"C-c s-d e"</span> . org-encrypt-entry)
         (<span style="color: #7984D1;">"C-c s-d d"</span> . org-decrypt-entry))
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-org2b61900" class="outline-4">
<h4 id="org2b61900"><span class="section-number-4">4.15.13</span> Babel</h4>
<div class="outline-text-4" id="text-4-15-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">with-eval-after-load</span> 'org
  (org-babel-do-load-languages 'org-babel-load-languages
                               '((python . t)
                                 )))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga4b6541" class="outline-4">
<h4 id="orga4b6541"><span class="section-number-4">4.15.14</span> Org-drill</h4>
<div class="outline-text-4" id="text-4-15-14">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;;; </span><span style="color: #546A90;">org-drill</span>
(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">org-drill</span>
  <span style="color: #1ea8fc;">:load-path</span> <span style="color: #7984D1;">"custom_load"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org33d016d" class="outline-4">
<h4 id="org33d016d"><span class="section-number-4">4.15.15</span> Latex</h4>
<div class="outline-text-4" id="text-4-15-15">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">ox-latex</span>)
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org3d0f72a"></a>CDLatex<br />
<div class="outline-text-5" id="text-4-15-15-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">cdlatex</span>
  <span style="color: #1ea8fc;">:after</span> org
  <span style="color: #1ea8fc;">:config</span>
  (define-key org-cdlatex-mode-map (kbd <span style="color: #7984D1;">"H-d"</span>) 'cdlatex-dollar)
  (define-key cdlatex-mode-map (kbd <span style="color: #7984D1;">"H-d"</span>) 'cdlatex-dollar)
  (add-hook 'org-mode-hook #'org-cdlatex-mode)
  )
</pre>
</div>
</div>
</li>

<li><a id="org8c858da"></a>Fragments<br />
<div class="outline-text-5" id="text-4-15-15-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-format-latex-options
      <span style="color: #546A90;">;; </span><span style="color: #546A90;">'(:foreground "#000000" :background default ;; light theme</span>
      '(<span style="color: #1ea8fc;">:foreground</span> <span style="color: #7984D1;">"#d6d6d4"</span> <span style="color: #1ea8fc;">:background</span> default <span style="color: #546A90;">;; </span><span style="color: #546A90;">dark theme</span>
                    <span style="color: #1ea8fc;">:scale</span> 1.4
                    <span style="color: #1ea8fc;">:html-foreground</span> <span style="color: #7984D1;">"Black"</span> <span style="color: #1ea8fc;">:html-background</span> <span style="color: #7984D1;">"Transparent"</span>
                    <span style="color: #1ea8fc;">:html-scale</span> 1.0 
                    <span style="color: #1ea8fc;">:matchers</span> (<span style="color: #7984D1;">"begin"</span> <span style="color: #7984D1;">"$1"</span> <span style="color: #7984D1;">"$"</span> <span style="color: #7984D1;">"$$"</span> <span style="color: #7984D1;">"</span><span style="color: #ff2afc; font-weight: bold;">\\</span><span style="color: #ff2afc; font-weight: bold;">(</span><span style="color: #7984D1;">"</span> <span style="color: #7984D1;">"\\["</span>)))
</pre>
</div>

<p>
Fix color handling in org-preview-latex-fragment
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">let</span> ((dvipng--plist (alist-get 'dvipng org-preview-latex-process-alist)))
  (plist-put dvipng--plist <span style="color: #1ea8fc;">:use-xcolor</span> t)
  (plist-put dvipng--plist <span style="color: #1ea8fc;">:image-converter</span> '(<span style="color: #7984D1;">"dvipng -D %D -T tight -o %O %f"</span>)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #7984D1;">"C-c C-x C-l"</span>) 'org-toggle-latex-fragment)
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org54f7395" class="outline-4">
<h4 id="org54f7395"><span class="section-number-4">4.15.16</span> Org Superstar (Bullets revamped)</h4>
<div class="outline-text-4" id="text-4-15-16">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">org-superstar</span>
  <span style="color: #1ea8fc;">:config</span>
  (<span style="color: #ff2afc; font-weight: bold;">setq</span> org-superstar-prettify-item-bullets 'nil)
  <span style="color: #1ea8fc;">:hook</span> (org-mode . org-superstar-mode))

</pre>
</div>
</div>
</div>

<div id="outline-container-org616eb63" class="outline-4">
<h4 id="org616eb63"><span class="section-number-4">4.15.17</span> Export</h4>
<div class="outline-text-4" id="text-4-15-17">
</div>
<ol class="org-ol">
<li><a id="org109a7e4"></a>Async Init File:<br />
<div class="outline-text-5" id="text-4-15-17-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-export-async-init-file <span style="color: #7984D1;">"~/.emacs.d/orgasyncinit.el"</span>)
</pre>
</div>
</div>
</li>
