init.org
*** AUCTEX
#+begin_src emacs-lisp
  (use-package tex
    :ensure auctex
    :defer t
    :config
    (setq TeX-auto-save t))
#+end_src

*** Classes - Adding Academic XeTeX Times New Roman Class

#+begin_src emacs-lisp
  (unless (with-no-warnings (find "Times" org-latex-classes :key 'car
                                  :test 'equal))
    (add-to-list 'org-latex-classes
                 '("Times"
                   "\\documentclass[12pt]{article}
  \\usepackage{fontspec}
  \\setmainfont{Times New Roman}
  \\usepackage{hyperref}"
                   ("\\section{%s}" . "\\section*{%s}")
                   ("\\subsection{%s}" . "\\subsection*{%s}")
                   ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                   ("\\paragraph{%s}" . "\\paragraph*{%s}")
                   ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
#+end_src

** Evil
#+begin_src emacs-lisp
  (use-package evil
    :config
    (evil-mode t)
    (dolist (mode '(dired-mode calendar-mode image-mode timer-list-mode messages-buffer-mode bufler-list-mode 2048-mode)) (add-to-list 'evil-emacs-state-modes mode)))
#+end_src

*** Normal Mode Keybinds
#+begin_src emacs-lisp
  ;; (define-key evil-normal-state-map (kbd "<S-return>") [?m ?` ?o escape ?` ?`])
  ;; (define-key evil-normal-state-map (kbd "<s-S-return>") [?m ?` ?O escape ?` ?`])
  (define-key evil-motion-state-map (kbd "k") 'evil-previous-visual-line)
  (define-key evil-motion-state-map (kbd "j") 'evil-next-visual-line)
  (define-key evil-motion-state-map (kbd "g k") 'evil-previous-line)
  (define-key evil-motion-state-map (kbd "g j") 'evil-next-line)
  (define-key evil-insert-state-map (kbd "C-a") 'beginning-of-visual-line)
  (define-key evil-insert-state-map (kbd "C-e") 'end-of-visual-line)
#+end_src

** Programming Environments
Hide-show minor mode for collapsing functions
#+begin_src emacs-lisp
  (add-hook 'prog-mode-hook #'hs-minor-mode)
  (electric-pair-mode)
#+end_src

*** Python
**** python-docstring
Smart Python Docstring Formatting
#+begin_src emacs-lisp
  (use-package python-docstring
    :load-path "site-lisp/python-docstring-mode")
#+end_src

**** Elpy
#+begin_src emacs-lisp
  (use-package elpy
    :config
    (elpy-enable)
    (add-hook 'elpy-mode-hook
            'python-docstring-mode)
    (setq elpy-rpc-backend "jedi"))
#+end_src

*** Octave
#+begin_src emacs-lisp
  (setq auto-mode-alist
        (cons '("\\.m$" . octave-mode) auto-mode-alist))
  (add-hook 'octave-mode-hook
            (lambda ()
              (abbrev-mode 1)
              (auto-fill-mode 1)
              (if (eq window-system 'x)
                  (font-lock-mode 1))))
#+end_src

*** Java

#+begin_src emacs-lisp
  (use-package projectile)
  (use-package flycheck)
  (use-package yasnippet :config (yas-global-mode))
  (use-package lsp-mode :hook ((lsp-mode . lsp-enable-which-key-integration))
    :config (setq lsp-completion-enable-additional-text-edit nil))
  (use-package hydra)
  (use-package company)
  (use-package lsp-ui)
  (use-package lsp-java :config (add-hook 'java-mode-hook 'lsp))
  (use-package dap-mode :after lsp-mode :config (dap-auto-configure-mode))
  (use-package dap-java :ensure nil)
  (use-package lsp-ivy)
  (use-package lsp-treemacs)
#+end_src

