init.html

<div id="outline-container-org206727b" class="outline-4">
<h4 id="org206727b"><span class="section-number-4">4.16.1</span> AUCTEX</h4>
<div class="outline-text-4" id="text-4-16-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">tex</span>
  <span style="color: #1ea8fc;">:ensure</span> auctex
  <span style="color: #1ea8fc;">:defer</span> t
  <span style="color: #1ea8fc;">:config</span>
  (<span style="color: #ff2afc; font-weight: bold;">setq</span> TeX-auto-save t))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd20dc12" class="outline-4">
<h4 id="orgd20dc12"><span class="section-number-4">4.16.2</span> Classes - Adding Academic XeTeX Times New Roman Class</h4>
<div class="outline-text-4" id="text-4-16-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">unless</span> (with-no-warnings (find <span style="color: #7984D1;">"Times"</span> org-latex-classes <span style="color: #1ea8fc;">:key</span> 'car
                                <span style="color: #1ea8fc;">:test</span> 'equal))
  (add-to-list 'org-latex-classes
               '(<span style="color: #7984D1;">"Times"</span>
                 <span style="color: #7984D1;">"\\documentclass[12pt]{article}</span>
<span style="color: #7984D1;">\\usepackage{fontspec}</span>
<span style="color: #7984D1;">\\setmainfont{Times New Roman}</span>
<span style="color: #7984D1;">\\usepackage{hyperref}"</span>
                 (<span style="color: #7984D1;">"\\section{%s}"</span> . <span style="color: #7984D1;">"\\section*{%s}"</span>)
                 (<span style="color: #7984D1;">"\\subsection{%s}"</span> . <span style="color: #7984D1;">"\\subsection*{%s}"</span>)
                 (<span style="color: #7984D1;">"\\subsubsection{%s}"</span> . <span style="color: #7984D1;">"\\subsubsection*{%s}"</span>)
                 (<span style="color: #7984D1;">"\\paragraph{%s}"</span> . <span style="color: #7984D1;">"\\paragraph*{%s}"</span>)
                 (<span style="color: #7984D1;">"\\subparagraph{%s}"</span> . <span style="color: #7984D1;">"\\subparagraph*{%s}"</span>))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org47aaa48" class="outline-3">
<h3 id="org47aaa48"><span class="section-number-3">4.17</span> Evil</h3>
<div class="outline-text-3" id="text-4-17">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">evil</span>
  <span style="color: #1ea8fc;">:config</span>
  (evil-mode t)
  (<span style="color: #ff2afc; font-weight: bold;">dolist</span> (mode '(dired-mode calendar-mode image-mode timer-list-mode messages-buffer-mode bufler-list-mode)) (add-to-list 'evil-emacs-state-modes mode)))
</pre>
</div>
</div>

<div id="outline-container-orgeadceb2" class="outline-4">
<h4 id="orgeadceb2"><span class="section-number-4">4.17.1</span> Normal Mode Keybinds</h4>
<div class="outline-text-4" id="text-4-17-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">(define-key evil-normal-state-map (kbd "&lt;S-return&gt;") [?m ?` ?o escape ?` ?`])</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">(define-key evil-normal-state-map (kbd "&lt;s-S-return&gt;") [?m ?` ?O escape ?` ?`])</span>
(define-key evil-motion-state-map (kbd <span style="color: #7984D1;">"k"</span>) 'evil-previous-visual-line)
(define-key evil-motion-state-map (kbd <span style="color: #7984D1;">"j"</span>) 'evil-next-visual-line)
(define-key evil-motion-state-map (kbd <span style="color: #7984D1;">"g k"</span>) 'evil-previous-line)
(define-key evil-motion-state-map (kbd <span style="color: #7984D1;">"g j"</span>) 'evil-next-line)
(define-key evil-insert-state-map (kbd <span style="color: #7984D1;">"C-a"</span>) 'beginning-of-visual-line)
(define-key evil-insert-state-map (kbd <span style="color: #7984D1;">"C-e"</span>) 'end-of-visual-line)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfffb144" class="outline-3">
<h3 id="orgfffb144"><span class="section-number-3">4.18</span> Programming Environments</h3>
<div class="outline-text-3" id="text-4-18">
<p>
Hide-show minor mode for collapsing functions
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'prog-mode-hook #'hs-minor-mode)
(electric-pair-mode)
</pre>
</div>
</div>

<div id="outline-container-org33e2861" class="outline-4">
<h4 id="org33e2861"><span class="section-number-4">4.18.1</span> Python</h4>
<div class="outline-text-4" id="text-4-18-1">
</div>
<ol class="org-ol">
<li><a id="orgc6b67d7"></a>python-docstring<br />
<div class="outline-text-5" id="text-4-18-1-1">
<p>
Smart Python Docstring Formatting
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">python-docstring</span>
  <span style="color: #1ea8fc;">:load-path</span> <span style="color: #7984D1;">"site-lisp/python-docstring-mode"</span>)
</pre>
</div>
</div>
</li>

<li><a id="orgeaa8d4c"></a>Elpy<br />
<div class="outline-text-5" id="text-4-18-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(elpy-enable)
(add-hook 'elpy-mode-hook
          'python-docstring-mode)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> elpy-rpc-backend <span style="color: #7984D1;">"jedi"</span>)
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org8e1a39f" class="outline-4">
<h4 id="org8e1a39f"><span class="section-number-4">4.18.2</span> Octave</h4>
<div class="outline-text-4" id="text-4-18-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> auto-mode-alist
      (cons '(<span style="color: #7984D1;">"\\.m$"</span> . octave-mode) auto-mode-alist))
(add-hook 'octave-mode-hook
          (<span style="color: #ff2afc; font-weight: bold;">lambda</span> ()
            (abbrev-mode 1)
            (auto-fill-mode 1)
            (<span style="color: #ff2afc; font-weight: bold;">if</span> (eq window-system 'x)
                (font-lock-mode 1))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd8ed50a" class="outline-4">
<h4 id="orgd8ed50a"><span class="section-number-4">4.18.3</span> Java</h4>
<div class="outline-text-4" id="text-4-18-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">projectile</span>)
(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">flycheck</span>)
(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">yasnippet</span> <span style="color: #1ea8fc;">:config</span> (yas-global-mode))
(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">lsp-mode</span> <span style="color: #1ea8fc;">:hook</span> ((lsp-mode . lsp-enable-which-key-integration))
  <span style="color: #1ea8fc;">:config</span> (<span style="color: #ff2afc; font-weight: bold;">setq</span> lsp-completion-enable-additional-text-edit nil))
(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">hydra</span>)
(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">company</span>)
(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">lsp-ui</span>)
(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">lsp-java</span> <span style="color: #1ea8fc;">:config</span> (add-hook 'java-mode-hook 'lsp))
(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">dap-mode</span> <span style="color: #1ea8fc;">:after</span> lsp-mode <span style="color: #1ea8fc;">:config</span> (dap-auto-configure-mode))
(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">dap-java</span> <span style="color: #1ea8fc;">:ensure</span> nil)
(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">lsp-ivy</span>)
(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">lsp-treemacs</span>)
</pre>
</div>
</div>
</div>
</div>
