init.html

<div id="outline-container-org0c0d45a" class="outline-3">
<h3 id="org0c0d45a"><span class="section-number-3">4.19</span> Macros</h3>
<div class="outline-text-3" id="text-4-19">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(fset 'setupworkspace
   [?\C-c ?a ?A ?. ?\C-x ?0 ?\C-x ?3 ?\H-l ?\H-\C-x ?o ?\C-x ?2 ?\C-u ?7 ?\C-x ?^ ?\H-j ?\H-c ?i ?\H-h ?\H-c ?o ?\H-l])
(global-set-key (kbd <span style="color: #7984D1;">"C-x C-k 1"</span>) 'setupworkspace)

<span style="color: #546A90;">;;</span><span style="color: #546A90;">(fset 'OHSFigureSave</span>
<span style="color: #546A90;">;;   </span><span style="color: #546A90;">[?# ?+ ?C ?A ?P ?T ?I ?O ?N ?: ?  ?\C-x ?Q return return tab ?\[ ?\[ ?f ?i ?l ?e ?: ?. ?/ ?W ?e ?e ?k ?  ?\C-x ?Q return ?/ ?\C-x ?Q return ?_ ?\C-u ?\M-! ?d ?a ?t ?e ?  ?+ ?% ?H ?% ?M ?% ?S return escape ?e ?a ?. ?p ?n ?g escape ?v ?B ?F ?/ ?l ?y escape ?A ?\] ?\] return escape ?p ?0 ?i ?\M-x ?i ?n ?s ?e ?r ?t ?d ?i ?r ?e ?c ?t ?o ?r ?y return escape ?V ?d ?i ?\C-x ?\C-f ?\C-  ?\C-a backspace ?/ ?U ?s ?e ?r ?s ?/ ?p ?i ?e ?r ?c ?e ?w ?a ?n ?g ?/ ?S ?c ?r ?e ?e ?n ?s ?h ?o ?t ?s return ?s ?\M-&lt; ?\C-z ?/ ?S ?c ?r ?e ?e ?n ?  ?S ?h ?o ?t return ?R ?\C-  ?\C-a backspace ?\s-v backspace return ?\C-x ?k return])</span>
<span style="color: #546A90;">;;</span><span style="color: #546A90;">(global-set-key (kbd "&lt;f9&gt;") 'OHSFigureSave)</span>

<span style="color: #546A90;">;; </span><span style="color: #546A90;">(defun pgw/disable-helm ()</span>
<span style="color: #546A90;">;;   </span><span style="color: #546A90;">"Disable Helm"</span>
<span style="color: #546A90;">;;   </span><span style="color: #546A90;">(interactive)</span>
<span style="color: #546A90;">;;   </span><span style="color: #546A90;">(helm-mode 0))</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">(defun pgw/enable-helm ()</span>
<span style="color: #546A90;">;;   </span><span style="color: #546A90;">"Enable Helm"</span>
<span style="color: #546A90;">;;   </span><span style="color: #546A90;">(interactive)</span>
<span style="color: #546A90;">;;   </span><span style="color: #546A90;">(helm-mode))</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">(global-set-key (kbd "H-x H-h d") 'pgw/disable-helm)</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">(global-set-key (kbd "H-x H-h e") 'pgw/enable-helm)</span>

<span style="color: #546A90;">;; </span><span style="color: #546A90;">;(fset 'importChine</span>
seFlashcards
<span style="color: #546A90;">;   </span><span style="color: #546A90;">[return ?\C-p ?* ?* ?  ?I ?t ?e ?m ?\C-c ?\C-c ?d ?r ?i ?l ?l return ?\C-n ?\C-a ?\C-z ?f ?= ?x ?x ?\C-z ?\C-k ?\C-n ?\C-a return return ?\C-p ?* ?* ?  ?A ?n ?s ?w ?e ?r ?\C-a ?* ?\C-n ?\C-a ?\C-y ?\; ?  ?\C-a ?\C-n ?\C-n])</span>
(fset 'convertQuizlet
   [?I ?* ?* ?\S-  ?I ?t ?e ?m ?  ?: ?d ?r ?i ?l ?l ?: return escape ?/ ?= ?= return ?x ?x ?i return return ?* ?* ?* ?  ?A ?n ?s ?w ?e ?r return escape ?\M-\}])
(global-set-key (kbd <span style="color: #7984D1;">"&lt;f6&gt;"</span>) 'convertQuizlet)

(fset 'addqtest1
   [?\C-s ?a ?d ?d ?q ?\( return ?\C-a ?\C-  ?\C-\M-f ?\C-\M-f ?\C-f ?\C-\M-$ ?\C-q ?\C-j ?\[ ?  ?\] ?* return return ?\C-e ?\C-r ?a ?d ?d ?q ?\( return ?\C-x ?r ?  ?a ?\C-  ?\M-f ?\C-\M-f ?\C-f ?\C-x ?r ?  ?e ?\C-\M-$ ?\[ ?^ ?\\ ?\\ ?\] ?\\ ?\{ ?2 ?\\ ?\} ?' ?, ?  return ?\" ?, ?  return ?\C-x ?r ?j ?a ?\C-  ?\C-x ?r ?j ?e ?\C-\M-$ ?, ?  ?\[ ?\' ?\| ?\" ?\] return ?n ?i ?l ?e ?x ?i ?s ?t return ?\C-e ?\C-r ?\( return ?\C-a ?\C-s ?\( return ?\C-0 ?\C-k ?\{ return ?\" ?s ?e ?r ?v ?e ?r ?\" ?  ?: ?  ?\C-s ?n ?i ?l ?e ?x ?i ?s ?t return ?\C-u ?8 backspace ?, return ?\" ?q ?u ?e ?s ?t ?i ?o ?n ?\" ?  ?: ?  ?\" ?\C-s ?n ?i ?l ?e ?x ?i ?s ?t return ?\C-u ?8 backspace ?, return ?\" ?a ?n ?s ?w ?e ?r ?\" ?  ?: ?  ?\" ?\C-s ?n ?i ?l ?e ?x ?i ?s ?t return ?\C-u ?8 backspace ?, return ?\" ?q ?_ ?c ?o ?m ?p ?o ?n ?e ?n ?t ?s ?\" ?  ?: ?  ?\[ ?\" ?\C-e ?\C-b ?\C-r ?, return ?\] ?\C-f ?\C-  ?\C-a ?\C-\M-$ ?n ?i ?l ?e ?x ?i ?s ?t return ?, ?  ?\" return ?\C-e ?\C-r ?, ?\C-f return ?\" ?f ?a ?i ?l ?\" ?  ?: ?\C-k ?  ?T ?r ?u ?e return ?\}])
(global-set-key (kbd <span style="color: #7984D1;">"C-x C-k 2"</span>) 'addqtest1)

(fset 'convert_time_to_clock
   [?f ?\[ ?f ?\[ ?d ?0 ?I tab ?C ?L ?O ?C ?K ?: ?  escape ?j ?d ?0 ?i backspace ?- ?- ?\C-c ?\C-c escape ?0 ?j])
(global-set-key (kbd <span style="color: #7984D1;">"C-x C-k 3"</span>) 'convert_time_to_clock)

(fset 'journal_convert
   [?\C-  ?\M-f ?\M-f ?\M-f ?\M-w ?\M-! ?e ?c ?h ?o ?  ?\" ?* ?  ?\s-v ?\" ?  ?&gt; ?&gt; ?  ?j ?o ?u ?r ?n ?a ?l ?. ?o ?r ?g return ?! ?p ?a ?n ?d ?o ?c ?  ?- ?f ?  ?d ?o ?c ?x ?  ?- ?t ?  ?o ?r ?g ?  ?? ?  ?&gt; ?&gt; ?  ?j ?o ?u ?r ?n ?a ?l ?. ?o ?r ?g return ?g ?n])
(global-set-key (kbd <span style="color: #7984D1;">"C-x C-k 4"</span>) 'journal_convert)
</pre>
</div>
</div>

<div id="outline-container-orgb466fb5" class="outline-4">
<h4 id="orgb466fb5"><span class="section-number-4">4.19.1</span> Macro Query</h4>
<div class="outline-text-4" id="text-4-19-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">my-macro-query</span> (arg)
  <span style="color: #A875FF;">"Prompt for input using minibuffer during kbd macro execution.</span>
<span style="color: #A875FF;">With prefix argument, allows you to select what prompt string to use.</span>
<span style="color: #A875FF;">If the input is non-empty, it is inserted at point."</span>
  (<span style="color: #ff2afc; font-weight: bold;">interactive</span> <span style="color: #7984D1;">"P"</span>)
  (<span style="color: #ff2afc; font-weight: bold;">let*</span> ((query (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (kbd-macro-query t)))
         (prompt (<span style="color: #ff2afc; font-weight: bold;">if</span> arg (read-from-minibuffer <span style="color: #7984D1;">"PROMPT: "</span>) <span style="color: #7984D1;">"Input: "</span>))
         (input (<span style="color: #ff2afc; font-weight: bold;">unwind-protect</span>
                    (<span style="color: #ff2afc; font-weight: bold;">progn</span>
                      (add-hook 'minibuffer-setup-hook query)
                      (read-from-minibuffer prompt))
                  (remove-hook 'minibuffer-setup-hook query))))
    (<span style="color: #ff2afc; font-weight: bold;">unless</span> (string= <span style="color: #7984D1;">""</span> input) (insert input))))
(global-set-key <span style="color: #7984D1;">"\C-xQ"</span> 'my-macro-query)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4bbb8c8" class="outline-3">
<h3 id="org4bbb8c8"><span class="section-number-3">4.20</span> Magit</h3>
<div class="outline-text-3" id="text-4-20">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">magit</span>
  <span style="color: #1ea8fc;">:config</span>
  (global-set-key (kbd <span style="color: #7984D1;">"C-x g"</span>) 'magit-status))
</pre>
</div>
</div>
</div>

<div id="outline-container-org681e7d6" class="outline-3">
<h3 id="org681e7d6"><span class="section-number-3">4.21</span> yasnippet - Yet Another Snippet Extension</h3>
<div class="outline-text-3" id="text-4-21">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">yasnippet</span>
  <span style="color: #1ea8fc;">:config</span>
  (yas-global-mode 1) <span style="color: #546A90;">;; </span><span style="color: #546A90;">or M-x yas-reload-all if you've started YASnippet already.</span>
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd05070a" class="outline-3">
<h3 id="orgd05070a"><span class="section-number-3">4.22</span> Backups</h3>
<div class="outline-text-3" id="text-4-22">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> backup-directory-alist '((<span style="color: #7984D1;">"."</span> . <span style="color: #7984D1;">"~/org/backup"</span>))
  backup-by-copying t    <span style="color: #546A90;">; </span><span style="color: #546A90;">Don't delink hardlinks</span>
  version-control t      <span style="color: #546A90;">; </span><span style="color: #546A90;">Use version numbers on backups</span>
  delete-old-versions t  <span style="color: #546A90;">; </span><span style="color: #546A90;">Automatically delete excess backups</span>
  kept-new-versions 20   <span style="color: #546A90;">; </span><span style="color: #546A90;">how many of the newest versions to keep</span>
  kept-old-versions 5    <span style="color: #546A90;">; </span><span style="color: #546A90;">and how many of the old</span>
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab6df70" class="outline-3">
<h3 id="orgab6df70"><span class="section-number-3">4.23</span> Daemon</h3>
<div class="outline-text-3" id="text-4-23">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;;</span><span style="color: #546A90;">(if 'server-process</span>
<span style="color: #546A90;">;;    </span><span style="color: #546A90;">(server-start))</span>
(load <span style="color: #7984D1;">"server"</span>)
(<span style="color: #ff2afc; font-weight: bold;">unless</span> (server-running-p) (server-start))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3dc346e" class="outline-3">
<h3 id="org3dc346e"><span class="section-number-3">4.24</span> Revert Mode</h3>
<div class="outline-text-3" id="text-4-24">
<p>
For files changed by dropbox and also dired buffers.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-auto-revert-mode 1)
</pre>
</div>
</div>
</div>
