init.org
** Calendar
#+begin_src emacs-lisp
  (setq calendar-latitude 37.759995)
  (setq calendar-longitude -122.427046)
  (setq calendar-location-name "San Francisco, CA")
  (add-hook 'calendar-mode-hook
      (lambda ()
        (evil-emacs-state)
        ))
#+end_src

*** Date Style
Set date style to ISO
#+begin_src emacs-lisp
  (calendar-set-date-style 'iso)
#+end_src

** Artist Mode

Artist mode is amazing! Configure some quick keybinds...
#+begin_src emacs-lisp
  (add-hook 'artist-mode-hook
            (lambda ()
              (display-line-numbers-mode -1)
              (evil-emacs-state)
              (local-set-key (kbd "<f1>") 'artist-select-op-poly-line)
              (local-set-key (kbd "<f2>") 'artist-select-op-pen-line)
              (local-set-key (kbd "<f3>") 'artist-select-op-line)
              (local-set-key (kbd "<f4>") 'artist-select-op-square)
              (local-set-key (kbd "<f5>") 'artist-select-op-ellipse))
            )
#+end_src

Also remember, can use <middle mouse button> to see the menu of options.

** Image Mode
#+begin_src emacs-lisp
  (add-hook 'image-mode-hook
            (lambda ()
              (display-line-numbers-mode -1)
              (evil-emacs-state))
            )
#+end_src

** Flyspell mode
Activate =flyspell-mode= automatically in all school files.
#+begin_src elisp
  (defun pgw/turn-on-flyspell-hook ()
    (if (or (string-match "^/Users/piercewang/Google Drive/OHS/" (if (eq buffer-file-name nil) "" buffer-file-name))
            (string-match "^/Users/piercewang/Dropbox/org/notes/college/" (if (eq buffer-file-name nil) "" buffer-file-name)))
        (flyspell-mode 1)))

  (add-hook 'text-mode-hook 'pgw/turn-on-flyspell-hook)
#+end_src

** Games
*** Tetris

I love Emacs Tetris!

#+begin_src emacs-lisp
  (require 'tetris)
  (define-key tetris-mode-map (kbd "z") 'tetris-rotate-prev)
  (define-key tetris-mode-map (kbd "x") 'tetris-rotate-next)
#+end_src
*** DISABLED Retris
CLOSED: [2021-04-10 Sat 22:54]

Doesn't work as of Emacs 27.1 :( maybe someday...
#+begin_src emacs-lisp :tangle no
  (use-package retris
    :load-path "site-lisp/retris")
#+end_src

*** 2048

#+begin_src emacs-lisp
  (use-package 2048-game
    :bind (:map 2048-mode-map
                ("h" . 2048-left)
                ("j" . 2048-down)
                ("k" . 2048-up)
                ("l" . 2048-right)))
#+end_src

** Desktop Save
#+begin_src emacs-lisp
  (desktop-save-mode 1)
  (setq desktop-restore-frames nil)
  (setq desktop-restore-eager 5)
  (setq desktop-path (list "~/.emacs.d/desktopsave/"))
  (setq desktop-files-not-to-save "\\(^/[^/:]*:\\|(ftp)$\\|\.gpg$\\|\.org_archive\\)")
#+end_src

** ERC
#+begin_src emacs-lisp
  (setq erc-log-channels-directory "~/logs/")
  (setq erc-save-buffer-on-part t)
  (global-set-key (kbd "H-M-e") (lambda () (interactive) (erc :server "irc.freenode.net" :port 6667 :nick "tesrodome" :password passwords_ERC)))
#+end_src

** Keybinds
#+begin_src emacs-lisp
  ;;; replace-regexp
  (global-set-key (kbd "C-M-$") 'replace-regexp)

  ;;; Open .emacs.d
  (global-set-key (kbd "H-C-M-e") (lambda () (interactive) (dired "~/.emacs.d/")))

  ;;; Regular find-file
  (global-set-key (kbd "H-C-x o") (lambda () (interactive) (switch-to-buffer "*Org Agenda*")))


  ;;; Close window
  (global-set-key (kbd "s-0") 'delete-window)
#+end_src

Insert Org-mode Image
#+begin_src emacs-lisp
  (global-set-key (kbd "<f8>") 'insert-org-image)
#+end_src

*** which-key
#+begin_src emacs-lisp
  (use-package which-key
    :config
    (which-key-mode)
    (setq which-key-popup-type 'side-window)
    (setq which-key-side-window-location 'bottom)
    )
#+end_src

*** Scrolling
#+begin_src emacs-lisp
  (global-set-key (kbd "C-v") (lambda () (interactive) (scroll-up-command 1)))
  (global-set-key (kbd "M-v") (lambda () (interactive) (scroll-down-command 1)))
#+end_src

