init.html

<div id="outline-container-org3bd7c22" class="outline-3">
<h3 id="org3bd7c22"><span class="section-number-3">4.25</span> Calendar</h3>
<div class="outline-text-3" id="text-4-25">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> calendar-latitude 37.759995)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> calendar-longitude -122.427046)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> calendar-location-name <span style="color: #7984D1;">"Fremont, CA"</span>)
(add-hook 'calendar-mode-hook
    (<span style="color: #ff2afc; font-weight: bold;">lambda</span> ()
      (evil-emacs-state)
      ))
</pre>
</div>
</div>

<div id="outline-container-org313d633" class="outline-4">
<h4 id="org313d633"><span class="section-number-4">4.25.1</span> Date Style</h4>
<div class="outline-text-4" id="text-4-25-1">
<p>
Set date style to ISO
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(calendar-set-date-style 'iso)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8a1af37" class="outline-3">
<h3 id="org8a1af37"><span class="section-number-3">4.26</span> Artist Mode</h3>
<div class="outline-text-3" id="text-4-26">
<p>
Artist mode is amazing! Configure some quick keybinds&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'artist-mode-hook
          (<span style="color: #ff2afc; font-weight: bold;">lambda</span> ()
            (display-line-numbers-mode -1)
            (evil-emacs-state)
            (local-set-key (kbd <span style="color: #7984D1;">"&lt;f1&gt;"</span>) 'artist-select-op-poly-line)
            (local-set-key (kbd <span style="color: #7984D1;">"&lt;f2&gt;"</span>) 'artist-select-op-pen-line)
            (local-set-key (kbd <span style="color: #7984D1;">"&lt;f3&gt;"</span>) 'artist-select-op-line)
            (local-set-key (kbd <span style="color: #7984D1;">"&lt;f4&gt;"</span>) 'artist-select-op-square)
            (local-set-key (kbd <span style="color: #7984D1;">"&lt;f5&gt;"</span>) 'artist-select-op-ellipse))
          )
</pre>
</div>

<p>
Also remember, can use &lt;middle mouse button&gt; to see ht emenu of options.
</p>
</div>
</div>

<div id="outline-container-orgdf8b073" class="outline-3">
<h3 id="orgdf8b073"><span class="section-number-3">4.27</span> Image Mode</h3>
<div class="outline-text-3" id="text-4-27">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'image-mode-hook
          (<span style="color: #ff2afc; font-weight: bold;">lambda</span> ()
            (display-line-numbers-mode -1)
            (evil-emacs-state))
          )
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc55a8b1" class="outline-3">
<h3 id="orgc55a8b1"><span class="section-number-3">4.28</span> Flyspell mode</h3>
<div class="outline-text-3" id="text-4-28">
<p>
Activate <code>flyspell-mode</code> automatically in all school files.
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">pgw/turn-on-flyspell-hook</span> ()
  (<span style="color: #ff2afc; font-weight: bold;">if</span> (<span style="color: #ff2afc; font-weight: bold;">or</span> (string-match <span style="color: #7984D1;">"^/Users/piercewang/Google Drive/OHS/"</span> (<span style="color: #ff2afc; font-weight: bold;">if</span> (eq buffer-file-name nil) <span style="color: #7984D1;">""</span> buffer-file-name))
          (string-match <span style="color: #7984D1;">"^/Users/piercewang/Dropbox/org/notes/college/"</span> (<span style="color: #ff2afc; font-weight: bold;">if</span> (eq buffer-file-name nil) <span style="color: #7984D1;">""</span> buffer-file-name)))
      (flyspell-mode 1)))

(add-hook 'text-mode-hook 'pgw/turn-on-flyspell-hook)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1855379" class="outline-3">
<h3 id="org1855379"><span class="section-number-3">4.29</span> Games</h3>
<div class="outline-text-3" id="text-4-29">
</div>
<div id="outline-container-orgb24807e" class="outline-4">
<h4 id="orgb24807e"><span class="section-number-4">4.29.1</span> Tetris</h4>
<div class="outline-text-4" id="text-4-29-1">
<p>
I love Emacs Tetris!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">tetris</span>)
(define-key tetris-mode-map (kbd <span style="color: #7984D1;">"z"</span>) 'tetris-rotate-prev)
(define-key tetris-mode-map (kbd <span style="color: #7984D1;">"x"</span>) 'tetris-rotate-next)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcfab0ce" class="outline-4">
<h4 id="orgcfab0ce"><span class="section-number-4">4.29.2</span> Retris</h4>
<div class="outline-text-4" id="text-4-29-2">
<p>
Doesn't work as of Emacs 27.1 :( maybe someday&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">retris</span>
  <span style="color: #1ea8fc;">:load-path</span> <span style="color: #7984D1;">"site-lisp/retris"</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge437a3e" class="outline-3">
<h3 id="orge437a3e"><span class="section-number-3">4.30</span> Desktop Save</h3>
<div class="outline-text-3" id="text-4-30">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(desktop-save-mode 1)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> desktop-restore-frames nil)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> desktop-restore-eager 5)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> desktop-path (list <span style="color: #7984D1;">"~/emacs/desktopsave/"</span>))
(<span style="color: #ff2afc; font-weight: bold;">setq</span> desktop-files-not-to-save <span style="color: #7984D1;">"</span><span style="color: #ff2afc; font-weight: bold;">\\</span><span style="color: #ff2afc; font-weight: bold;">(</span><span style="color: #7984D1;">^/[</span><span style="color: #ff2afc; font-weight: bold;">^</span><span style="color: #7984D1;">/:]*:</span><span style="color: #ff2afc; font-weight: bold;">\\</span><span style="color: #ff2afc; font-weight: bold;">|</span><span style="color: #7984D1;">(ftp)$</span><span style="color: #ff2afc; font-weight: bold;">\\</span><span style="color: #ff2afc; font-weight: bold;">|</span><span style="color: #ffd400;">\</span><span style="color: #7984D1;">.gpg$</span><span style="color: #ff2afc; font-weight: bold;">\\</span><span style="color: #ff2afc; font-weight: bold;">|</span><span style="color: #ffd400;">\</span><span style="color: #7984D1;">.org_archive</span><span style="color: #ff2afc; font-weight: bold;">\\</span><span style="color: #ff2afc; font-weight: bold;">)</span><span style="color: #7984D1;">"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org090629c" class="outline-3">
<h3 id="org090629c"><span class="section-number-3">4.31</span> ERC</h3>
<div class="outline-text-3" id="text-4-31">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> erc-log-channels-directory <span style="color: #7984D1;">"~/logs/"</span>)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> erc-save-buffer-on-part t)
(global-set-key (kbd <span style="color: #7984D1;">"H-M-e"</span>) (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (<span style="color: #ff2afc; font-weight: bold;">interactive</span>) (erc <span style="color: #1ea8fc;">:server</span> <span style="color: #7984D1;">"irc.freenode.net"</span> <span style="color: #1ea8fc;">:port</span> 6667 <span style="color: #1ea8fc;">:nick</span> <span style="color: #7984D1;">"tesrodome"</span> <span style="color: #1ea8fc;">:password</span> passwords_ERC)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org0d43189" class="outline-3">
<h3 id="org0d43189"><span class="section-number-3">4.32</span> Keybinds</h3>
<div class="outline-text-3" id="text-4-32">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;;; </span><span style="color: #546A90;">replace-regexp</span>
(global-set-key (kbd <span style="color: #7984D1;">"C-M-$"</span>) 'replace-regexp)

<span style="color: #546A90;">;;; </span><span style="color: #546A90;">Open .emacs.d</span>
(global-set-key (kbd <span style="color: #7984D1;">"H-C-M-e"</span>) (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (<span style="color: #ff2afc; font-weight: bold;">interactive</span>) (dired <span style="color: #7984D1;">"~/.emacs.d/"</span>)))

<span style="color: #546A90;">;;; </span><span style="color: #546A90;">Regular find-file</span>
(global-set-key (kbd <span style="color: #7984D1;">"H-C-x o"</span>) (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (<span style="color: #ff2afc; font-weight: bold;">interactive</span>) (switch-to-buffer <span style="color: #7984D1;">"*Org Agenda*"</span>)))


<span style="color: #546A90;">;;; </span><span style="color: #546A90;">Close window</span>
(global-set-key (kbd <span style="color: #7984D1;">"s-0"</span>) 'delete-window)
</pre>
</div>

<p>
Insert Org-mode Image
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #7984D1;">"&lt;f8&gt;"</span>) 'insert-org-image)
</pre>
</div>
</div>

<div id="outline-container-orgef56199" class="outline-4">
<h4 id="orgef56199"><span class="section-number-4">4.32.1</span> which-key</h4>
<div class="outline-text-4" id="text-4-32-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">which-key</span>
  <span style="color: #1ea8fc;">:config</span>
  (which-key-mode)
  (<span style="color: #ff2afc; font-weight: bold;">setq</span> which-key-popup-type 'side-window)
  (<span style="color: #ff2afc; font-weight: bold;">setq</span> which-key-side-window-location 'bottom)
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-org58fd50a" class="outline-4">
<h4 id="org58fd50a"><span class="section-number-4">4.32.2</span> Scrolling</h4>
<div class="outline-text-4" id="text-4-32-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #7984D1;">"C-v"</span>) (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (<span style="color: #ff2afc; font-weight: bold;">interactive</span>) (scroll-up-command 1)))
(global-set-key (kbd <span style="color: #7984D1;">"M-v"</span>) (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (<span style="color: #ff2afc; font-weight: bold;">interactive</span>) (scroll-down-command 1)))
</pre>
</div>
</div>
</div>
</div>
