init.html

<div id="outline-container-org49cde2b" class="outline-3">
<h3 id="org49cde2b"><span class="section-number-3">4.33</span> Hydra for Resizing Windows</h3>
<div class="outline-text-3" id="text-4-33">
<p>
Functions to change:
<code>(enlarge-window)</code>
<code>(shrink-window-horizontally)</code>
<code>(enlarge-window-horizontally)</code>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">defhydra</span> hydra-windowmanage (global-map <span style="color: #7984D1;">"H-c ^"</span>)
  <span style="color: #A875FF;">"Hydra for window management."</span>
  (<span style="color: #7984D1;">"="</span> enlarge-window <span style="color: #7984D1;">"+Vertical"</span>)
  (<span style="color: #7984D1;">"-"</span> (enlarge-window -1) <span style="color: #7984D1;">"-Vertical"</span>)
  (<span style="color: #7984D1;">"]"</span> enlarge-window-horizontally <span style="color: #7984D1;">"+Horizontal"</span>)
  (<span style="color: #7984D1;">"["</span> shrink-window-horizontally <span style="color: #7984D1;">"-Horizontal"</span>)
  (<span style="color: #7984D1;">"q"</span> nil <span style="color: #7984D1;">"Quit"</span>))

(global-set-key (kbd <span style="color: #7984D1;">"C-c C-6"</span>) 'hydra-windowmanage/body)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcb0993c" class="outline-3">
<h3 id="orgcb0993c"><span class="section-number-3">4.34</span> User Configuration</h3>
<div class="outline-text-3" id="text-4-34">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> user-full-name <span style="color: #7984D1;">"Pierce Wang"</span>
      user-mail-address <span style="color: #7984D1;">"pierce.g.wang@gmail.com"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org26e770d" class="outline-3">
<h3 id="org26e770d"><span class="section-number-3">4.35</span> Buffer Mangement</h3>
<div class="outline-text-3" id="text-4-35">
</div>
<div id="outline-container-org036e0a8" class="outline-4">
<h4 id="org036e0a8"><span class="section-number-4">4.35.1</span> <span class="done DISABLED">DISABLED</span> IBuffer</h4>
<div class="outline-text-4" id="text-4-35-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">ibuffer</span>
  <span style="color: #1ea8fc;">:config</span>
  (global-set-key (kbd <span style="color: #7984D1;">"C-x C-b"</span>) 'ibuffer))
(<span style="color: #ff2afc; font-weight: bold;">setq</span> ibuffer-saved-filter-groups
      '((<span style="color: #7984D1;">"default"</span>
         (<span style="color: #7984D1;">"emacs-config"</span> (<span style="color: #ff2afc; font-weight: bold;">or</span> (filename . <span style="color: #7984D1;">"/.emacs.d/"</span>)
                             (filename . <span style="color: #7984D1;">".emacs.d/init.el"</span>)))
         (<span style="color: #7984D1;">"OHS"</span> (filename . <span style="color: #7984D1;">"/Google Drive/OHS/"</span>))
         (<span style="color: #7984D1;">"Org"</span> (filename . <span style="color: #7984D1;">"/Dropbox/org/"</span>))
         (<span style="color: #7984D1;">"planner"</span> (<span style="color: #ff2afc; font-weight: bold;">or</span>
                    (name . <span style="color: #7984D1;">"</span><span style="color: #ffd400;">\</span><span style="color: #7984D1;">*Calendar</span><span style="color: #ffd400;">\</span><span style="color: #7984D1;">*"</span>)
                    (name . <span style="color: #7984D1;">"</span><span style="color: #ffd400;">\</span><span style="color: #7984D1;">*Org Agenda</span><span style="color: #ffd400;">\</span><span style="color: #7984D1;">*"</span>)
                    (name . <span style="color: #7984D1;">"^diary$"</span>)))
         <span style="color: #546A90;">;; </span><span style="color: #546A90;">("Helm" (name . "\*helm.*"))</span>
         (<span style="color: #7984D1;">"Magit"</span> (mode . Magit))
         (<span style="color: #7984D1;">"ERC"</span> (mode . erc-mode))
         (<span style="color: #7984D1;">"Help"</span> (<span style="color: #ff2afc; font-weight: bold;">or</span> (name . <span style="color: #7984D1;">"</span><span style="color: #ffd400;">\</span><span style="color: #7984D1;">*Help</span><span style="color: #ffd400;">\</span><span style="color: #7984D1;">*"</span>)
                     (name . <span style="color: #7984D1;">"</span><span style="color: #ffd400;">\</span><span style="color: #7984D1;">*info</span><span style="color: #ffd400;">\</span><span style="color: #7984D1;">*"</span>)
                     (name . <span style="color: #7984D1;">"</span><span style="color: #ffd400;">\</span><span style="color: #7984D1;">*GNU Emacs</span><span style="color: #ffd400;">\</span><span style="color: #7984D1;">*"</span>))))))

(add-hook 'ibuffer-mode-hook
          (<span style="color: #ff2afc; font-weight: bold;">lambda</span> ()
            (ibuffer-switch-to-saved-filter-groups <span style="color: #7984D1;">"default"</span>)))
(define-key ibuffer-mode-map (kbd <span style="color: #7984D1;">"P"</span>) nil)
</pre>
</div>
</div>
</div>
