init.org
*** Bufler - Alphapapa

#+begin_src emacs-lisp
  (use-package bufler
    :bind (("C-x C-b" . bufler))
           ;; ("C-x b" . bufler-switch-buffer))
    :config
    (setf bufler-groups
          (bufler-defgroups
            (group
             ;; Subgroup collecting all named workspaces.
             (auto-workspace))
            (group
             ;; Subgroup collecting all `help-mode' and `info-mode' buffers.
             (group-or "*Help/Info*"
                       (mode-match "*Help*" (rx bos "help-"))
                       (mode-match "*Info*" (rx bos "info-"))))
            (group
             ;; Subgroup collecting all special buffers (i.e. ones that are not
             ;; file-backed), except `magit-status-mode' buffers (which are allowed to fall
             ;; through to other groups, so they end up grouped with their project buffers).
             (group-and "*Special*"
                        (lambda (buffer)
                          (unless (or (funcall (mode-match "Magit" (rx bos "magit-status"))
                                               buffer)
                                      (funcall (mode-match "Dired" (rx bos "dired"))
                                               buffer)
                                      (funcall (auto-file) buffer))
                            "*Special*")))
             (group
              ;; Subgroup collecting these "special special" buffers
              ;; separately for convenience.
              (name-match "**Special**"
                          (rx bos "*" (or "Messages" "Warnings" "scratch" "Backtrace") "*")))
             (group
              ;; Subgroup collecting all other Magit buffers, grouped by directory.
              (mode-match "*Magit* (non-status)" (rx bos (or "magit" "forge") "-"))
              (auto-directory))
             ;; Remaining special buffers are grouped automatically by mode.
             (auto-mode))
            ;; All buffers under "~/.emacs.d" (or wherever it is).
            (dir user-emacs-directory)
            (group
             ;; Subgroup collecting buffers in `org-directory' (or "~/org" if
             ;; `org-directory' is not yet defined).
             (dir (if (bound-and-true-p org-directory)
                      org-directory
                    "~/org"))
             (dir "~/Dropbox/org/notes/")
             (dir "~/Dropbox/org/notes/college/essays/" 1)
             (group
              ;; Subgroup collecting indirect Org buffers, grouping them by file.
              ;; This is very useful when used with `org-tree-to-indirect-buffer'.
              (auto-indirect)
              (auto-file))
             ;; Group remaining buffers by whether they're file backed, then by mode.
             (group-not "*special*" (auto-file))
             (auto-mode))
            (group
             ;; Subgroup for OHS things
             (dir "~/Google Drive/OHS/")
             (dir "~/Google Drive/OHS/12th Grade/Classes/" 1)
             (dir "~/Google Drive/OHS/11th Grade/" 2)
             ;; Group remaining buffers by whether they're file backed, then by mode.
             (group-not "*special*" (auto-file))
             (auto-mode))
            (dir "/Volumes/" 1)
            (group
             ;; Subgroup collecting buffers in a projectile project.
             (auto-projectile))
            (group
             ;; Subgroup collecting buffers in a version-control project,
             ;; grouping them by directory.
             (auto-project))
            ;; Group remaining buffers by directory, then major mode.
            (auto-directory)
            (auto-mode))))
#+end_src

** Dired
#+begin_src emacs-lisp
  (setq delete-by-moving-to-trash t)
  (setq trash-directory "~/.Trash")
  (setq insert-directory-program "/bin/ls"
        dired-use-ls-dired t)
#+end_src

Make moving files easier between two split buffers.
#+begin_src emacs-lisp
  (setq dired-dwim-target t)
#+end_src

Remove print option to not accidentally print
#+begin_src emacs-lisp
  (define-key dired-mode-map (kbd "P") nil)
#+end_src

Custom dired open file function
#+begin_src emacs-lisp
  (define-key dired-mode-map (kbd "O") 'pgw/dired-open-file)
#+end_src

*** dired-quick-sort.el
#+begin_src emacs-lisp
  (use-package dired-quick-sort
    :load-path "custom_load"
    :config
    (dired-quick-sort-setup)
    )
#+end_src

*** Human readable format for ls switches (=-h=)
#+begin_src emacs-lisp
  (setq dired-listing-switches "-alh")
#+end_src

** Disabled Functions
Gotta sort this out later...
#+begin_src emacs-lisp
  (put 'upcase-region 'disabled nil)
  (put 'downcase-region 'disabled nil)
  (put 'scroll-left 'disabled nil)
  (put 'dired-find-alternate-file 'disabled nil)
  (put 'narrow-to-page 'disabled nil)
  (put 'narrow-to-region 'disabled nil)
  (put 'list-timers 'disabled nil)
#+end_src

