init.html

<div id="outline-container-org078583f" class="outline-4">
<h4 id="org078583f"><span class="section-number-4">4.35.2</span> Bufler - Alphapapa</h4>
<div class="outline-text-4" id="text-4-35-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">bufler</span>
  <span style="color: #1ea8fc;">:bind</span> ((<span style="color: #7984D1;">"C-x C-b"</span> . bufler)
         (<span style="color: #7984D1;">"C-x b"</span> . bufler-switch-buffer))
  <span style="color: #1ea8fc;">:config</span>
  (<span style="color: #ff2afc; font-weight: bold;">setf</span> bufler-groups
        (<span style="color: #ff2afc; font-weight: bold;">bufler-defgroups</span>
          (group
           <span style="color: #546A90;">;; </span><span style="color: #546A90;">Subgroup collecting all named workspaces.</span>
           (auto-workspace))
          (group
           <span style="color: #546A90;">;; </span><span style="color: #546A90;">Subgroup collecting all `</span><span style="color: #df85ff; font-weight: bold;">help-mode</span><span style="color: #546A90;">' and `</span><span style="color: #df85ff; font-weight: bold;">info-mode</span><span style="color: #546A90;">' buffers.</span>
           (group-or <span style="color: #7984D1;">"*Help/Info*"</span>
                     (mode-match <span style="color: #7984D1;">"*Help*"</span> (<span style="color: #ff2afc; font-weight: bold;">rx</span> bos <span style="color: #7984D1;">"help-"</span>))
                     (mode-match <span style="color: #7984D1;">"*Info*"</span> (<span style="color: #ff2afc; font-weight: bold;">rx</span> bos <span style="color: #7984D1;">"info-"</span>))))
          (group
           <span style="color: #546A90;">;; </span><span style="color: #546A90;">Subgroup collecting all special buffers (i.e. ones that are not</span>
           <span style="color: #546A90;">;; </span><span style="color: #546A90;">file-backed), except `</span><span style="color: #df85ff; font-weight: bold;">magit-status-mode</span><span style="color: #546A90;">' buffers (which are allowed to fall</span>
           <span style="color: #546A90;">;; </span><span style="color: #546A90;">through to other groups, so they end up grouped with their project buffers).</span>
           (group-and <span style="color: #7984D1;">"*Special*"</span>
                      (<span style="color: #ff2afc; font-weight: bold;">lambda</span> (buffer)
                        (<span style="color: #ff2afc; font-weight: bold;">unless</span> (<span style="color: #ff2afc; font-weight: bold;">or</span> (funcall (mode-match <span style="color: #7984D1;">"Magit"</span> (<span style="color: #ff2afc; font-weight: bold;">rx</span> bos <span style="color: #7984D1;">"magit-status"</span>))
                                             buffer)
                                    (funcall (mode-match <span style="color: #7984D1;">"Dired"</span> (<span style="color: #ff2afc; font-weight: bold;">rx</span> bos <span style="color: #7984D1;">"dired"</span>))
                                             buffer)
                                    (funcall (auto-file) buffer))
                          <span style="color: #7984D1;">"*Special*"</span>)))
           (group
            <span style="color: #546A90;">;; </span><span style="color: #546A90;">Subgroup collecting these "special special" buffers</span>
            <span style="color: #546A90;">;; </span><span style="color: #546A90;">separately for convenience.</span>
            (name-match <span style="color: #7984D1;">"**Special**"</span>
                        (<span style="color: #ff2afc; font-weight: bold;">rx</span> bos <span style="color: #7984D1;">"*"</span> (<span style="color: #ff2afc; font-weight: bold;">or</span> <span style="color: #7984D1;">"Messages"</span> <span style="color: #7984D1;">"Warnings"</span> <span style="color: #7984D1;">"scratch"</span> <span style="color: #7984D1;">"Backtrace"</span>) <span style="color: #7984D1;">"*"</span>)))
           (group
            <span style="color: #546A90;">;; </span><span style="color: #546A90;">Subgroup collecting all other Magit buffers, grouped by directory.</span>
            (mode-match <span style="color: #7984D1;">"*Magit* (non-status)"</span> (<span style="color: #ff2afc; font-weight: bold;">rx</span> bos (<span style="color: #ff2afc; font-weight: bold;">or</span> <span style="color: #7984D1;">"magit"</span> <span style="color: #7984D1;">"forge"</span>) <span style="color: #7984D1;">"-"</span>))
            (auto-directory))
           <span style="color: #546A90;">;; </span><span style="color: #546A90;">Remaining special buffers are grouped automatically by mode.</span>
           (auto-mode))
          <span style="color: #546A90;">;; </span><span style="color: #546A90;">All buffers under "~/.emacs.d" (or wherever it is).</span>
          (dir user-emacs-directory)
          (group
           <span style="color: #546A90;">;; </span><span style="color: #546A90;">Subgroup collecting buffers in `</span><span style="color: #df85ff; font-weight: bold;">org-directory</span><span style="color: #546A90;">' (or "~/org" if</span>
           <span style="color: #546A90;">;; </span><span style="color: #546A90;">`</span><span style="color: #df85ff; font-weight: bold;">org-directory</span><span style="color: #546A90;">' is not yet defined).</span>
           (dir (<span style="color: #ff2afc; font-weight: bold;">if</span> (<span style="color: #ff2afc; font-weight: bold;">bound-and-true-p</span> org-directory)
                    org-directory
                  <span style="color: #7984D1;">"~/org"</span>))
           (dir <span style="color: #7984D1;">"~/Dropbox/org/notes/"</span>)
           (dir <span style="color: #7984D1;">"~/Dropbox/org/notes/college/essays/"</span> 1)
           (group
            <span style="color: #546A90;">;; </span><span style="color: #546A90;">Subgroup collecting indirect Org buffers, grouping them by file.</span>
            <span style="color: #546A90;">;; </span><span style="color: #546A90;">This is very useful when used with `</span><span style="color: #df85ff; font-weight: bold;">org-tree-to-indirect-buffer</span><span style="color: #546A90;">'.</span>
            (auto-indirect)
            (auto-file))
           <span style="color: #546A90;">;; </span><span style="color: #546A90;">Group remaining buffers by whether they're file backed, then by mode.</span>
           (group-not <span style="color: #7984D1;">"*special*"</span> (auto-file))
           (auto-mode))
          (group
           <span style="color: #546A90;">;; </span><span style="color: #546A90;">Subgroup for OHS things</span>
           (dir <span style="color: #7984D1;">"~/Google Drive/OHS/"</span>)
           (dir <span style="color: #7984D1;">"~/Google Drive/OHS/12th Grade/Classes/"</span> 1)
           (dir <span style="color: #7984D1;">"~/Google Drive/OHS/11th Grade/"</span> 2)
           <span style="color: #546A90;">;; </span><span style="color: #546A90;">Group remaining buffers by whether they're file backed, then by mode.</span>
           (group-not <span style="color: #7984D1;">"*special*"</span> (auto-file))
           (auto-mode))
          (dir <span style="color: #7984D1;">"/Volumes/"</span> 1)
          (group
           <span style="color: #546A90;">;; </span><span style="color: #546A90;">Subgroup collecting buffers in a projectile project.</span>
           (auto-projectile))
          (group
           <span style="color: #546A90;">;; </span><span style="color: #546A90;">Subgroup collecting buffers in a version-control project,</span>
           <span style="color: #546A90;">;; </span><span style="color: #546A90;">grouping them by directory.</span>
           (auto-project))
          <span style="color: #546A90;">;; </span><span style="color: #546A90;">Group remaining buffers by directory, then major mode.</span>
          (auto-directory)
          (auto-mode))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgadbbf70" class="outline-3">
<h3 id="orgadbbf70"><span class="section-number-3">4.36</span> Dired</h3>
<div class="outline-text-3" id="text-4-36">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> delete-by-moving-to-trash t)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> trash-directory <span style="color: #7984D1;">"~/.Trash"</span>)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> insert-directory-program <span style="color: #7984D1;">"/usr/local/bin/gls"</span>
      dired-use-ls-dired t)
</pre>
</div>

<p>
Make moving files easier between two split buffers.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> dired-dwim-target t)
</pre>
</div>

<p>
Remove print option to not accidentally print
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-key dired-mode-map (kbd <span style="color: #7984D1;">"P"</span>) nil)
</pre>
</div>

<p>
Custom dired open file function
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-key dired-mode-map (kbd <span style="color: #7984D1;">"O"</span>) 'pgw/dired-open-file)
</pre>
</div>
</div>

<div id="outline-container-org9377561" class="outline-4">
<h4 id="org9377561"><span class="section-number-4">4.36.1</span> dired-quick-sort.el</h4>
<div class="outline-text-4" id="text-4-36-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">dired-quick-sort</span>
  <span style="color: #1ea8fc;">:load-path</span> <span style="color: #7984D1;">"custom_load"</span>
  <span style="color: #1ea8fc;">:config</span>
  (dired-quick-sort-setup)
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-org760911d" class="outline-4">
<h4 id="org760911d"><span class="section-number-4">4.36.2</span> Human readable format for ls switches (<code>-h</code>)</h4>
<div class="outline-text-4" id="text-4-36-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> dired-listing-switches <span style="color: #7984D1;">"-alh"</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb8dc275" class="outline-3">
<h3 id="orgb8dc275"><span class="section-number-3">4.37</span> Disabled Functions</h3>
<div class="outline-text-3" id="text-4-37">
<p>
Gotta sort this out later&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(put 'upcase-region 'disabled nil)
(put 'downcase-region 'disabled nil)
(put 'scroll-left 'disabled nil)
(put 'dired-find-alternate-file 'disabled nil)
(put 'narrow-to-page 'disabled nil)
(put 'narrow-to-region 'disabled nil)
(put 'list-timers 'disabled nil)
</pre>
</div>
</div>
</div>
