init.html

<div id="outline-container-orgd1cc7a5" class="outline-3">
<h3 id="orgd1cc7a5"><span class="section-number-3">4.38</span> browse-url-firefox-program</h3>
<div class="outline-text-3" id="text-4-38">
<p>
Allow the function <code>browse-url-firefox</code> to open links in firefox using bin. One could probably also accomplish this using <code>brew</code>'s version of firefox, but I didn't want to install firefox again.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">setq</span> browse-url-firefox-program <span style="color: #7984D1;">"/Applications/Firefox.app/Contents/MacOS/firefox-bin"</span>)
</pre>
</div>
</div>
</div>
