init.html

<div id="outline-container-org0daf975" class="outline-3">
<h3 id="org0daf975"><span class="section-number-3">4.39</span> mu4e</h3>
<div class="outline-text-3" id="text-4-39">
<p>
I love email in Emacs &lt;3
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">; </span><span style="color: #546A90;">add the source shipped with mu to load-path</span>
(add-to-list 'load-path (expand-file-name <span style="color: #7984D1;">"/usr/local/Cellar/mu/1.4.13/share/emacs/site-lisp/mu/mu4e/"</span>))

<span style="color: #546A90;">; </span><span style="color: #546A90;">require mu4e</span>
(<span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">mu4e</span>)

(<span style="color: #ff2afc; font-weight: bold;">setq</span> mu4e-maildir (expand-file-name <span style="color: #7984D1;">"~/Maildir"</span>))

<span style="color: #546A90;">; </span><span style="color: #546A90;">get mail</span>
(<span style="color: #ff2afc; font-weight: bold;">setq</span> mu4e-get-mail-command <span style="color: #7984D1;">"mbsync -c ~/.emacs.d/mu4e/.mbsyncrc -a"</span>
  <span style="color: #546A90;">;; </span><span style="color: #546A90;">mu4e-html2text-command "w3m -T text/html" ;;using the default mu4e-shr2text</span>
  mu4e-view-prefer-html t
  mu4e-update-interval 300
  mu4e-headers-auto-update t
  mu4e-compose-signature-auto-include nil
  mu4e-compose-format-flowed t)<span style="color: #546A90;">; </span><span style="color: #546A90;">tell mu4e to use w3m for html rendering</span>

<span style="color: #546A90;">;; </span><span style="color: #546A90;">don't save message to Sent Messages, Gmail/IMAP takes care of this</span>
(<span style="color: #ff2afc; font-weight: bold;">setq</span> mu4e-sent-messages-behavior 'delete)

<span style="color: #546A90;">;; </span><span style="color: #546A90;">enable inline images</span>
(<span style="color: #ff2afc; font-weight: bold;">setq</span> mu4e-view-show-images t)

<span style="color: #546A90;">;; </span><span style="color: #546A90;">from info manual</span>
(add-to-list 'mu4e-view-actions
             '(<span style="color: #7984D1;">"ViewInBrowser"</span> . mu4e-action-view-in-browser) t)


<span style="color: #546A90;">;; </span><span style="color: #546A90;">&lt;tab&gt; to navigate to links, &lt;RET&gt; to open them in browser</span>
(add-hook 'mu4e-view-mode-hook
          (<span style="color: #ff2afc; font-weight: bold;">lambda</span>()
            <span style="color: #546A90;">;; </span><span style="color: #546A90;">try to emulate some of the eww key-bindings</span>
            (local-set-key (kbd <span style="color: #7984D1;">"&lt;RET&gt;"</span>) 'mu4e~view-browse-url-from-binding)
            (local-set-key (kbd <span style="color: #7984D1;">"&lt;tab&gt;"</span>) 'shr-next-link)
            (local-set-key (kbd <span style="color: #7984D1;">"&lt;backtab&gt;"</span>) 'shr-previous-link)))

<span style="color: #546A90;">;; </span><span style="color: #546A90;">from https://www.reddit.com/r/emacs/comments/bfsck6/mu4e_for_dummies/elgoumx</span>
(add-hook 'mu4e-headers-mode-hook
      (<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">my/mu4e-change-headers</span> ()
        (<span style="color: #ff2afc; font-weight: bold;">interactive</span>)
        (<span style="color: #ff2afc; font-weight: bold;">setq</span> mu4e-headers-fields
              `((<span style="color: #1ea8fc;">:human-date</span> . 25) <span style="color: #546A90;">;; </span><span style="color: #546A90;">alternatively, use :date</span>
                (<span style="color: #1ea8fc;">:flags</span> . 6)
                (<span style="color: #1ea8fc;">:from</span> . 22)
                (<span style="color: #1ea8fc;">:thread-subject</span> . ,(- (window-body-width) 70)) <span style="color: #546A90;">;; </span><span style="color: #546A90;">alternatively, use :subject</span>
                (<span style="color: #1ea8fc;">:size</span> . 7)))))

<span style="color: #546A90;">;; </span><span style="color: #546A90;">if you use date instead of human-date in the above, use this setting</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">give me ISO(ish) format date-time stamps in the header list</span>
<span style="color: #546A90;">;</span><span style="color: #546A90;">(setq mu4e-headers-date-format "%Y-%m-%d %H:%M")</span>

<span style="color: #546A90;">;; </span><span style="color: #546A90;">spell check</span>
(add-hook 'mu4e-compose-mode-hook
(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">pgw/do-compose-stuff</span> ()
       <span style="color: #A875FF;">"My settings for message composition."</span>
       (visual-line-mode)
       (org-mu4e-compose-org-mode)
           (use-hard-newlines -1)
           (flyspell-mode)))

(add-hook 'mu4e-view-mode-hook #'visual-line-mode)

<span style="color: #546A90;">;; </span><span style="color: #546A90;">every new email composition gets its own frame!</span>
(<span style="color: #ff2afc; font-weight: bold;">setq</span> mu4e-compose-in-new-frame nil)

(<span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">smtpmail</span>)

<span style="color: #546A90;">;;</span><span style="color: #546A90;">rename files when moving</span>
<span style="color: #546A90;">;;</span><span style="color: #546A90;">NEEDED FOR MBSYNC</span>
(<span style="color: #ff2afc; font-weight: bold;">setq</span> mu4e-change-filenames-when-moving t)

<span style="color: #546A90;">;;</span><span style="color: #546A90;">set up queue for offline email</span>
<span style="color: #546A90;">;;</span><span style="color: #546A90;">use mu mkdir  ~/Maildir/acc/queue to set up first</span>
(<span style="color: #ff2afc; font-weight: bold;">setq</span> smtpmail-queue-mail nil)  <span style="color: #546A90;">;; </span><span style="color: #546A90;">start in normal mode</span>

<span style="color: #546A90;">;;</span><span style="color: #546A90;">from the info manual</span>
(<span style="color: #ff2afc; font-weight: bold;">setq</span> mu4e-attachment-dir  <span style="color: #7984D1;">"~/Documents"</span>)

(<span style="color: #ff2afc; font-weight: bold;">setq</span> message-kill-buffer-on-exit t)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> mu4e-compose-dont-reply-to-self t)

(<span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">org-mu4e</span>)

<span style="color: #546A90;">;; </span><span style="color: #546A90;">convert org mode to HTML automatically</span>
(<span style="color: #ff2afc; font-weight: bold;">setq</span> org-mu4e-convert-to-html t)

<span style="color: #546A90;">;;</span><span style="color: #546A90;">from vxlabs config</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">show full addresses in view message (instead of just names)</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">toggle per name with M-RET</span>
(<span style="color: #ff2afc; font-weight: bold;">setq</span> mu4e-view-show-addresses 't)

<span style="color: #546A90;">;; </span><span style="color: #546A90;">don't ask when quitting</span>
(<span style="color: #ff2afc; font-weight: bold;">setq</span> mu4e-confirm-quit nil)

<span style="color: #546A90;">;; </span><span style="color: #546A90;">mu4e-context</span>
(<span style="color: #ff2afc; font-weight: bold;">setq</span> mu4e-context-policy 'pick-first)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> mu4e-compose-context-policy 'always-ask)
(<span style="color: #ff2afc; font-weight: bold;">setq</span> mu4e-contexts
  (list
   (make-mu4e-context
    <span style="color: #1ea8fc;">:name</span> <span style="color: #7984D1;">"personal"</span> <span style="color: #546A90;">;;</span><span style="color: #546A90;">for pierce.g.wang</span>
    <span style="color: #1ea8fc;">:enter-func</span> (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (mu4e-message <span style="color: #7984D1;">"Entering context personal"</span>))
    <span style="color: #1ea8fc;">:leave-func</span> (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (mu4e-message <span style="color: #7984D1;">"Leaving context personal"</span>))
    <span style="color: #1ea8fc;">:match-func</span> (<span style="color: #ff2afc; font-weight: bold;">lambda</span> (msg)
                  (<span style="color: #ff2afc; font-weight: bold;">when</span> msg
                (mu4e-message-contact-field-matches
                 msg '(<span style="color: #1ea8fc;">:from</span> <span style="color: #1ea8fc;">:to</span> <span style="color: #1ea8fc;">:cc</span> <span style="color: #1ea8fc;">:bcc</span>) <span style="color: #7984D1;">"pierce.g.wang@gmail.com"</span>)))
    <span style="color: #1ea8fc;">:vars</span> '((user-mail-address . <span style="color: #7984D1;">"pierce.g.wang@gmail.com"</span>)
            (user-full-name . <span style="color: #7984D1;">"Pierce Wang"</span>)
            (mu4e-sent-folder . <span style="color: #7984D1;">"/pierce.g.wang/[pierce.g.wang].Sent Mail"</span>)
            (mu4e-drafts-folder . <span style="color: #7984D1;">"/pierce.g.wang/[pierce.g.wang].drafts"</span>)
            (mu4e-trash-folder . <span style="color: #7984D1;">"/pierce.g.wang/[pierce.g.wang].Trash"</span>)
            (mu4e-refile-folder . <span style="color: #7984D1;">"/pierce.g.wang/[pierce.g.wang].All Mail"</span>)
            (mu4e-compose-signature . (concat <span style="color: #7984D1;">"Formal Signature\n"</span> <span style="color: #7984D1;">"Emacs 27, org-mode 9, mu4e 1.14\n"</span>))
            (mu4e-compose-format-flowed . t)
            (smtpmail-queue-dir . <span style="color: #7984D1;">"~/Maildir/pierce.g.wang/queue/cur"</span>)
            (message-send-mail-function . smtpmail-send-it)
            (smtpmail-smtp-user . <span style="color: #7984D1;">"pierce.g.wang"</span>)
            (smtpmail-starttls-credentials . ((<span style="color: #7984D1;">"smtp.gmail.com"</span> 587 nil nil)))
            (smtpmail-auth-credentials . (expand-file-name <span style="color: #7984D1;">"~/.authinfo.gpg"</span>))
            (smtpmail-default-smtp-server . <span style="color: #7984D1;">"smtp.gmail.com"</span>)
            (smtpmail-smtp-server . <span style="color: #7984D1;">"smtp.gmail.com"</span>)
            (smtpmail-smtp-service . 587)
            (smtpmail-debug-info . t)
            (smtpmail-debug-verbose . t)
            (mu4e-maildir-shortcuts . ( (<span style="color: #7984D1;">"/pierce.g.wang/INBOX"</span>            . ?i)
                                        (<span style="color: #7984D1;">"/pierce.g.wang/[pierce.g.wang].Sent Mail"</span> . ?s)
                                        (<span style="color: #7984D1;">"/pierce.g.wang/[pierce.g.wang].Trash"</span>     . ?t)
                                        (<span style="color: #7984D1;">"/pierce.g.wang/[pierce.g.wang].All Mail"</span>  . ?a)
                                        (<span style="color: #7984D1;">"/pierce.g.wang/[pierce.g.wang].Starred"</span>   . ?r)
                                        (<span style="color: #7984D1;">"/pierce.g.wang/[pierce.g.wang].drafts"</span>    . ?d)
                                        ))))
   (make-mu4e-context
    <span style="color: #1ea8fc;">:name</span> <span style="color: #7984D1;">"OHS"</span> <span style="color: #546A90;">;;</span><span style="color: #546A90;">for pgwang@ohs.stanford.edu</span>
    <span style="color: #1ea8fc;">:enter-func</span> (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (mu4e-message <span style="color: #7984D1;">"Entering context, OHS"</span>))
    <span style="color: #1ea8fc;">:leave-func</span> (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (mu4e-message <span style="color: #7984D1;">"Leaving context, OHS"</span>))
    <span style="color: #1ea8fc;">:match-func</span> (<span style="color: #ff2afc; font-weight: bold;">lambda</span> (msg)
                  (<span style="color: #ff2afc; font-weight: bold;">when</span> msg
                (mu4e-message-contact-field-matches
                 msg '(<span style="color: #1ea8fc;">:from</span> <span style="color: #1ea8fc;">:to</span> <span style="color: #1ea8fc;">:cc</span> <span style="color: #1ea8fc;">:bcc</span>) <span style="color: #7984D1;">"pgwang@ohs.stanford.edu"</span>)))
    <span style="color: #1ea8fc;">:vars</span> '((user-mail-address . <span style="color: #7984D1;">"pgwang@ohs.stanford.edu"</span>)
            (user-full-name . <span style="color: #7984D1;">"Pierce Wang"</span>)
            (mu4e-sent-folder . <span style="color: #7984D1;">"/pierce.g.wang/[pierce.g.wang].Sent Mail"</span>)
            (mu4e-drafts-folder . <span style="color: #7984D1;">"/pierce.g.wang/[pierce.g.wang].drafts"</span>)
            (mu4e-trash-folder . <span style="color: #7984D1;">"/pierce.g.wang/[pierce.g.wang].Trash"</span>)
            (mu4e-refile-folder . <span style="color: #7984D1;">"/pierce.g.wang/[pierce.g.wang].All Mail"</span>)
            (mu4e-compose-signature . (concat <span style="color: #7984D1;">"Formal Signature\n"</span> <span style="color: #7984D1;">"Emacs 27, org-mode 9, mu4e 1.14\n"</span>))
            (mu4e-compose-format-flowed . t)
            (smtpmail-queue-dir . <span style="color: #7984D1;">"~/Maildir/pierce.g.wang/queue/cur"</span>)
            (message-send-mail-function . smtpmail-send-it)
            (smtpmail-smtp-user . <span style="color: #7984D1;">"pierce.g.wang"</span>)
            (smtpmail-starttls-credentials . ((<span style="color: #7984D1;">"smtp.gmail.com"</span> 587 nil nil)))
            (smtpmail-auth-credentials . (expand-file-name <span style="color: #7984D1;">"~/.authinfo.gpg"</span>))
            (smtpmail-default-smtp-server . <span style="color: #7984D1;">"smtp.gmail.com"</span>)
            (smtpmail-smtp-server . <span style="color: #7984D1;">"smtp.gmail.com"</span>)
            (smtpmail-smtp-service . 587)
            (smtpmail-debug-info . t)
            (smtpmail-debug-verbose . t)
            (mu4e-maildir-shortcuts . ( (<span style="color: #7984D1;">"/pierce.g.wang/INBOX"</span>            . ?i)
                                        (<span style="color: #7984D1;">"/pierce.g.wang/[pierce.g.wang].Sent Mail"</span> . ?s)
                                        (<span style="color: #7984D1;">"/pierce.g.wang/[pierce.g.wang].Trash"</span>     . ?t)
                                        (<span style="color: #7984D1;">"/pierce.g.wang/[pierce.g.wang].All Mail"</span>  . ?a)
                                        (<span style="color: #7984D1;">"/pierce.g.wang/[pierce.g.wang].Starred"</span>   . ?r)
                                        (<span style="color: #7984D1;">"/pierce.g.wang/[pierce.g.wang].drafts"</span>    . ?d)
                                        ))))
      (make-mu4e-context
       <span style="color: #1ea8fc;">:name</span> <span style="color: #7984D1;">"work"</span> <span style="color: #546A90;">;;</span><span style="color: #546A90;">for pierce.wang.violin</span>
       <span style="color: #1ea8fc;">:enter-func</span> (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (mu4e-message <span style="color: #7984D1;">"Entering context work"</span>))
       <span style="color: #1ea8fc;">:leave-func</span> (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (mu4e-message <span style="color: #7984D1;">"Leaving context work"</span>))
       <span style="color: #1ea8fc;">:match-func</span> (<span style="color: #ff2afc; font-weight: bold;">lambda</span> (msg)
                     (<span style="color: #ff2afc; font-weight: bold;">when</span> msg
                       (mu4e-message-contact-field-matches
                        msg '(<span style="color: #1ea8fc;">:from</span> <span style="color: #1ea8fc;">:to</span> <span style="color: #1ea8fc;">:cc</span> <span style="color: #1ea8fc;">:bcc</span>) <span style="color: #7984D1;">"pierce.wang.violin@gmail.com"</span>)))
       <span style="color: #1ea8fc;">:vars</span> '((user-mail-address . <span style="color: #7984D1;">"pierce.wang.violin@gmail.com"</span>)
               (user-full-name . <span style="color: #7984D1;">"Pierce Wang"</span>)
               (mu4e-sent-folder . <span style="color: #7984D1;">"/pierce.wang.violin/[pierce.wang.violin].Sent Mail"</span>)
               (mu4e-drafts-folder . <span style="color: #7984D1;">"/pierce.wang.violin/[pierce.wang.violin].drafts"</span>)
               (mu4e-trash-folder . <span style="color: #7984D1;">"/pierce.wang.violin/[pierce.wang.violin].Trash"</span>)
               (mu4e-refile-folder . <span style="color: #7984D1;">"/pierce.wang.violin/[pierce.wang.violin].All Mail"</span>)
               (mu4e-compose-signature . (concat <span style="color: #7984D1;">"Formal Signature\n"</span> <span style="color: #7984D1;">"Emacs 27, org-mode 9, mu4e 1.14\n"</span>))
               (mu4e-compose-format-flowed . t)
               (smtpmail-queue-dir . <span style="color: #7984D1;">"~/Maildir/pierce.wang.violin/queue/cur"</span>)
               (message-send-mail-function . smtpmail-send-it)
               (smtpmail-smtp-user . <span style="color: #7984D1;">"pierce.wang.violin"</span>)
               (smtpmail-starttls-credentials . ((<span style="color: #7984D1;">"smtp.gmail.com"</span> 587 nil nil)))
               (smtpmail-auth-credentials . (expand-file-name <span style="color: #7984D1;">"~/.authinfo.gpg"</span>))
               (smtpmail-default-smtp-server . <span style="color: #7984D1;">"smtp.gmail.com"</span>)
               (smtpmail-smtp-server . <span style="color: #7984D1;">"smtp.gmail.com"</span>)
               (smtpmail-smtp-service . 587)
               (smtpmail-debug-info . t)
               (smtpmail-debug-verbose . t)
               (mu4e-maildir-shortcuts . ( (<span style="color: #7984D1;">"/pierce.wang.violin/INBOX"</span>            . ?i)
                                           (<span style="color: #7984D1;">"/pierce.wang.violin/[pierce.wang.violin].Sent Mail"</span> . ?s)
                                           (<span style="color: #7984D1;">"/pierce.wang.violin/[pierce.wang.violin].Trash"</span>     . ?t)
                                           (<span style="color: #7984D1;">"/pierce.wang.violin/[pierce.wang.violin].All Mail"</span>  . ?a)
                                           (<span style="color: #7984D1;">"/pierce.wang.violin/[pierce.wang.violin].Starred"</span>   . ?r)
                                           (<span style="color: #7984D1;">"/pierce.wang.violin/[pierce.wang.violin].drafts"</span>    . ?d)
                                           ))))
      ))
</pre>
</div>
</div>
