init.org
*** mu4e-alert
#+begin_src emacs-lisp :tangle no
  (use-package mu4e-alert
    :ensure t
    :after mu4e
    :init
    (setq mu4e-alert-interesting-mail-query
          (concat
           "flag:unread maildir:/pierce.wang.violin/INBOX "
           "OR "
           "flag:unread maildir:/pierce.g.wang/INBOX"
           ))
    (mu4e-alert-set-default-style 'notifier)
    (add-hook 'after-init-hook #'mu4e-alert-enable-notifications)
    (add-hook 'after-init-hook #'mu4e-alert-enable-mode-line-display)
    (defun pgw/fetch-mail-and-mu4e ()
      (interactive)
      (if (internet-up-p)
          (mu4e-update-mail-and-index t))
      )
    ;; (run-with-timer 60 300 'pgw/fetch-mail-and-mu4e)
    )
#+end_src

*** mu4e keybinds                                                :keybinds:
Unset default compose message and set personal keybinds.

#+begin_src emacs-lisp :tangle no
  (global-unset-key (kbd "C-x m"))
  (global-set-key (kbd "C-x m n") (lambda () "Open mu4e in a new frame" (interactive) (make-frame '((name . "Mail: mu4e"))) (mu4e)))
  (global-set-key (kbd "C-x m b") (lambda () "Open mu4e in the background" (interactive) (mu4e t)))
  (global-set-key (kbd "C-x m m") 'mu4e)
  (global-set-key (kbd "C-x m c") 'mu4e-compose-new)
#+end_src

** OHS
*** DISABLED Schoolyear Calculation for sexp Diary Entries        :ARCHIVE:
CLOSED: [2020-11-29 Sun 11:41]

Attempt two: macro to make and statements
#+begin_src emacs-lisp :tangle no
  (defun pgw/ohs-schoolyear-class-sched (date event days time)
    (let ((dayname (calendar-day-of-week date)))
      (when (and (if (equal days 1)
                     (or (memq dayname '(1 3))
                         (diary-date 2021 1 22)) ;; Monday on Friday (MLK Makeup)
                   (memq dayname '(2 4)))
                 (diary-block 2020 8 19 2021 5 13)) ;; Class Period
        (when (not (or (diary-date 2020 9 7) ;; Labor Day
                       (diary-date 2020 9 11) ;; Back to School Night
                       (diary-block 2020 10 28 2020 10 30) ;; Parent-Teacher Conferences (no classes)
                       (diary-block 2020 11 25 2020 11 27) ;; Thanksgiving Holiday
                       (diary-block 2020 12 9 2020 12 11) ;; Study Days (no classes)
                       (diary-block 2020 12 14 2020 12 19) ;; Fall Semester Finals
                       (diary-block 2020 12 19 2021 1 3) ;; Winter Closure
                       (diary-block 2021 1 4 2021 1 8) ;; Reading Week
                       (diary-date 2021 1 18) ;; MLK Holiday
                       (diary-date 2021 2 15) ;; Presidents Day
                       (diary-date 2021 2 16) ;; Reading Day (No classes)
                       (diary-block 2021 3 22 2021 3 26) ;; Spring Break
                       (diary-block 2021 5 17 2021 5 19) ;; Study Days
                       (diary-block 2021 5 20 2021 5 21) ;; Spring Semester Finals
                       (diary-block 2021 5 24 2021 5 27) ;; Spring Semester Finals
                       (diary-date 2021 5 31))) ;; Memorial Day Holiday
          (format "%s %s" time event)))))
#+end_src

