init.html

<div id="outline-container-org229abe1" class="outline-4">
<h4 id="org229abe1"><span class="section-number-4">4.39.1</span> mu4e-alert</h4>
<div class="outline-text-4" id="text-4-39-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">mu4e-alert</span>
  <span style="color: #1ea8fc;">:ensure</span> t
  <span style="color: #1ea8fc;">:after</span> mu4e
  <span style="color: #1ea8fc;">:init</span>
  (<span style="color: #ff2afc; font-weight: bold;">setq</span> mu4e-alert-interesting-mail-query
        (concat
         <span style="color: #7984D1;">"flag:unread maildir:/pierce.wang.violin/INBOX "</span>
         <span style="color: #7984D1;">"OR "</span>
         <span style="color: #7984D1;">"flag:unread maildir:/pierce.g.wang/INBOX"</span>
         ))
  (mu4e-alert-set-default-style 'notifier)
  (add-hook 'after-init-hook #'mu4e-alert-enable-notifications)
  (add-hook 'after-init-hook #'mu4e-alert-enable-mode-line-display)
  (<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">pgw/fetch-mail-and-mu4e</span> ()
    (<span style="color: #ff2afc; font-weight: bold;">interactive</span>)
    (<span style="color: #ff2afc; font-weight: bold;">if</span> (internet-up-p)
        (mu4e-update-mail-and-index t))
    )
  <span style="color: #546A90;">;; </span><span style="color: #546A90;">(run-with-timer 60 300 'pgw/fetch-mail-and-mu4e)</span>
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-orgade4b2d" class="outline-4">
<h4 id="orgade4b2d"><span class="section-number-4">4.39.2</span> mu4e keybinds&#xa0;&#xa0;&#xa0;<span class="tag"><span class="keybinds">keybinds</span></span></h4>
<div class="outline-text-4" id="text-4-39-2">
<p>
Unset default compose message and set personal keybinds.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-unset-key (kbd <span style="color: #7984D1;">"C-x m"</span>))
(global-set-key (kbd <span style="color: #7984D1;">"C-x m n"</span>) (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () <span style="color: #A875FF;">"Open mu4e in a new frame"</span> (<span style="color: #ff2afc; font-weight: bold;">interactive</span>) (make-frame '((name . <span style="color: #7984D1;">"Mail: mu4e"</span>))) (mu4e)))
(global-set-key (kbd <span style="color: #7984D1;">"C-x m b"</span>) (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () <span style="color: #A875FF;">"Open mu4e in the background"</span> (<span style="color: #ff2afc; font-weight: bold;">interactive</span>) (mu4e t)))
(global-set-key (kbd <span style="color: #7984D1;">"C-x m m"</span>) 'mu4e)
(global-set-key (kbd <span style="color: #7984D1;">"C-x m c"</span>) 'mu4e-compose-new)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org413ec7d" class="outline-3">
<h3 id="org413ec7d"><span class="section-number-3">4.40</span> OHS</h3>
<div class="outline-text-3" id="text-4-40">
</div>
<div id="outline-container-orgc7427f2" class="outline-4">
<h4 id="orgc7427f2"><span class="section-number-4">4.40.1</span> <span class="done DISABLED">DISABLED</span> Schoolyear Calculation for sexp Diary Entries&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ARCHIVE">ARCHIVE</span></span></h4>
</div>
