init.org
*** Generate OHS Class Calendar

This is super messy, any tips on making this kind of code cleaner?

The identified problem was that in general, for class schedules, I've used a repeating event. However, repeating events (in =org-mode= or otherwise) are not holiday-aware. So, the point of this code is to generate a list of scheduled org headlines for all of my classes which is 100% accurate and does not put classes on holidays or no-class study week days.

#+begin_src emacs-lisp :results silent
  (defun pgw/date-block (absolute y1 m1 d1 y2 m2 d2)
    "Block date entry. An adapted version of the `diary-block'
  function from the diary-lib."
    (let ((date1 (calendar-absolute-from-gregorian
                  (diary-make-date y1 m1 d1)))
          (date2 (calendar-absolute-from-gregorian
                  (diary-make-date y2 m2 d2)))
          (d absolute))
      (and (<= date1 d) (<= d date2))))

  (defun pgw/date-date (absolute year month day)
    "Check for equality of date"
    (equal absolute (calendar-absolute-from-gregorian (diary-make-date year month day))))

  (defun pgw/check-ohs-class (absolute classname semesters days times fallstart fallend springstart mononfri springend holidays noclasses)
    "Returns a list with formatted strings: (classname curdate
  headline). These can then be used to create the headline. The curdate
  is in the form of a list"
    (let* ((dayname (calendar-day-of-week (calendar-gregorian-from-absolute absolute)))
           (curdate (calendar-gregorian-from-absolute absolute))
           (periods '("06:00-07:15"
                      "07:15-08:30"
                      "08:30-09:45"
                      "09:45-11:00"
                      "11:00-12:15"
                      "12:15-13:30"
                      "13:30-14:45"
                      "14:45-16:00"
                      "16:00-17:15"
                      "17:15-18:30"
                      "18:30-19:45"
                      "19:45-21:00"
                      "21:00-22:15"))
           (time (if (equal (type-of times) 'integer) ;; Checks if the times argument is an integer or list of times as strings
                     (nth (1- times) periods)
                 (nth (- (length days) (length (memq dayname days))) times))))
      (when (and (cond ((equal days '(1 3)) (or (memq dayname '(1 3)) (pgw/date-date absolute (nth 0 mononfri) (nth 1 mononfri) (nth 2 mononfri)))) ;; Account for MLK Monday on Friday
                       (t (memq dayname days)))
                 (or (if (memq 1 semesters) (pgw/date-block absolute (nth 0 fallstart) (nth 1 fallstart) (nth 2 fallstart)
                                                           (nth 0 fallend) (nth 1 fallend) (nth 2 fallend)))
                     (if (memq 2 semesters) (pgw/date-block absolute (nth 0 springstart) (nth 1 springstart) (nth 2 springstart)
                                                            (nth 0 springend) (nth 1 springend) (nth 2 springend)))))
        (if (equal (type-of times) 'integer) ;; Classes will always be in periods, OH and other events will not
            (when (and (not (memq 't
                                  (mapcar (lambda (holiday) (if (> (length holiday) 3)
                                                                (pgw/date-block absolute (nth 0 holiday) (nth 1 holiday) (nth 2 holiday) (nth 3 holiday) (nth 4 holiday) (nth 5 holiday))
                                                              (pgw/date-date absolute (nth 0 holiday) (nth 1 holiday) (nth 2 holiday))))
                                          holidays)))
                       (not (memq 't
                                  (mapcar (lambda (noclass) (if (> (length noclass) 3)
                                                                (pgw/date-block absolute (nth 0 noclass) (nth 1 noclass) (nth 2 noclass) (nth 3 noclass) (nth 4 noclass) (nth 5 noclass))
                                                              (pgw/date-date absolute (nth 0 noclass) (nth 1 noclass) (nth 2 noclass))))
                                          noclasses))))
              (list classname curdate time))
          (when (not (memq 't
                           (mapcar (lambda (holiday) (if (> (length holiday) 3)
                                                         (pgw/date-block absolute (nth 0 holiday) (nth 1 holiday) (nth 2 holiday) (nth 3 holiday) (nth 4 holiday) (nth 5 holiday))
                                                       (pgw/date-date absolute (nth 0 holiday) (nth 1 holiday) (nth 2 holiday))))
                                   holidays)))
            (list classname curdate time))))))

  (defun pgw/create-entry (classname semesters days times &optional desc)
    "Creates headlines for class schedule.
  CLASSNAME: a string with the class name (to appear on agenda)
  SEMESTERS: a list of integers. e.g. for both just a first semester:
  '(1) or for both semesters '(1 2)
  DAYS: the days of the class. Normally it will be M/W or T/Th but in
  order to have flexibility, the function takes an input of another list
  of integers representing days of the week. Monday starts on 1 and
  Sunday is 0
  TIMES: Either an integer with the period number or a cons list
  containing a list of the times which should be the same length as the
  list of days

  optional DESC: string containing a description for the event

  This function uses the variable `pgw/ohs-schoolyear-dates' for the value of holidays"
    (let ((current (calendar-absolute-from-gregorian (diary-make-date 2020 8 19)))
          (desc (if desc (setq desc (format "\n%s\n" desc)) (setq desc "")))
          (fallstart (gethash "fallstart" pgw/ohs-schoolyear-dates))
          (fallend (gethash "fallend" pgw/ohs-schoolyear-dates))
          (springstart (gethash "springstart" pgw/ohs-schoolyear-dates))
          (mononfri (gethash "mononfri" pgw/ohs-schoolyear-dates))
          (springend (gethash "springend" pgw/ohs-schoolyear-dates))
          (holidays (gethash "holidays" pgw/ohs-schoolyear-dates))
          (noclasses (gethash "noclasses" pgw/ohs-schoolyear-dates)))
      (goto-char (point-max))
      (insert (format "\n* %s" classname))
      (while (pgw/date-block current (nth 0 fallstart) (nth 1 fallstart) (nth 2 fallstart)
                             (nth 0 springend) (nth 1 springend) (nth 2 springend)) ; Make sure we're within starting and ending dates of school
        (let ((info (pgw/check-ohs-class current classname semesters days times fallstart fallend springstart mononfri springend holidays noclasses)))
          (when info
            (let* ((headline (nth 0 info))
                   (days-of-week '("Sun" "Mon" "Tue" "Wed" "Thu" "Fri" "Sat"))
                   (fulldate (nth 1 info))
                   (year (nth 2 fulldate))
                   (month (nth 0 fulldate))
                   (day (nth 1 fulldate))
                   (dayofweek (nth (calendar-day-of-week fulldate) days-of-week))
                   (time (nth 2 info)))
              (goto-char (point-max))
              ;; (insert (format "\n** %s\n:PROPERTIES:\n:TIMEZONE: UTC\n:END:\n<%d-%02d-%02d %s %s>\n%s"
              ;;                 headline year month day dayofweek time desc)))))
              (insert (format "\n** %s\n<%d-%02d-%02d %s %s>\n%s"
                              headline year month day dayofweek time desc)))))
        (setq current (+ current 1)))))

  (setq pgw/ohs-schoolyear-dates
        #s(hash-table
           size 7
           test equal
           data ("fallstart" (2020 8 19)
                 "fallend" (2020 12 19)
                 "springstart" (2021 1 4)
                 "mononfri" (2021 1 19)
                 "springend" (2021 5 13)
                 "holidays" ((2020 9 7 2020 9 8) ;; Labor Day
                             (2020 11 25 2020 11 27) ;; Thanksgiving Holiday
                             (2020 12 19 2021 1 3) ;; Winter Closure
                             (2021 1 18 2021 1 19) ;; MLK Holiday
                             (2021 2 15) ;; Presidents Day
                             (2021 2 16) ;; Reading Day (No classes)
                             (2021 3 22 2021 3 26) ;; Spring Break
                             (2021 5 31 2021 6 1)) ;; Memorial Day Holiday
                 "noclasses" ((2020 10 28 2020 10 30) ;; Parent-Teacher Conferences (no classes)
                              (2020 12 9 2020 12 11) ;; Study Days (no classes)
                              (2020 12 14 2020 12 19) ;; Fall Semester Finals
                              (2021 1 4 2021 1 8) ;; Reading Week
                              (2021 5 17 2021 5 19) ;; Study Days
                              (2021 5 20 2021 5 21) ;; Spring Semester Finals
                              (2021 5 24 2021 5 27) ;; Spring Semester Finals
                              ))))
#+end_src

Example usage (run in a dedicated file)
#+begin_src emacs-lisp :tangle no
  (pgw/create-entry "UM51A: Linear Algebra" '(1 2) '(1 3) 3 "Adobe connect class link")
#+end_src

