init.html

<div id="outline-container-orgca26908" class="outline-4">
<h4 id="orgca26908"><span class="section-number-4">4.40.2</span> Generate OHS Class Calendar</h4>
<div class="outline-text-4" id="text-4-40-2">
<p>
This is super messy, any tips on making this kind of code cleaner?
</p>

<p>
The identified problem was that in general, for class schedules, I've used a repeating event. However, repeating events (in <code>org-mode</code> or otherwise) are not holiday-aware. So, the point of this code is to generate a list of scheduled org headlines for all of my classes which is 100% accurate and does not put classes on holidays or no-class study week days.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">pgw/date-block</span> (absolute y1 m1 d1 y2 m2 d2)
  <span style="color: #A875FF;">"Block date entry. An adapted version of the `</span><span style="color: #df85ff; font-weight: bold;">diary-block</span><span style="color: #A875FF;">'</span>
<span style="color: #A875FF;">function from the diary-lib."</span>
  (<span style="color: #ff2afc; font-weight: bold;">let</span> ((date1 (calendar-absolute-from-gregorian
                (diary-make-date y1 m1 d1)))
        (date2 (calendar-absolute-from-gregorian
                (diary-make-date y2 m2 d2)))
        (d absolute))
    (<span style="color: #ff2afc; font-weight: bold;">and</span> (&lt;= date1 d) (&lt;= d date2))))

(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">pgw/date-date</span> (absolute year month day)
  <span style="color: #A875FF;">"Check for equality of date"</span>
  (equal absolute (calendar-absolute-from-gregorian (diary-make-date year month day))))

(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">pgw/check-ohs-class</span> (absolute classname semesters days times fallstart fallend springstart mononfri springend holidays noclasses)
  <span style="color: #A875FF;">"Returns a list with formatted strings: (classname curdate</span>
<span style="color: #A875FF;">headline). These can then be used to create the headline. The curdate</span>
<span style="color: #A875FF;">is in the form of a list"</span>
  (<span style="color: #ff2afc; font-weight: bold;">let*</span> ((dayname (calendar-day-of-week (calendar-gregorian-from-absolute absolute)))
         (curdate (calendar-gregorian-from-absolute absolute))
         (periods '(<span style="color: #7984D1;">"06:00-07:15"</span>
                    <span style="color: #7984D1;">"07:15-08:30"</span>
                    <span style="color: #7984D1;">"08:30-09:45"</span>
                    <span style="color: #7984D1;">"09:45-11:00"</span>
                    <span style="color: #7984D1;">"11:00-12:15"</span>
                    <span style="color: #7984D1;">"12:15-13:30"</span>
                    <span style="color: #7984D1;">"13:30-14:45"</span>
                    <span style="color: #7984D1;">"14:45-16:00"</span>
                    <span style="color: #7984D1;">"16:00-17:15"</span>
                    <span style="color: #7984D1;">"17:15-18:30"</span>
                    <span style="color: #7984D1;">"18:30-19:45"</span>
                    <span style="color: #7984D1;">"19:45-21:00"</span>
                    <span style="color: #7984D1;">"21:00-22:15"</span>))
         (time (<span style="color: #ff2afc; font-weight: bold;">if</span> (equal (type-of times) 'integer) <span style="color: #546A90;">;; </span><span style="color: #546A90;">Checks if the times argument is an integer or list of times as strings</span>
                   (nth (1- times) periods)
               (nth (- (length days) (length (memq dayname days))) times))))
    (<span style="color: #ff2afc; font-weight: bold;">when</span> (<span style="color: #ff2afc; font-weight: bold;">and</span> (<span style="color: #ff2afc; font-weight: bold;">cond</span> ((equal days '(1 3)) (<span style="color: #ff2afc; font-weight: bold;">or</span> (memq dayname '(1 3)) (pgw/date-date absolute (nth 0 mononfri) (nth 1 mononfri) (nth 2 mononfri)))) <span style="color: #546A90;">;; </span><span style="color: #546A90;">Account for MLK Monday on Friday</span>
                     (t (memq dayname days)))
               (<span style="color: #ff2afc; font-weight: bold;">or</span> (<span style="color: #ff2afc; font-weight: bold;">if</span> (memq 1 semesters) (pgw/date-block absolute (nth 0 fallstart) (nth 1 fallstart) (nth 2 fallstart)
                                                         (nth 0 fallend) (nth 1 fallend) (nth 2 fallend)))
                   (<span style="color: #ff2afc; font-weight: bold;">if</span> (memq 2 semesters) (pgw/date-block absolute (nth 0 springstart) (nth 1 springstart) (nth 2 springstart)
                                                          (nth 0 springend) (nth 1 springend) (nth 2 springend)))))
      (<span style="color: #ff2afc; font-weight: bold;">if</span> (equal (type-of times) 'integer) <span style="color: #546A90;">;; </span><span style="color: #546A90;">Classes will always be in periods, OH and other events will not</span>
          (<span style="color: #ff2afc; font-weight: bold;">when</span> (<span style="color: #ff2afc; font-weight: bold;">and</span> (not (memq 't
                                (mapcar (<span style="color: #ff2afc; font-weight: bold;">lambda</span> (holiday) (<span style="color: #ff2afc; font-weight: bold;">if</span> (&gt; (length holiday) 3)
                                                              (pgw/date-block absolute (nth 0 holiday) (nth 1 holiday) (nth 2 holiday) (nth 3 holiday) (nth 4 holiday) (nth 5 holiday))
                                                            (pgw/date-date absolute (nth 0 holiday) (nth 1 holiday) (nth 2 holiday))))
                                        holidays)))
                     (not (memq 't
                                (mapcar (<span style="color: #ff2afc; font-weight: bold;">lambda</span> (noclass) (<span style="color: #ff2afc; font-weight: bold;">if</span> (&gt; (length noclass) 3)
                                                              (pgw/date-block absolute (nth 0 noclass) (nth 1 noclass) (nth 2 noclass) (nth 3 noclass) (nth 4 noclass) (nth 5 noclass))
                                                            (pgw/date-date absolute (nth 0 noclass) (nth 1 noclass) (nth 2 noclass))))
                                        noclasses))))
            (list classname curdate time))
        (<span style="color: #ff2afc; font-weight: bold;">when</span> (not (memq 't
                         (mapcar (<span style="color: #ff2afc; font-weight: bold;">lambda</span> (holiday) (<span style="color: #ff2afc; font-weight: bold;">if</span> (&gt; (length holiday) 3)
                                                       (pgw/date-block absolute (nth 0 holiday) (nth 1 holiday) (nth 2 holiday) (nth 3 holiday) (nth 4 holiday) (nth 5 holiday))
                                                     (pgw/date-date absolute (nth 0 holiday) (nth 1 holiday) (nth 2 holiday))))
                                 holidays)))
          (list classname curdate time))))))

(<span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff; font-weight: bold;">pgw/create-entry</span> (classname semesters days times <span style="color: #ffd400;">&amp;optional</span> desc)
  <span style="color: #A875FF;">"Creates headlines for class schedule.</span>
<span style="color: #A875FF;">CLASSNAME: a string with the class name (to appear on agenda)</span>
<span style="color: #A875FF;">SEMESTERS: a list of integers. e.g. for both just a first semester:</span>
<span style="color: #A875FF;">'(1) or for both semesters '(1 2)</span>
<span style="color: #A875FF;">DAYS: the days of the class. Normally it will be M/W or T/Th but in</span>
<span style="color: #A875FF;">order to have flexibility, the function takes an input of another list</span>
<span style="color: #A875FF;">of integers representing days of the week. Monday starts on 1 and</span>
<span style="color: #A875FF;">Sunday is 0</span>
<span style="color: #A875FF;">TIMES: Either an integer with the period number or a cons list</span>
<span style="color: #A875FF;">containing a list of the times which should be the same length as the</span>
<span style="color: #A875FF;">list of days</span>

<span style="color: #A875FF;">optional DESC: string containing a description for the event</span>

<span style="color: #A875FF;">This function uses the variable `</span><span style="color: #df85ff; font-weight: bold;">pgw/ohs-schoolyear-dates</span><span style="color: #A875FF;">' for the value of holidays"</span>
  (<span style="color: #ff2afc; font-weight: bold;">let</span> ((current (calendar-absolute-from-gregorian (diary-make-date 2020 8 19)))
        (desc (<span style="color: #ff2afc; font-weight: bold;">if</span> desc (<span style="color: #ff2afc; font-weight: bold;">setq</span> desc (format <span style="color: #7984D1;">"\n%s\n"</span> desc)) (<span style="color: #ff2afc; font-weight: bold;">setq</span> desc <span style="color: #7984D1;">""</span>)))
        (fallstart (gethash <span style="color: #7984D1;">"fallstart"</span> pgw/ohs-schoolyear-dates))
        (fallend (gethash <span style="color: #7984D1;">"fallend"</span> pgw/ohs-schoolyear-dates))
        (springstart (gethash <span style="color: #7984D1;">"springstart"</span> pgw/ohs-schoolyear-dates))
        (mononfri (gethash <span style="color: #7984D1;">"mononfri"</span> pgw/ohs-schoolyear-dates))
        (springend (gethash <span style="color: #7984D1;">"springend"</span> pgw/ohs-schoolyear-dates))
        (holidays (gethash <span style="color: #7984D1;">"holidays"</span> pgw/ohs-schoolyear-dates))
        (noclasses (gethash <span style="color: #7984D1;">"noclasses"</span> pgw/ohs-schoolyear-dates)))
    (goto-char (point-max))
    (insert (format <span style="color: #7984D1;">"\n* %s"</span> classname))
    (<span style="color: #ff2afc; font-weight: bold;">while</span> (pgw/date-block current (nth 0 fallstart) (nth 1 fallstart) (nth 2 fallstart)
                           (nth 0 springend) (nth 1 springend) (nth 2 springend)) <span style="color: #546A90;">; </span><span style="color: #546A90;">Make sure we're within starting and ending dates of school</span>
      (<span style="color: #ff2afc; font-weight: bold;">let</span> ((info (pgw/check-ohs-class current classname semesters days times fallstart fallend springstart mononfri springend holidays noclasses)))
        (<span style="color: #ff2afc; font-weight: bold;">when</span> info
          (<span style="color: #ff2afc; font-weight: bold;">let*</span> ((headline (nth 0 info))
                 (days-of-week '(<span style="color: #7984D1;">"Sun"</span> <span style="color: #7984D1;">"Mon"</span> <span style="color: #7984D1;">"Tue"</span> <span style="color: #7984D1;">"Wed"</span> <span style="color: #7984D1;">"Thu"</span> <span style="color: #7984D1;">"Fri"</span> <span style="color: #7984D1;">"Sat"</span>))
                 (fulldate (nth 1 info))
                 (year (nth 2 fulldate))
                 (month (nth 0 fulldate))
                 (day (nth 1 fulldate))
                 (dayofweek (nth (calendar-day-of-week fulldate) days-of-week))
                 (time (nth 2 info)))
            (goto-char (point-max))
            <span style="color: #546A90;">;; </span><span style="color: #546A90;">(insert (format "\n** %s\n:PROPERTIES:\n:TIMEZONE: UTC\n:END:\n&lt;%d-%02d-%02d %s %s&gt;\n%s"</span>
            <span style="color: #546A90;">;;                 </span><span style="color: #546A90;">headline year month day dayofweek time desc)))))</span>
            (insert (format <span style="color: #7984D1;">"\n** %s\n&lt;%d-%02d-%02d %s %s&gt;\n%s"</span>
                            headline year month day dayofweek time desc)))))
      (<span style="color: #ff2afc; font-weight: bold;">setq</span> current (+ current 1)))))

(<span style="color: #ff2afc; font-weight: bold;">setq</span> pgw/ohs-schoolyear-dates
      #s(hash-table
         size 7
         test equal
         data (<span style="color: #7984D1;">"fallstart"</span> (2020 8 19)
               <span style="color: #7984D1;">"fallend"</span> (2020 12 19)
               <span style="color: #7984D1;">"springstart"</span> (2021 1 4)
               <span style="color: #7984D1;">"mononfri"</span> (2021 1 19)
               <span style="color: #7984D1;">"springend"</span> (2021 5 13)
               <span style="color: #7984D1;">"holidays"</span> ((2020 9 7 2020 9 8) <span style="color: #546A90;">;; </span><span style="color: #546A90;">Labor Day</span>
                           (2020 11 25 2020 11 27) <span style="color: #546A90;">;; </span><span style="color: #546A90;">Thanksgiving Holiday</span>
                           (2020 12 19 2021 1 3) <span style="color: #546A90;">;; </span><span style="color: #546A90;">Winter Closure</span>
                           (2021 1 18 2021 1 19) <span style="color: #546A90;">;; </span><span style="color: #546A90;">MLK Holiday</span>
                           (2021 2 15) <span style="color: #546A90;">;; </span><span style="color: #546A90;">Presidents Day</span>
                           (2021 2 16) <span style="color: #546A90;">;; </span><span style="color: #546A90;">Reading Day (No classes)</span>
                           (2021 3 22 2021 3 26) <span style="color: #546A90;">;; </span><span style="color: #546A90;">Spring Break</span>
                           (2021 5 31 2021 6 1)) <span style="color: #546A90;">;; </span><span style="color: #546A90;">Memorial Day Holiday</span>
               <span style="color: #7984D1;">"noclasses"</span> ((2020 10 28 2020 10 30) <span style="color: #546A90;">;; </span><span style="color: #546A90;">Parent-Teacher Conferences (no classes)</span>
                            (2020 12 9 2020 12 11) <span style="color: #546A90;">;; </span><span style="color: #546A90;">Study Days (no classes)</span>
                            (2020 12 14 2020 12 19) <span style="color: #546A90;">;; </span><span style="color: #546A90;">Fall Semester Finals</span>
                            (2021 1 4 2021 1 8) <span style="color: #546A90;">;; </span><span style="color: #546A90;">Reading Week</span>
                            (2021 5 17 2021 5 19) <span style="color: #546A90;">;; </span><span style="color: #546A90;">Study Days</span>
                            (2021 5 20 2021 5 21) <span style="color: #546A90;">;; </span><span style="color: #546A90;">Spring Semester Finals</span>
                            (2021 5 24 2021 5 27) <span style="color: #546A90;">;; </span><span style="color: #546A90;">Spring Semester Finals</span>
                            ))))
</pre>
</div>

<p>
Example usage (run in a dedicated file)
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(pgw/create-entry <span style="color: #7984D1;">"UM51A: Linear Algebra"</span> '(1 2) '(1 3) 3 <span style="color: #7984D1;">"Adobe connect class link"</span>)
</pre>
</div>
</div>
</div>
