init.org
*** Sync gcal Bash Script

This runs a bash script which in turn
1. curls the calendar file from the Canvas website
2. runs a python program which parses the calendar file into =ohs_gcal.org= according to the class. In doing so, it takes into account whether the timestamp should be a deadline or not.

See [[https://github.com/piercegwang/ohsics_to_org][https://github.com/piercegwang/ohsics_to_org]] for more info.
#+begin_src emacs-lisp :results silent
  (defun pgw/sync-ohs-cal ()
    (interactive)
    (start-process-shell-command "Running ~/QScripts/syncgcal.sh" nil "bash ~/QScripts/syncgcal.sh"))

  (global-set-key (kbd "C-c s-g o") 'pgw/sync-ohs-cal)
#+end_src

