init.html

<div id="outline-container-org140546a" class="outline-4">
<h4 id="org140546a"><span class="section-number-4">4.40.3</span> Sync gcal Bash Script</h4>
<div class="outline-text-4" id="text-4-40-3">
<p>
This runs a bash script which in turn
</p>
<ol class="org-ol">
<li>curls the calendar file from the Canvas website</li>
<li>runs a python program which parses the calendar file into <code>ohs_gcal.org</code> according to the class. In doing so, it takes into account whether the timestamp should be a deadline or not.</li>
</ol>

<p>
See <a href="https://github.com/piercegwang/ohsics_to_org">https://github.com/piercegwang/ohsics<sub>to</sub><sub>org</sub></a> for more info.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #7984D1;">"C-c s-g o"</span>) (<span style="color: #ff2afc; font-weight: bold;">lambda</span> () (<span style="color: #ff2afc; font-weight: bold;">interactive</span>) (start-process-shell-command <span style="color: #7984D1;">"Running ~/QScripts/syncgcal.sh"</span> nil <span style="color: #7984D1;">"bash ~/QScripts/syncgcal.sh"</span>)))
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pierce Wang</p>
<p class="date">Created: 2020-11-29 Sun 12:21</p>
</div>
</body>
</html>
